{"name":"Unlimited Edition","code":"2ED","releaseDate":"1993-12-01","border":"white","cards":[{"type":"Creature - Elemental","types":["Creature"],"multiverseid":691,"name":"Air Elemental","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Richard Thomas","power":4,"toughness":4,"manaCost":"{3}{U}{U}","text":"Flying","flavor":"These spirits of the air are winsome and wild and cannot be truly contained. Only marginally intelligent, they often substitute whimsy for strategy, delighting in mischief and mayhem.","imageName":"air elemental"},{"type":"Instant","types":["Instant"],"multiverseid":692,"name":"Ancestral Recall","cmc":1,"rarity":"Rare","artist":"Mark Poole","manaCost":"{U}","text":"Target player draws three cards.","imageName":"ancestral recall"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":693,"name":"Animate Artifact","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Douglas Schuler","manaCost":"{3}{U}","text":"Enchant artifact\n\nAs long as enchanted artifact isn't a creature, it's an artifact creature with power and toughness each equal to its converted mana cost.","rulings":[{"date":"2008-08-01","text":"This card has been returned to its original functionality. If it is enchanting an artifact that's already a creature, it won't change its power and toughness."},{"date":"2008-08-01","text":"A noncreature permanent that turns into a creature can attack, and its {T} abilities can be activated, only if its controller has continuously controlled that permanent since the beginning of his or her most recent turn. It doesn't matter how long the permanent has been a creature."}],"imageName":"animate artifact"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":645,"name":"Animate Dead","subtypes":["Aura"],"cmc":2,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{1}{B}","text":"Enchant creature card in a graveyard\n\nWhen Animate Dead enters the battlefield, if it's on the battlefield, it loses \"enchant creature card in a graveyard\" and gains \"enchant creature put onto the battlefield with Animate Dead.\" Return enchanted creature card to the battlefield under your control and attach Animate Dead to it. When Animate Dead leaves the battlefield, that creature's controller sacrifices it.\n\nEnchanted creature gets -1/-0.","rulings":[{"date":"2004-10-04","text":"When putting a card onto the battlefield that requires a definition for its value or some other choice, you do what is needed to define the value or make the choice."},{"date":"2007-09-16","text":"This is a new wording. Animate Dead is now an Aura. You target a creature card in a graveyard when you cast it. It enters the battlefield attached to that card. Then it returns that card to the battlefield, and attaches itself to that card again (since the card is treated as a new object on the battlefield)."},{"date":"2007-09-16","text":"Once the creature is returned to the battlefield, Animate Dead can't be attached to anything other than it (unless Animate Dead somehow manages to put a different creature onto the battlefield). Attempting to move Animate Dead to another creature won't work."},{"date":"2008-04-01","text":"If the creature card put onto the battlefield has Protection from Black (or anything that prevents this from legally being attached), this won’t be able to attach to it. Then this will go to the graveyard as a State-Based Action, causing the creature to be sacrificed."},{"date":"2008-04-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"animate dead"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":829,"name":"Animate Wall","subtypes":["Aura"],"cmc":1,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant Wall\n\nEnchanted Wall can attack as though it didn't have defender.","rulings":[{"date":"2007-09-16","text":"This is a change from the most recent wording. As was the case in the past, Animate Wall can now enchant only a Wall."}],"imageName":"animate wall"},{"type":"Artifact","types":["Artifact"],"multiverseid":598,"name":"Ankh of Mishra","cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{2}","text":"Whenever a land enters the battlefield, Ankh of Mishra deals 2 damage to that land's controller.","rulings":[{"date":"2004-10-04","text":"This triggers on any land entering the battlefield. This includes playing a land or putting a land onto the battlefield using a spell or ability."},{"date":"2004-10-04","text":"It determines the land's controller at the time the ability resolves. If the land leaves the battlefield before the ability resolves, the land's last controller before it left is used."}],"imageName":"ankh of mishra"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":830,"name":"Armageddon","cmc":4,"rarity":"Rare","artist":"Jesper Myrfors","manaCost":"{3}{W}","text":"Destroy all lands.","imageName":"armageddon"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":737,"name":"Aspect of Wolf","subtypes":["Aura"],"cmc":2,"rarity":"Rare","artist":"Jeff A. Menges","manaCost":"{1}{G}","text":"Enchant creature\n\nEnchanted creature gets +X/+Y, where X is half the number of Forests you control, rounded down, and Y is half the number of Forests you control, rounded up.","rulings":[{"date":"2009-10-01","text":"The effect is continuously updated based on the number of Forests you control at any given time."}],"imageName":"aspect of wolf"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":646,"name":"Bad Moon","cmc":2,"rarity":"Rare","artist":"Jesper Myrfors","manaCost":"{1}{B}","text":"Black creatures get +1/+1.","imageName":"bad moon"},{"type":"Land - Swamp Mountain","types":["Land"],"multiverseid":878,"name":"Badlands","subtypes":["Swamp","Mountain"],"rarity":"Rare","artist":"Rob Alexander","rulings":[{"date":"2004-10-04","text":"Land type changing effects that change a dual land's land type will remove the old land types completely. Text-changing effects that just change one of the two land types will leave the other type unaffected."},{"date":"2004-10-04","text":"This card is a Mountain and a Swamp even while in the graveyard, library, or any other zone."},{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"badlands"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":831,"name":"Balance","cmc":2,"rarity":"Rare","artist":"Mark Poole","manaCost":"{1}{W}","text":"Each player chooses a number of lands he or she controls equal to the number of lands controlled by the player who controls the fewest, then sacrifices the rest. Players discard cards and sacrifice creatures the same way.","rulings":[{"date":"2004-10-04","text":"This spell is not targeted, so cards which can't be targeted, such as a creature with Protection from White, are both counted and valid choices for being sacrificed."},{"date":"2004-10-04","text":"All cards sacrificed at one time go to the graveyard simultaneously. All cards discarded go to the graveyard simultaneously. As always, you pick the order they end up in the graveyard."},{"date":"2004-10-04","text":"Cards are not counted until the appropriate step. So, a land creature sacrificed to the first part of the spell would not count for the last part."}],"imageName":"balance"},{"type":"Artifact","types":["Artifact"],"multiverseid":599,"name":"Basalt Monolith","cmc":3,"rarity":"Uncommon","artist":"Jesper Myrfors","manaCost":"{3}","text":"Basalt Monolith doesn't untap during your untap step.\n\n{T}: Add {3} to your mana pool.\n\n{3}: Untap Basalt Monolith.","rulings":[{"date":"2004-10-04","text":"It can be untapped as often as you can pay for it."}],"imageName":"basalt monolith"},{"type":"Land - Swamp Forest","types":["Land"],"multiverseid":879,"name":"Bayou","subtypes":["Swamp","Forest"],"rarity":"Rare","artist":"Jesper Myrfors","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"bayou"},{"type":"Creature - Human Soldier","types":["Creature"],"multiverseid":832,"name":"Benalish Hero","subtypes":["Human","Soldier"],"cmc":1,"rarity":"Common","artist":"Douglas Shuler","power":1,"toughness":1,"manaCost":"{W}","text":"Banding (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)","flavor":"Benalia has a complex caste system that changes with the lunar year. No matter what the season, the only caste that cannot be attained by either heredity or money is that of the hero.","rulings":[{"date":"2008-10-01","text":"If a creature with banding attacks, it can team up with any number of other attacking creatures with banding (and up to one nonbanding creature) and attack as a unit called a \"band.\" The band can be blocked by any creature that could block a single creature in the band. Blocking any creature in a band blocks the entire band. If a creature with banding is blocked, the attacking player chooses how the blockers' damage is assigned."},{"date":"2008-10-01","text":"A maximum of one nonbanding creature can join an attacking band no matter how many creatures with banding are in it."},{"date":"2008-10-01","text":"Creatures in the same band must all attack the same player or planeswalker."},{"date":"2009-10-01","text":"If a creature in combat has banding, its controller assigns damage for creatures blocking or blocked by it. That player can ignore the damage assignment order when making this assignment."}],"imageName":"benalish hero"},{"type":"Instant","types":["Instant"],"multiverseid":738,"name":"Berserk","cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{G}","text":"Cast Berserk only before the combat damage step.\n\nTarget creature gains trample and gets +X/+0 until end of turn, where X is its power. At the beginning of the next end step, destroy that creature if it attacked this turn.","rulings":[{"date":"2004-10-04","text":"If the permanent stops being a creature before the end of the turn, it is still destroyed."}],"imageName":"berserk"},{"type":"Creature - Bird","types":["Creature"],"multiverseid":739,"name":"Birds of Paradise","subtypes":["Bird"],"cmc":1,"rarity":"Rare","artist":"Mark Poole","power":0,"toughness":1,"manaCost":"{G}","text":"Flying\n\n{T}: Add one mana of any color to your mana pool.","imageName":"birds of paradise"},{"type":"Creature - Human Knight","types":["Creature"],"multiverseid":647,"name":"Black Knight","subtypes":["Human","Knight"],"cmc":2,"rarity":"Uncommon","artist":"Jeff A. Menges","power":2,"toughness":2,"manaCost":"{B}{B}","text":"First strike (This creature deals combat damage before creatures without first strike.)\n\nProtection from white (This creature can't be blocked, targeted, dealt damage, or enchanted by anything white.)","flavor":"Battle doesn't need a purpose; the battle is its own purpose. You don't ask why a plague spreads or a field burns. Don't ask why I fight.","imageName":"black knight"},{"type":"Artifact","types":["Artifact"],"multiverseid":600,"name":"Black Lotus","cmc":0,"rarity":"Rare","artist":"Christopher Rush","manaCost":"{0}","text":"{T}, Sacrifice Black Lotus: Add three mana of any one color to your mana pool.","imageName":"black lotus"},{"type":"Artifact","types":["Artifact"],"multiverseid":601,"name":"Black Vise","cmc":1,"rarity":"Uncommon","artist":"Richard Thomas","manaCost":"{1}","text":"As Black Vise enters the battlefield, choose an opponent.\n\nAt the beginning of the chosen player's upkeep, Black Vise deals X damage to that player, where X is the number of cards in his or her hand minus 4.","rulings":[{"date":"2004-10-04","text":"You choose one opposing player as it enters the battlefield and it only affects that one player. This choice is not changed even if Black Vise changes controllers. It becomes useless but stays on the battlefield if that player leaves the game."},{"date":"2009-10-01","text":"If the chosen player has four or fewer cards in his or her hand as Black Vise's ability resolves, the ability just won't do anything that turn."}],"imageName":"black vise"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":833,"name":"Black Ward","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from black. This effect doesn't remove Black Ward.","imageName":"black ward"},{"type":"Instant","types":["Instant"],"multiverseid":834,"name":"Blaze of Glory","cmc":1,"rarity":"Rare","artist":"Richard Thomas","manaCost":"{W}","text":"Cast Blaze of Glory only during combat before blockers are declared.\n\nTarget creature defending player controls can block any number of creatures this turn. It blocks each attacking creature this turn if able.","rulings":[{"date":"2004-10-04","text":"Does not allow a tapped creature to block, or allow a creature to block any creatures it would not normally be able to block."}],"imageName":"blaze of glory"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":835,"name":"Blessing","subtypes":["Aura"],"cmc":2,"rarity":"Rare","artist":"Julie Baroh","manaCost":"{W}{W}","text":"Enchant creature\n\n{W}: Enchanted creature gets +1/+1 until end of turn.","imageName":"blessing"},{"type":"Instant","types":["Instant"],"multiverseid":694,"name":"Blue Elemental Blast","cmc":1,"rarity":"Common","artist":"Richard Thomas","manaCost":"{U}","text":"Choose one — Counter target red spell; or destroy target red permanent.","rulings":[{"date":"2004-10-04","text":"The decision to counter a spell or destroy a permanent is a decision made on announcement before the target is selected. If the spell is redirected, this mode can't be changed, so only targets of the selected type are valid."}],"imageName":"blue elemental blast"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":836,"name":"Blue Ward","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from blue. This effect doesn't remove Blue Ward.","imageName":"blue ward"},{"type":"Creature - Wraith","types":["Creature"],"multiverseid":648,"name":"Bog Wraith","subtypes":["Wraith"],"cmc":4,"rarity":"Uncommon","artist":"Jeff A. Menges","power":3,"toughness":3,"manaCost":"{3}{B}","text":"Swampwalk (This creature is unblockable as long as defending player controls a Swamp.)","flavor":"'Twas in the bogs of Cannelbrae \n\nMy mate did meet an early grave\n\n'Twas nothing left for us to save\n\nIn the peat-filled bogs of Cannelbrae.","imageName":"bog wraith"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":695,"name":"Braingeyser","cmc":2,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{X}{U}{U}","text":"Target player draws X cards.","imageName":"braingeyser"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":783,"name":"Burrowing","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Mark Poole","manaCost":"{R}","text":"Enchant creature\n\nEnchanted creature has mountainwalk.","imageName":"burrowing"},{"type":"Instant","types":["Instant"],"multiverseid":740,"name":"Camouflage","cmc":1,"rarity":"Uncommon","artist":"Jesper Myrfors","manaCost":"{G}","text":"Cast Camouflage only during your declare attackers step.\n\nThis turn, instead of declaring blockers, each defending player chooses any number of creatures he or she controls and divides them into a number of piles equal to the number of attacking creatures for whom that player is the defending player. Creatures he or she controls that can block additional creatures may likewise be put into additional piles. Assign each pile to a different one of those attacking creatures at random. Each creature in a pile that can block the creature that pile is assigned to does so. (Piles can be empty.)","imageName":"camouflage"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":837,"name":"Castle","cmc":4,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{3}{W}","text":"Untapped creatures you control get +0/+2.","imageName":"castle"},{"type":"Artifact","types":["Artifact"],"multiverseid":602,"name":"Celestial Prism","cmc":3,"rarity":"Uncommon","artist":"Amy Weber","manaCost":"{3}","text":"{2}, {T}: Add one mana of any color to your mana pool.","imageName":"celestial prism"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":741,"name":"Channel","cmc":2,"rarity":"Uncommon","artist":"Richard Thomas","manaCost":"{G}{G}","text":"Until end of turn, any time you could activate a mana ability, you may pay 1 life. If you do, add {1} to your mana pool.","rulings":[{"date":"2004-10-04","text":"You can't pay life you don't have. In other words, you can't Channel yourself below zero life."}],"imageName":"channel"},{"type":"Artifact","types":["Artifact"],"multiverseid":603,"name":"Chaos Orb","cmc":2,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{2}","text":"{1}, {T}: If Chaos Orb is on the battlefield, flip Chaos Orb onto the battlefield from a height of at least one foot. If Chaos Orb turns over completely at least once during the flip, destroy all permanents it touches. Then destroy Chaos Orb.","rulings":[{"date":"2004-10-04","text":"Chaos Orb can only affect permanents. Cards that are in the game but not on the battlefield, such as those in the Library and Graveyard, can't be affected."},{"date":"2004-10-04","text":"You can arrange your cards any time before the Orb is put onto the battlefield, but not after. In general, you should not stack cards or put them in places where your opponent can't read the names of all of them or count them. This is recommended good gaming practice."},{"date":"2004-10-04","text":"It must flip 360 degrees (that's what \"flip\" means). And this flip must be in the air and not in your hand."},{"date":"2004-10-04","text":"This is a not a targeted ability."},{"date":"2004-10-04","text":"If you have sleeves on cards, they count as the cards."},{"date":"2004-10-04","text":"You can't interfere in any physical way with the casting of this card."}],"imageName":"chaos orb"},{"type":"Instant","types":["Instant"],"multiverseid":784,"name":"Chaoslace","cmc":1,"rarity":"Rare","artist":"Dameon Willich","manaCost":"{R}","text":"Target spell or permanent becomes red. (Its mana symbols remain unchanged.)","imageName":"chaoslace"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":838,"name":"Circle of Protection: Black","cmc":2,"rarity":"Common","artist":"Jesper Myrfors","manaCost":"{1}{W}","text":"{1}: The next time a black source of your choice would deal damage to you this turn, prevent that damage.","rulings":[{"date":"2004-10-04","text":"A source of damage is a permanent, a spell on the stack (including one that creates a permanent), or any object referred to by an object on the stack. A source doesn't need to be capable of dealing damage to be a legal choice."},{"date":"2004-10-04","text":"Can be used even when there is no damage to prevent. It prevents the next damage (if any) from the source this turn."}],"imageName":"circle of protection black"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":839,"name":"Circle of Protection: Blue","cmc":2,"rarity":"Common","artist":"Dameon Willich","manaCost":"{1}{W}","text":"{1}: The next time a blue source of your choice would deal damage to you this turn, prevent that damage.","rulings":[{"date":"2004-10-04","text":"A source of damage is a permanent, a spell on the stack (including one that creates a permanent), or any object referred to by an object on the stack. A source doesn't need to be capable of dealing damage to be a legal choice."},{"date":"2004-10-04","text":"Can be used even when there is no damage to prevent. It prevents the next damage (if any) from the source this turn."}],"imageName":"circle of protection blue"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":840,"name":"Circle of Protection: Green","cmc":2,"rarity":"Common","artist":"Sandra Everingham","manaCost":"{1}{W}","text":"{1}: The next time a green source of your choice would deal damage to you this turn, prevent that damage.","rulings":[{"date":"2004-10-04","text":"A source of damage is a permanent, a spell on the stack (including one that creates a permanent), or any object referred to by an object on the stack. A source doesn't need to be capable of dealing damage to be a legal choice."},{"date":"2004-10-04","text":"Can be used even when there is no damage to prevent. It prevents the next damage (if any) from the source this turn."}],"imageName":"circle of protection green"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":841,"name":"Circle of Protection: Red","cmc":2,"rarity":"Common","artist":"Mark Tedin","manaCost":"{1}{W}","text":"{1}: The next time a red source of your choice would deal damage to you this turn, prevent that damage.","rulings":[{"date":"2004-10-04","text":"A source of damage is a permanent, a spell on the stack (including one that creates a permanent), or any object referred to by an object on the stack. A source doesn't need to be capable of dealing damage to be a legal choice."},{"date":"2004-10-04","text":"Can be used even when there is no damage to prevent. It prevents the next damage (if any) from the source this turn."}],"imageName":"circle of protection red"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":842,"name":"Circle of Protection: White","cmc":2,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{1}{W}","text":"{1}: The next time a white source of your choice would deal damage to you this turn, prevent that damage.","rulings":[{"date":"2004-10-04","text":"A source of damage is a permanent, a spell on the stack (including one that creates a permanent), or any object referred to by an object on the stack. A source doesn't need to be capable of dealing damage to be a legal choice."},{"date":"2004-10-04","text":"Can be used even when there is no damage to prevent. It prevents the next damage (if any) from the source this turn."}],"imageName":"circle of protection white"},{"type":"Artifact Creature - Beast","types":["Artifact","Creature"],"multiverseid":604,"name":"Clockwork Beast","subtypes":["Beast"],"cmc":6,"rarity":"Rare","artist":"Drew Tucker","power":0,"toughness":4,"manaCost":"{6}","text":"Clockwork Beast enters the battlefield with seven +1/+0 counters on it.\n\nAt end of combat, if Clockwork Beast attacked or blocked this combat, remove a +1/+0 counter from it.\n\n{X}, {T}: Put up to X +1/+0 counters on Clockwork Beast. This ability can't cause the total number of +1/+0 counters on Clockwork Beast to be greater than seven. Activate this ability only during your upkeep.","rulings":[{"date":"2004-10-04","text":"Loses a counter even if it is affected by a Fog-like effect which prevents it from dealing damage."},{"date":"2004-10-04","text":"Can attack or block even if it has no counters."},{"date":"2007-09-16","text":"This is a change from the most recent wording. Now, if some other spell or ability causes +1/+0 counters to be put on Clockwork Beast, it can wind up with more than seven such counters on it."},{"date":"2007-09-16","text":"If Clockwork Beast has seven or fewer +1/+0 counters on it when its last ability resolves, it can wind up a maximum of seven such counters on it. If it has seven or more +1/+0 counters on it, the ability will have no effect."},{"date":"2007-09-16","text":"Clockwork Beast's last ability resolves, you can choose to put fewer than X +1/+0 counters on it."}],"imageName":"clockwork beast"},{"type":"Creature - Shapeshifter","types":["Creature"],"multiverseid":696,"name":"Clone","subtypes":["Shapeshifter"],"cmc":4,"rarity":"Uncommon","artist":"Julie Baroh","power":0,"toughness":0,"manaCost":"{3}{U}","text":"You may have Clone enter the battlefield as a copy of any creature on the battlefield.","rulings":[{"date":"2007-07-15","text":"If the chosen creature is copying something else (for example, if the chosen creature is another Clone), then your Clone enters the battlefield as whatever the chosen creature copied."},{"date":"2007-07-15","text":"If the chosen creature is a token, Clone copies the original characteristics of that token as stated by the effect that put it onto the battlefield. Clone is not a token."},{"date":"2007-07-15","text":"Any enters-the-battlefield abilities of the copied creature will trigger when Clone enters the battlefield. Any \"as [this creature] enters the battlefield\" or \"[this creature] enters the battlefield with\" abilities of the chosen creature will also work."},{"date":"2009-10-01","text":"If the chosen creature has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."},{"date":"2012-07-01","text":"Clone copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."},{"date":"2012-07-01","text":"If Clone somehow enters the battlefield at the same time as another creature, Clone can't become a copy of that creature. You may only choose a creature that's already on the battlefield."},{"date":"2012-07-01","text":"You can choose not to copy anything. In that case, Clone enters the battlefield as a 0/0 Shapeshifter creature, and is probably put into the graveyard immediately."}],"imageName":"clone"},{"type":"Creature - Cockatrice","types":["Creature"],"multiverseid":742,"name":"Cockatrice","subtypes":["Cockatrice"],"cmc":5,"rarity":"Rare","artist":"Dan Frazier","power":2,"toughness":4,"manaCost":"{3}{G}{G}","text":"Flying\n\nWhenever Cockatrice blocks or becomes blocked by a non-Wall creature, destroy that creature at end of combat.","rulings":[{"date":"2004-10-04","text":"The ability destroys the creature at the end of the combat, which is after all first strike and normal damage dealing is done. This means that a creature may have to regenerate twice to survive the combat, once from damage and once again at end of combat."}],"imageName":"cockatrice"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":843,"name":"Consecrate Land","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Jeff A. Menges","manaCost":"{W}","text":"Enchant land\n\nEnchanted land is indestructible and can't be enchanted by other Auras.","rulings":[{"date":"2005-04-01","text":"The land can be targeted by land-destroying spells and the spell will resolve, but the land will simply not be destroyed."},{"date":"2006-09-25","text":"If Consecrate Land enters the battlefield attached to a land that's enchanted by other Auras, those Auras are put into their owners' graveyards."},{"date":"2006-09-25","text":"An indestructible permanent can't be destroyed, but it can still be sacrificed, exiled, put into a graveyard, and so on."}],"imageName":"consecrate land"},{"type":"Artifact","types":["Artifact"],"multiverseid":605,"name":"Conservator","cmc":4,"rarity":"Uncommon","artist":"Amy Weber","manaCost":"{4}","text":"{3}, {T}: Prevent the next 2 damage that would be dealt to you this turn.","imageName":"conservator"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":649,"name":"Contract from Below","cmc":1,"rarity":"Rare","artist":"Douglas Schuler","manaCost":"{B}","text":"Remove Contract from Below from your deck before playing if you're not playing for ante.\n\nDiscard your hand, add the top card of your library to the ante, then draw seven cards.","imageName":"contract from below"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":697,"name":"Control Magic","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{2}{U}{U}","text":"Enchant creature\n\nYou control enchanted creature.","rulings":[{"date":"2004-10-04","text":"You take control of a creature, but Auras enchanting and Equipment attached to the creature do not change controller."}],"imageName":"control magic"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":844,"name":"Conversion","cmc":4,"rarity":"Uncommon","artist":"Jesper Myrfors","manaCost":"{2}{W}{W}","text":"At the beginning of your upkeep, sacrifice Conversion unless you pay {W}{W}.\n\nAll Mountains are Plains.","rulings":[{"date":"2004-10-04","text":"The Conversion effect is a continuous effect. There is no chance to tap a just-played mountain for red mana before it becomes a plains."},{"date":"2006-10-15","text":"Will not add or remove Snow Supertype to or from a land."}],"imageName":"conversion"},{"type":"Artifact","types":["Artifact"],"multiverseid":606,"name":"Copper Tablet","cmc":2,"rarity":"Uncommon","artist":"Amy Weber","manaCost":"{2}","text":"At the beginning of each player's upkeep, Copper Tablet deals 1 damage to that player.","imageName":"copper tablet"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":698,"name":"Copy Artifact","cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{1}{U}","text":"You may have Copy Artifact enter the battlefield as a copy of any artifact on the battlefield, except it's an enchantment in addition to its other types.","rulings":[{"date":"2004-10-04","text":"The copy is both an artifact and an enchantment, so it is an artifact-enchantment (perhaps even an artifact-creature-enchantment). It can be affected by anything which affects either type of permanent."},{"date":"2004-10-04","text":"The copy of the artifact is not still blue. It copies the color of the thing it is copying."},{"date":"2004-10-04","text":"The artifact to copy is chosen at the time this card enters the battlefield. If there is no valid artifact to choose, then this card enters the battlefield as an enchantment that has no effect."}],"imageName":"copy artifact"},{"type":"Instant","types":["Instant"],"multiverseid":699,"name":"Counterspell","cmc":2,"rarity":"Uncommon","artist":"Mark Poole","manaCost":"{U}{U}","text":"Counter target spell.","imageName":"counterspell"},{"type":"Creature - Wurm","types":["Creature"],"multiverseid":743,"name":"Craw Wurm","subtypes":["Wurm"],"cmc":6,"rarity":"Common","artist":"Daniel Gelon","power":6,"toughness":4,"manaCost":"{4}{G}{G}","flavor":"The most terrifying thing about the Craw Wurm is probably the horrible crashing sound it makes as it speeds through the forest. This noise is so loud it echoes through the trees and seems to come from all directions at once.","imageName":"craw wurm"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":700,"name":"Creature Bond","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{1}{U}","text":"Enchant creature\n\nWhen enchanted creature dies, Creature Bond deals damage equal to that creature's toughness to the creature's controller.","imageName":"creature bond"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":845,"name":"Crusade","cmc":2,"rarity":"Rare","artist":"Mark Poole","manaCost":"{W}{W}","text":"White creatures get +1/+1.","imageName":"crusade"},{"type":"Artifact","types":["Artifact"],"multiverseid":607,"name":"Crystal Rod","cmc":1,"rarity":"Uncommon","artist":"Amy Weber","manaCost":"{1}","text":"Whenever a player casts a blue spell, you may pay {1}. If you do, you gain 1 life.","imageName":"crystal rod"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":650,"name":"Cursed Land","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Jesper Myrfors","manaCost":"{2}{B}{B}","text":"Enchant land\n\nAt the beginning of the upkeep of enchanted land's controller, Cursed Land deals 1 damage to that player.","imageName":"cursed land"},{"type":"Artifact","types":["Artifact"],"multiverseid":608,"name":"Cyclopean Tomb","cmc":4,"rarity":"Rare","artist":"Anson Maddocks","manaCost":"{4}","text":"{2}, {T}: Put a mire counter on target non-Swamp land. That land is a Swamp for as long as it has a mire counter on it. Activate this ability only during your upkeep.\n\nWhen Cyclopean Tomb is put into a graveyard from the battlefield, at the beginning of each of your upkeeps for the rest of the game, remove all mire counters from a land that a mire counter was put onto with Cyclopean Tomb but that a mire counter has not been removed from with Cyclopean Tomb.","rulings":[{"date":"2006-10-15","text":"Will not add or remove Snow Supertype to or from a land."},{"date":"2008-08-01","text":"After leaving the battlefield, the ability triggers during each of your upkeeps for the rest of the game. As it resolves, you must remove a mire counter from a land that had a mire counter put on it by that instance of Cyclopean Tomb, but it doesn't matter where the mire counter you remove came from. For instance, you could remove mire counters that were put on the land by Gilder Bairn."},{"date":"2008-08-01","text":"The land remains a Swamp as long as it has a mire counter on it. This effect is not tied to the Tomb remaining on the battlefield."}],"imageName":"cyclopean tomb"},{"type":"Instant","types":["Instant"],"multiverseid":651,"name":"Dark Ritual","cmc":1,"rarity":"Common","artist":"Sandra Everingham","manaCost":"{B}","text":"Add {B}{B}{B} to your mana pool.","imageName":"dark ritual"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":652,"name":"Darkpact","cmc":3,"rarity":"Rare","artist":"Quinton Hoover","manaCost":"{B}{B}{B}","text":"Remove Darkpact from your deck before playing if you're not playing for ante.\n\nYou own target card in the ante. Exchange that card with the top card of your library.","imageName":"darkpact"},{"type":"Instant","types":["Instant"],"multiverseid":846,"name":"Death Ward","cmc":1,"rarity":"Common","artist":"Mark Poole","manaCost":"{W}","text":"Regenerate target creature.","imageName":"death ward"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":653,"name":"Deathgrip","cmc":2,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{B}{B}","text":"{B}{B}: Counter target green spell.","imageName":"deathgrip"},{"type":"Instant","types":["Instant"],"multiverseid":654,"name":"Deathlace","cmc":1,"rarity":"Rare","artist":"Sandra Everingham","manaCost":"{B}","text":"Target spell or permanent becomes black. (Mana symbols on that permanent remain unchanged.)","imageName":"deathlace"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":655,"name":"Demonic Attorney","cmc":3,"rarity":"Rare","artist":"Daniel Gelon","manaCost":"{1}{B}{B}","text":"Remove Demonic Attorney from your deck before playing if you're not playing for ante.\n\nEach player antes the top card of his or her library.","imageName":"demonic attorney"},{"type":"Creature - Demon","types":["Creature"],"multiverseid":656,"name":"Demonic Hordes","subtypes":["Demon"],"cmc":6,"rarity":"Rare","artist":"Jesper Myrfors","power":5,"toughness":5,"manaCost":"{3}{B}{B}{B}","text":"{T}: Destroy target land.\n\nAt the beginning of your upkeep, unless you pay {B}{B}{B}, tap Demonic Hordes and sacrifice a land of an opponent's choice.","flavor":"Created to destroy Dominia, Demons can sometimes be bent to a more focused purpose.","imageName":"demonic hordes"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":657,"name":"Demonic Tutor","cmc":2,"rarity":"Uncommon","artist":"Douglas Schuler","manaCost":"{1}{B}","text":"Search your library for a card and put that card into your hand. Then shuffle your library.","rulings":[{"date":"2004-10-04","text":"You pick a card on resolution."},{"date":"2004-10-04","text":"You don't reveal the card to your opponent."},{"date":"2004-10-04","text":"This card is put directly into your hand. It is not drawn."}],"imageName":"demonic tutor"},{"type":"Artifact","types":["Artifact"],"multiverseid":609,"name":"Dingus Egg","cmc":4,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{4}","text":"Whenever a land is put into a graveyard from the battlefield, Dingus Egg deals 2 damage to that land's controller.","imageName":"dingus egg"},{"type":"Instant","types":["Instant"],"multiverseid":847,"name":"Disenchant","cmc":2,"rarity":"Common","artist":"Amy Weber","manaCost":"{1}{W}","text":"Destroy target artifact or enchantment.","rulings":[{"date":"2004-10-04","text":"This is not modal. If the target changes from an artifact to an enchantment or vice versa, this still destroys it."}],"imageName":"disenchant"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":785,"name":"Disintegrate","cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{X}{R}","text":"Disintegrate deals X damage to target creature or player. That creature can't be regenerated this turn. If the creature would die this turn, exile it instead.","rulings":[{"date":"2004-10-04","text":"The \"can't regenerate\" is an effect of Disintegrate and not an effect of the damage. It works even if the damage is prevented or redirected. If redirected, the damage does not take this effect with it."},{"date":"2004-10-04","text":"Disintegrated creatures do not go to the graveyard at all before being exiled. They do not trigger abilities which trigger due to a creature going to the graveyard."}],"imageName":"disintegrate"},{"type":"Artifact","types":["Artifact"],"multiverseid":610,"name":"Disrupting Scepter","cmc":3,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{3}","text":"{3}, {T}: Target player discards a card. Activate this ability only during your turn.","rulings":[{"date":"2004-10-04","text":"You can use it on yourself."}],"imageName":"disrupting scepter"},{"type":"Creature - Dragon","types":["Creature"],"multiverseid":786,"name":"Dragon Whelp","subtypes":["Dragon"],"cmc":4,"rarity":"Uncommon","artist":"Amy Weber","power":2,"toughness":3,"manaCost":"{2}{R}{R}","text":"Flying\n\n{R}: Dragon Whelp gets +1/+0 until end of turn. If this ability has been activated four or more times this turn, sacrifice Dragon Whelp at the beginning of the next end step.","flavor":"\"O to be a dragon . . . of silkworm size or immense . . .\"\n\n—Marianne Moore, \"O to Be a Dragon\"","rulings":[{"date":"2009-10-01","text":"The first three times Dragon Whelp's ability is activated in a turn will do nothing other than give it +1/+0 until end of turn. Any subsequent activations will also cause its delayed triggered ability to trigger. That means if you activate Dragon Whelp's ability five times, for example, two different delayed triggered abilities will trigger at the beginning of the next end step and cause you to sacrifice Dragon Whelp."},{"date":"2009-10-01","text":"If the fourth (or more) time Dragon Whelp's ability is activated during the same turn happens to be during that turn's end step, the delayed triggered ability won't trigger until the beginning of the next turn's end step. You'll have to sacrifice Dragon Whelp at that time."}],"imageName":"dragon whelp"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":658,"name":"Drain Life","cmc":2,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{X}{1}{B}","text":"Spend only black mana on X.\n\nDrain Life deals X damage to target creature or player. You gain life equal to the damage dealt, but not more life than the player's life total before Drain Life dealt damage or the creature's toughness.","rulings":[{"date":"2004-10-04","text":"Cost reducers can be used to reduce the X part of the mana cost."},{"date":"2004-10-04","text":"You may gain up to the total toughness of the creature even if it was already damaged."}],"imageName":"drain life"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":701,"name":"Drain Power","cmc":2,"rarity":"Rare","artist":"Douglas Schuler","manaCost":"{U}{U}","text":"Target player activates a mana ability of each land he or she controls. Then put all mana from that player's mana pool into yours.","rulings":[{"date":"2004-10-04","text":"This card forces the target player to draw mana from lands if they are untapped, but that player can choose how to draw the mana if a land he or she controls has multiple mana abilities, or mana abilities with choices."},{"date":"2004-10-04","text":"Since this is a Sorcery, your opponent may use Instants and abilities of permanents in response to this spell before you get the mana from their mana pool and lands."},{"date":"2004-10-04","text":"If a land can draw a variable amount of mana, the target player (not the player of this spell) chooses how much to draw."},{"date":"2013-04-15","text":"A mana ability is an ability that doesn't target and could put mana into a player's mana pool when it resolves."},{"date":"2013-04-15","text":"A mana ability is an ability that (1) isn't a loyalty ability, (2) doesn't target, and (3) could put mana into a player's mana pool when it resolves."}],"imageName":"drain power"},{"type":"Creature - Skeleton","types":["Creature"],"multiverseid":659,"name":"Drudge Skeletons","subtypes":["Skeleton"],"cmc":2,"rarity":"Common","artist":"Sandra Everingham","power":1,"toughness":1,"manaCost":"{1}{B}","text":"{B}: Regenerate Drudge Skeletons. (The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)","flavor":"Bones scattered around us joined to form misshapen bodies. We struck at them repeatedly—they fell, but soon formed again, with the same mocking look on their faceless skulls.","imageName":"drudge skeletons"},{"type":"Creature - Dwarf","types":["Creature"],"multiverseid":787,"name":"Dwarven Demolition Team","subtypes":["Dwarf"],"cmc":3,"rarity":"Uncommon","artist":"Kev Brockschmidt","power":1,"toughness":1,"manaCost":"{2}{R}","text":"{T}: Destroy target Wall.","flavor":"Foolishly, Najib retreated to his castle at El-Abar; the next morning he was dead. In just one night, the dwarven forces had reduced the mighty walls to mere rubble.","imageName":"dwarven demolition team"},{"type":"Creature - Dwarf Warrior","types":["Creature"],"multiverseid":788,"name":"Dwarven Warriors","subtypes":["Dwarf","Warrior"],"cmc":3,"rarity":"Common","artist":"Douglas Schuler","power":1,"toughness":1,"manaCost":"{2}{R}","text":"{T}: Target creature with power 2 or less is unblockable this turn.","rulings":[{"date":"2004-10-04","text":"The ability can be activated after a creature is blocked, but it has no effect. Once a creature is blocked, it can't be unblocked."},{"date":"2004-10-04","text":"If you increase the power of the targeted creature after the ability resolves, it will still be unblockable that turn."}],"imageName":"dwarven warriors"},{"type":"Creature - Elemental","types":["Creature"],"multiverseid":789,"name":"Earth Elemental","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Dan Frazier","power":4,"toughness":5,"manaCost":"{3}{R}{R}","flavor":"Earth Elementals have the eternal strength of stone and the endurance of mountains. Primordially connected to the land they inhabit, they take a long-term view of things, scorning the impetuous haste of short-lived mortal creatures.","imageName":"earth elemental"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":790,"name":"Earthbind","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Quinton Hoover","manaCost":"{R}","text":"Enchant creature\n\nWhen Earthbind enters the battlefield, if enchanted creature has flying, Earthbind deals 2 damage to that creature and Earthbind gains \"Enchanted creature loses flying.\"","rulings":[{"date":"2004-10-04","text":"If the enchanted creature gains flying after Earthbind is put onto it, it will have flying. The two effects are simply applied in timestamp order."}],"imageName":"earthbind"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":791,"name":"Earthquake","cmc":1,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{X}{R}","text":"Earthquake deals X damage to each creature without flying and each player.","rulings":[{"date":"2004-10-04","text":"Whether or not a creature is without flying is only checked on resolution."}],"imageName":"earthquake"},{"type":"Creature - Elf Archer","types":["Creature"],"multiverseid":744,"name":"Elvish Archers","subtypes":["Elf","Archer"],"cmc":2,"rarity":"Rare","artist":"Anson Maddocks","power":2,"toughness":1,"manaCost":"{1}{G}","text":"First strike","flavor":"I tell you, there was so many arrows flying about you couldn't hardly see the sun. So I says to young Angus, \"Well, at least now we're fighting in the shade\"","imageName":"elvish archers"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":660,"name":"Evil Presence","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Sandra Everingham","manaCost":"{B}","text":"Enchant land\n\nEnchanted land is a Swamp.","rulings":[{"date":"2009-10-01","text":"The enchanted land loses its existing land types and any abilities printed on it. It now has the land type Swamp and has the ability \"{T}: Add {B} to your mana pool.\" Evil Presence doesn't change the enchanted land's name or whether it's legendary, basic, or snow."}],"imageName":"evil presence"},{"type":"Instant","types":["Instant"],"multiverseid":792,"name":"False Orders","cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{R}","text":"Cast False Orders only during the declare blockers step. \n\nRemove target creature defending player controls from combat. Creatures it was blocking that had become blocked by only that creature this combat become unblocked. You may have it block an attacking creature of your choice.","rulings":[{"date":"2004-10-04","text":"If a creature is removed from being a blocker of a given attacker, any triggered abilities that would have happened because it was declared as a blocker still happen."}],"imageName":"false orders"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":848,"name":"Farmstead","subtypes":["Aura"],"cmc":3,"rarity":"Rare","artist":"Mark Poole","manaCost":"{W}{W}{W}","text":"Enchant land\n\nEnchanted land has \"At the beginning of your upkeep, you may pay {W}{W}. If you do, you gain 1 life.\"","imageName":"farmstead"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":745,"name":"Fastbond","cmc":1,"rarity":"Rare","artist":"Mark Poole","manaCost":"{G}","text":"You may play any number of additional lands on each of your turns.\n\nWhenever you play a land, if it wasn't the first land you played this turn, Fastbond deals 1 damage to you.","rulings":[{"date":"2004-10-04","text":"You take damage when you play a land using the \"play a land\" action. Such an action can be your regular \"play a land\", one enabled by Fastbond, or ones enabled through other effects."},{"date":"2004-10-04","text":"You do not take damage when you \"put a land onto the battlefield\" through the effect of a spell or ability."}],"imageName":"fastbond"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":661,"name":"Fear","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Mark Poole","manaCost":"{B}{B}","text":"Enchant creature (Target a creature as you cast this. This card enters the battlefield attached to that creature.)\n\nEnchanted creature has fear. (It can't be blocked except by artifact creatures and/or black creatures.)","imageName":"fear"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":702,"name":"Feedback","subtypes":["Aura"],"cmc":3,"rarity":"Uncommon","artist":"Quinton Hoover","manaCost":"{2}{U}","text":"Enchant enchantment\n\nAt the beginning of the upkeep of enchanted enchantment's controller, Feedback deals 1 damage to that player.","imageName":"feedback"},{"type":"Creature - Elemental","types":["Creature"],"multiverseid":793,"name":"Fire Elemental","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Melissa Benson","power":5,"toughness":4,"manaCost":"{3}{R}{R}","flavor":"Fire Elementals are ruthless infernos, annihilating and consuming their foes in a frenzied holocaust. Crackling and blazing, they sear swift, terrible paths, leaving the land charred and scorched in their wake.","imageName":"fire elemental"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":794,"name":"Fireball","cmc":1,"rarity":"Common","artist":"Mark Tedin","manaCost":"{X}{R}","text":"Fireball deals X damage divided evenly, rounded down, among any number of target creatures and/or players.\n\nFireball costs {1} more to cast for each target beyond the first.","rulings":[{"date":"2004-12-01","text":"The additional cost is paid when you pay the rest of Fireball's costs, even though that text appears second on the card (to make the card easier to read). The additional cost doesn't count toward Fireball's converted mana cost."},{"date":"2004-12-01","text":"If, for example, X is 5 and you choose three target creatures, Fireball has a total cost of {7}{R} (even though its mana cost is just {5}{R}). If those creatures are all still legal targets as Fireball resolves, it deals 1 damage to each of them."},{"date":"2009-05-01","text":"You may cast Fireball with zero targets, regardless of the value chosen for X. If you do so, it will not be a targeted spell, and no damage will actually be dealt when it resolves."},{"date":"2009-10-01","text":"Fireball's damage is divided as Fireball resolves, not as it's cast, because there are no choices involved. The division involves only targets that are still legal at that time."},{"date":"2009-10-01","text":"You can target more than X creatures. However, if the number of legal targets at the time Fireball resolves is greater than X, none of them will be dealt any damage."}],"imageName":"fireball"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":795,"name":"Firebreathing","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Dan Frazier","manaCost":"{R}","text":"Enchant creature\n\n{R}: Enchanted creature gets +1/+0 until end of turn.","flavor":"\"And topples round the dreary west\n\nA looming bastion fringed with fire.\"\n\n—Alfred, Lord Tennyson, \"In Memoriam\"","rulings":[{"date":"2009-10-01","text":"This ability can be activated by Firebreathing's controller, not the enchanted creature's controller (in case they're different players)."},{"date":"2009-10-01","text":"The ability affects whichever creature is enchanted by Firebreathing at the time the ability resolves. The bonus remains even if Firebreathing stops enchanting that creature."}],"imageName":"firebreathing"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":796,"name":"Flashfires","cmc":4,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{3}{R}","text":"Destroy all Plains.","imageName":"flashfires"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":703,"name":"Flight","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{U}","text":"Enchant creature\n\nEnchanted creature has flying.","imageName":"flight"},{"type":"Instant","types":["Instant"],"multiverseid":746,"name":"Fog","cmc":1,"rarity":"Common","artist":"Jesper Myrfors","manaCost":"{G}","text":"Prevent all combat damage that would be dealt this turn.","rulings":[{"date":"2009-10-01","text":"Fog has no effect on damage that's already been dealt."}],"imageName":"fog"},{"type":"Creature - Elemental","types":["Creature"],"multiverseid":747,"name":"Force of Nature","subtypes":["Elemental"],"cmc":6,"rarity":"Rare","artist":"Douglas Schuler","power":8,"toughness":8,"manaCost":"{2}{G}{G}{G}{G}","text":"Trample (If this creature would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.)\n\nAt the beginning of your upkeep, Force of Nature deals 8 damage to you unless you pay {G}{G}{G}{G}.","imageName":"force of nature"},{"type":"Artifact","types":["Artifact"],"multiverseid":611,"name":"Forcefield","cmc":3,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{3}","text":"{1}: The next time an unblocked creature of your choice would deal combat damage to you this turn, prevent all but 1 of that damage.","rulings":[{"date":"2004-10-04","text":"This can't be used to prevent damage caused by a blocked creature with Trample ability."}],"imageName":"forcefield"},{"supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"multiverseid":890,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Christopher Rush","text":"G","variations":[889,888],"imageName":"forest1"},{"supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"multiverseid":889,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Christopher Rush","text":"G","variations":[888,890],"imageName":"forest2"},{"supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"multiverseid":888,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Christopher Rush","text":"G","variations":[889,890],"imageName":"forest3"},{"type":"Instant","types":["Instant"],"multiverseid":797,"name":"Fork","cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{R}{R}","text":"Copy target instant or sorcery spell, except that the copy is red. You may choose new targets for the copy.","rulings":[{"date":"2004-10-04","text":"When a spell with additional costs is copied, you don't have to pay those costs again."},{"date":"2004-10-04","text":"For spells that can have a variable number of targets, the controller of the copy must use the same number of targets the original spell did."},{"date":"2004-10-04","text":"Forking a spell with an X in the cost requires you to use the same X value."},{"date":"2004-10-04","text":"Fork will not copy changes made by modifying effects to the spell prior to the use of Fork, such as text-changing effects."},{"date":"2004-10-04","text":"If mana or other costs need to be spent at resolution of the spell, the player of Fork would still be responsible for paying that cost."},{"date":"2004-10-04","text":"You need not (and may not) pay any additional mana or other costs (like sacrifices) to use the spell which is Forked. You get control over a complete copy but can change nothing except the targets."},{"date":"2004-10-04","text":"Fork does not let you make non-targeting choices about the spell."},{"date":"2004-10-04","text":"If the spell being copied targets a spell on the stack, it is possible to target Fork itself since Fork is still on the stack when you pick the target(s) for the copy. Note that the copy's target will be illegal when it resolves."},{"date":"2004-10-04","text":"If you copy a spell for which Buyback has been paid, you get nothing back since the copied spell does not have a card to give you."},{"date":"2004-10-04","text":"The copy that is placed on the stack is not considered to have been \"cast\"."},{"date":"2004-10-04","text":"The Fork card goes to the graveyard when it resolves and leaves the copy on the stack. There is no card representing the copy on the stack."},{"date":"2004-10-04","text":"It does copy the mana symbols in the mana cost for the card it is copying, but it uses its own color definition and not the one from those mana symbols. This is so it maintains its color just like the text says."},{"date":"2004-12-01","text":"If you Fork a Spliced spell, the spliced text is added during the announcement of the original spell, and therefore is fully copied by Fork."},{"date":"2009-05-01","text":"The copy will have the same mana cost as the original spell, but will be red rather than whatever color that mana cost would have made it."},{"date":"2009-10-01","text":"If the targeted spell was kicked, then the copy will be kicked as well. If the targeted spell was not kicked, then the copy will not be kicked."}],"imageName":"fork"},{"type":"Creature - Shade","types":["Creature"],"multiverseid":662,"name":"Frozen Shade","subtypes":["Shade"],"cmc":3,"rarity":"Common","artist":"Douglas Schuler","power":0,"toughness":1,"manaCost":"{2}{B}","text":"{B}: Frozen Shade gets +1/+1 until end of turn.","flavor":"\"There are some qualities—some incorporate things,/ That have a double life, which thus is made/ A type of twin entity which springs/ From matter and light, evinced in solid and shade.\"\n\n—Edgar Allan Poe, \"Silence\"","imageName":"frozen shade"},{"type":"Creature - Fungus Lizard","types":["Creature"],"multiverseid":748,"name":"Fungusaur","subtypes":["Fungus","Lizard"],"cmc":4,"rarity":"Rare","artist":"Daniel Gelon","power":2,"toughness":2,"manaCost":"{3}{G}","text":"Whenever Fungusaur is dealt damage, put a +1/+1 counter on it.","flavor":"Rather than sheltering her young, the female Fungusaur often injures her own offspring, thereby ensuring their rapid growth.","rulings":[{"date":"2004-10-04","text":"If more than one creature damages it at one time, it only gets one counter."}],"imageName":"fungusaur"},{"type":"Creature - Avatar","types":["Creature"],"multiverseid":749,"name":"Gaea's Liege","subtypes":["Avatar"],"cmc":6,"rarity":"Rare","artist":"Dameon Willich","power":null,"toughness":null,"manaCost":"{3}{G}{G}{G}","text":"As long as Gaea's Liege isn't attacking, its power and toughness are each equal to the number of Forests you control. As long as Gaea's Liege is attacking, its power and toughness are each equal to the number of Forests defending player controls.\n\n{T}: Target land becomes a Forest until Gaea's Liege leaves the battlefield.","rulings":[{"date":"2004-10-04","text":"When being declared as an attacker, use the \"not attacking\" power and toughness. It only changes after declaration is complete."},{"date":"2006-09-25","text":"The activated ability doesn't affect whether the land is basic or not. It overwrites any other land types. Being a Forest gives the affected land the ability \"{T}: Add {G} to your mana pool.\""},{"date":"2006-10-15","text":"Will not add or remove Snow Supertype to or from a land."}],"imageName":"gaea's liege"},{"type":"Artifact","types":["Artifact"],"multiverseid":612,"name":"Gauntlet of Might","cmc":4,"rarity":"Rare","artist":"Christopher Rush","manaCost":"{4}","text":"Red creatures get +1/+1.\n\nWhenever a Mountain is tapped for mana, its controller adds {R} to his or her mana pool (in addition to the mana the land produces).","rulings":[{"date":"2004-10-04","text":"Dual lands which have Mountain as one of their types produce an extra red mana when tapped for either color."}],"imageName":"gauntlet of might"},{"type":"Instant","types":["Instant"],"multiverseid":750,"name":"Giant Growth","cmc":1,"rarity":"Common","artist":"Sandra Everingham","manaCost":"{G}","text":"Target creature gets +3/+3 until end of turn.","imageName":"giant growth"},{"type":"Creature - Spider","types":["Creature"],"multiverseid":751,"name":"Giant Spider","subtypes":["Spider"],"cmc":4,"rarity":"Common","artist":"Sandra Everingham","power":2,"toughness":4,"manaCost":"{3}{G}","text":"Reach (This creature can block creatures with flying.)","flavor":"While it possesses potent venom, the Giant Spider often chooses not to paralyze its victims. Perhaps the creature enjoys the gentle rocking motion caused by its captives' struggles to escape its web.","rulings":[{"date":"2008-04-01","text":"This card now uses the Reach keyword ability to enable the blocking of flying creatures. This works because a creature with flying can only be blocked by creatures with flying or reach."}],"imageName":"giant spider"},{"type":"Artifact","types":["Artifact"],"multiverseid":613,"name":"Glasses of Urza","cmc":1,"rarity":"Uncommon","artist":"Douglas Schuler","manaCost":"{1}","text":"{T}: Look at target player's hand.","imageName":"glasses of urza"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":663,"name":"Gloom","cmc":3,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{2}{B}","text":"White spells cost {3} more to cast.\n\nActivated abilities of white enchantments cost {3} more to activate.","rulings":[{"date":"2004-10-04","text":"The extra mana is not considered part of the activation cost. It is a separate cost."},{"date":"2004-10-04","text":"The additional mana is paid at the same time the spell/ability is cast/activated."},{"date":"2004-10-04","text":"The extra mana is part of the total cost, so cost reducers can be applied to this cost."}],"imageName":"gloom"},{"type":"Creature - Goblin Warrior","types":["Creature"],"multiverseid":798,"name":"Goblin Balloon Brigade","subtypes":["Goblin","Warrior"],"cmc":1,"rarity":"Uncommon","artist":"Andi Rusu","power":1,"toughness":1,"manaCost":"{R}","text":"{R}: Goblin Balloon Brigade gains flying until end of turn.","flavor":"\"From up here we can drop rocks and arrows and more rocks\" \"Uh, yeah boss, but how do we get down?\"","rulings":[{"date":"2008-08-01","text":"You can activate the ability repeatedly during a turn. This generally has no additional effect, unless some other effect (like that from Adarkar Windform has caused it to lose flying since the last time the ability resolved."},{"date":"2010-08-15","text":"For flying to work as an evasion ability, an attacking Goblin Balloon Brigade's ability must be activated before the declare blockers step begins. Once Goblin Balloon Brigade has become blocked, giving it flying won't change that."}],"imageName":"goblin balloon brigade"},{"type":"Creature - Goblin","types":["Creature"],"multiverseid":799,"name":"Goblin King","subtypes":["Goblin"],"cmc":3,"rarity":"Rare","artist":"Jesper Myrfors","power":2,"toughness":2,"manaCost":"{1}{R}{R}","text":"Other Goblin creatures get +1/+1 and have mountainwalk. (They're unblockable as long as defending player controls a Mountain.)","flavor":"To become king of the Goblins, one must assassinate the previous king. Thus, only the most foolish seek positions of leadership.","rulings":[{"date":"2005-08-01","text":"Goblin King now has the Goblin creature type and its ability has been reworded to affect *other* Goblins. This means that if two Goblin Kings are on the battlefield, each gives the other a bonus."}],"imageName":"goblin king"},{"type":"Creature - Gargoyle","types":["Creature"],"multiverseid":800,"name":"Granite Gargoyle","subtypes":["Gargoyle"],"cmc":3,"rarity":"Rare","artist":"Christopher Rush","power":2,"toughness":2,"manaCost":"{2}{R}","text":"Flying\n\n{R}: Granite Gargoyle gets +0/+1 until end of turn.","flavor":"\"While most overworlders fortunately don't realize this, Gargoyles can be most delicious, providing you have the appropriate tools to carve them.\"\n\n—The Underworld Cookbook by Asmoranomardicadaistinaculdacar","imageName":"granite gargoyle"},{"type":"Creature - Ogre","types":["Creature"],"multiverseid":801,"name":"Gray Ogre","subtypes":["Ogre"],"cmc":3,"rarity":"Common","artist":"Dan Frazier","power":2,"toughness":2,"manaCost":"{2}{R}","flavor":"The Ogre philosopher Gnerdel believed the purpose of life was to live as high on the food chain as possible. She refused to eat vegetarians, and preferred to live entirely on creatures that preyed on sentient beings.","imageName":"gray ogre"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":849,"name":"Green Ward","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from green. This effect doesn't remove Green Ward.","imageName":"green ward"},{"type":"Creature - Bear","types":["Creature"],"multiverseid":752,"name":"Grizzly Bears","subtypes":["Bear"],"cmc":2,"rarity":"Common","artist":"Jeff A. Menges","power":2,"toughness":2,"manaCost":"{1}{G}","flavor":"Don't try to outrun one of Dominia's Grizzlies; it'll catch you, knock you down, and eat you. Of course, you could run up a tree. In that case you'll get a nice view before it knocks the tree down and eats you.","imageName":"grizzly bears"},{"type":"Instant","types":["Instant"],"multiverseid":850,"name":"Guardian Angel","cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{X}{W}","text":"Prevent the next X damage that would be dealt to target creature or player this turn. Until end of turn, you may pay {1} any time you could cast an instant. If you do, prevent the next 1 damage that would be dealt to that creature or player this turn.","imageName":"guardian angel"},{"type":"Instant","types":["Instant"],"multiverseid":851,"name":"Healing Salve","cmc":1,"rarity":"Common","artist":"Dan Frazier","manaCost":"{W}","text":"Choose one — Target player gains 3 life; or prevent the next 3 damage that would be dealt to target creature or player this turn.","imageName":"healing salve"},{"type":"Artifact","types":["Artifact"],"multiverseid":614,"name":"Helm of Chatzuk","cmc":1,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{1}","text":"{1}, {T}: Target creature gains banding until end of turn. (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding a player controls are blocking or being blocked by a creature, that player divides that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)","rulings":[{"date":"2008-10-01","text":"If a creature with banding attacks, it can team up with any number of other attacking creatures with banding (and up to one nonbanding creature) and attack as a unit called a \"band.\" The band can be blocked by any creature that could block a single creature in the band. Blocking any creature in a band blocks the entire band. If a creature with banding is blocked, the attacking player chooses how the blockers' damage is assigned."},{"date":"2008-10-01","text":"A maximum of one nonbanding creature can join an attacking band no matter how many creatures with banding are in it."},{"date":"2008-10-01","text":"Creatures in the same band must all attack the same player or planeswalker."},{"date":"2009-10-01","text":"If a creature in combat has banding, its controller assigns damage for creatures blocking or blocked by it. That player can ignore the damage assignment order when making this assignment."}],"imageName":"helm of chatzuk"},{"type":"Creature - Giant","types":["Creature"],"multiverseid":802,"name":"Hill Giant","subtypes":["Giant"],"cmc":4,"rarity":"Common","artist":"Dan Frazier","power":3,"toughness":3,"manaCost":"{3}{R}","flavor":"Fortunately, Hill Giants have large blind spots in which a human can easily hide. Unfortunately, these blind spots are beneath the bottoms of their feet.","imageName":"hill giant"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":852,"name":"Holy Armor","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Melissa Benson","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature gets +0/+2.\n\n{W}: Enchanted creature gets +0/+1 until end of turn.","imageName":"holy armor"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":853,"name":"Holy Strength","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature gets +1/+2.","imageName":"holy strength"},{"type":"Instant","types":["Instant"],"multiverseid":664,"name":"Howl from Beyond","cmc":1,"rarity":"Common","artist":"Mark Poole","manaCost":"{X}{B}","text":"Target creature gets +X/+0 until end of turn.","imageName":"howl from beyond"},{"type":"Artifact","types":["Artifact"],"multiverseid":615,"name":"Howling Mine","cmc":2,"rarity":"Rare","artist":"Mark Poole","manaCost":"{2}","text":"At the beginning of each player's draw step, if Howling Mine is untapped, that player draws an additional card.","rulings":[{"date":"2004-10-04","text":"If Howling Mine leaves the battlefield before it resolves, then the last known tap or untap state of the card is used for resolution."},{"date":"2004-10-04","text":"It does not trigger at all if this is tapped at the start of the draw step, and it checks this again on resolution."},{"date":"2004-10-04","text":"The additional draw is separate from any other draw during your draw step. It happens when the triggered ability resolves."},{"date":"2013-04-15","text":"The triggered ability is put onto the stack after you have already drawn your card for the turn."}],"imageName":"howling mine"},{"type":"Creature - Minotaur","types":["Creature"],"multiverseid":803,"name":"Hurloon Minotaur","subtypes":["Minotaur"],"cmc":3,"rarity":"Common","artist":"Anson Maddocks","power":2,"toughness":3,"manaCost":"{1}{R}{R}","flavor":"The Minotaurs of the Hurloon Mountains are known for their love of battle. They are also known for their hymns to the dead, sung for friend and foe alike. These hymns can last for days, filling the mountain valleys with their low, haunting sounds.","imageName":"hurloon minotaur"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":753,"name":"Hurricane","cmc":1,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{X}{G}","text":"Hurricane deals X damage to each creature with flying and each player.","rulings":[{"date":"2004-10-04","text":"Whether or not a creature has flying is only checked on resolution."}],"imageName":"hurricane"},{"type":"Creature - Specter","types":["Creature"],"multiverseid":665,"name":"Hypnotic Specter","subtypes":["Specter"],"cmc":3,"rarity":"Uncommon","artist":"Douglas Schuler","power":2,"toughness":2,"manaCost":"{1}{B}{B}","text":"Flying\n\nWhenever Hypnotic Specter deals damage to an opponent, that player discards a card at random.","flavor":"\"...There was no trace/ Of aught on that illumined face...\"\n\n—Samuel Coleridge, \"Phantom\"","rulings":[{"date":"2008-08-01","text":"The ability triggers even if the Specter's damage is being redirected to an opponent. It does not trigger if damage that would have been dealt to the opponent is redirected to a nonopponent player or a creature, or if the damage is prevented."}],"imageName":"hypnotic specter"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":754,"name":"Ice Storm","cmc":3,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{2}{G}","text":"Destroy target land.","imageName":"ice storm"},{"type":"Artifact","types":["Artifact"],"multiverseid":616,"name":"Icy Manipulator","cmc":4,"rarity":"Uncommon","artist":"Douglas Shuler","manaCost":"{4}","text":"{1}, {T}: Tap target artifact, creature, or land.","rulings":[{"date":"2004-10-04","text":"Tapping a card with an effect like this will never pay the cost of an ability. For example, tapping a land with this card will not put mana into a player's pool."},{"date":"2004-10-04","text":"Icy Manipulator can't be used to stop someone from using an ability of the permanent you plan to tap. It can be used to make a player use the ability now or to not use it."},{"date":"2004-10-04","text":"The ability can target a tapped card, but tapping a tapped card does nothing useful. And it will not trigger \"if the card becomes tapped\" effects."},{"date":"2004-10-04","text":"If you want to stop someone from attacking with a creature by using this card, you must do so before attackers are declared. You can't wait until after attackers are declared and then try to use it to make a creature stop attacking. Note that your opponent can't start declaring attackers without letting you use the Icy Manipulator."},{"date":"2004-10-04","text":"Tapping an attacking creature which did not tap to attack does not remove the creature from the attack or cause the creature to stop dealing damage."}],"imageName":"icy manipulator"},{"type":"Artifact","types":["Artifact"],"multiverseid":617,"name":"Illusionary Mask","cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{2}","text":"{X}: You may choose a creature card in your hand whose mana cost could be paid by some amount of, or all of, the mana you spent on {X}. If you do, you may cast that card face down as a 2/2 creature spell without paying its mana cost. If the creature that spell becomes as it resolves has not been turned face up and would assign or deal damage, be dealt damage, or become tapped, instead it's turned face up and assigns or deals damage, is dealt damage, or becomes tapped. Activate this ability only any time you could cast a sorcery.","rulings":[{"date":"2004-10-04","text":"The creature enters the battlefield face down, so none of its \"enters the battlefield\" abilities will trigger or have any effect. Also none of its \"As this enters the battlefield\" abilities apply."},{"date":"2004-10-04","text":"The creature's \"enters the battlefield\" abilities (and any other abilities relating to the creature entering the battlefield) do not trigger when it turns face up."},{"date":"2004-10-04","text":"Only the controller of the face down creature can look at it."},{"date":"2008-04-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."},{"date":"2009-10-01","text":"If you use the ability to cast a creature card face down, you must keep track of the amount and types of mana you spent on {X}. If that creature spell is moved from the stack to anywhere other than the battlefield, the resulting creature leaves the battlefield, or the game ends, the face-down card is revealed. If its mana cost couldn't be paid by some amount of, or all of, the mana you spent on {X}, all applicable penalties for casting a card illegally are assessed."},{"date":"2009-10-01","text":"You actually cast the card face-down, much as when playing a spell with Morph. It can be responded to and countered."},{"date":"2009-10-01","text":"The effect that turns it face-up is a replacement effect. It doesn't use the stack and can't be responded to."},{"date":"2009-10-01","text":"You may not turn a face-down spell face up. You may not turn a face-down permanent face up unless it would have morph while face up or an effect specifically allows you to turn it face up. Illusionary Mask's ability has you turn a face-down creature face up if it would assign damage, deal damage, be dealt damage, or become tapped, but not for any other reason. For example, if you use Illusionary Mask's ability to cast a black creature face down, you can't turn it face up just because it's being targeted by Terror."},{"date":"2009-10-01","text":"Both the amount and types of mana you spend on {X} are taken into account while you're choosing a creature card from your hand. For example, if you spent {U}{U} on {X}, you can choose a creature card with mana cost {U}{U}, {1}{U}, {2}, or {W/U}{W/U}, among other possibilities, but not one that costs {2}{U} or one that costs {G}."},{"date":"2009-10-01","text":"While the creature card is face down, it's a 2/2 creature with no name, mana cost, color, creature type, abilities, or expansion symbol. Since it has no mana cost, its converted mana cost is 0."},{"date":"2009-10-01","text":"You may look at a face-down spell or permanent you control at any time."},{"date":"2009-10-01","text":"You can turn a face-down permanent face up if it would have morph while face up. This applies to creatures you cast face down as a result of Illusionary Mask's effect. The rest of Illusionary Mask's effect applies to it as well."},{"date":"2009-10-01","text":"Illusionary Mask's ability will continue to apply to creatures cast face down with it, even if Illusionary Mask has left the battlefield."}],"imageName":"illusionary mask"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":755,"name":"Instill Energy","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{G}","text":"Enchant creature\n\nEnchanted creature can attack as though it had haste.\n\n{0}: Untap enchanted creature. Activate this ability only during your turn and only once each turn.","rulings":[{"date":"2004-10-04","text":"If attached to an opponent's creature, you can untap their creature during your turn."},{"date":"2004-10-04","text":"Instill Energy's untap ability will not untap the creature until it resolves. This means other spells and abilities can be used before it actually becomes untapped."},{"date":"2005-08-01","text":"Any Auras (or other effects) which are on the creature that would cause it to not be untapped (or have a cost to be untapped) during untap step do not in any way hinder or imply a cost to use this card's ability to untap once during the turn."}],"imageName":"instill energy"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":704,"name":"Invisibility","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{U}{U}","text":"Enchant creature\n\nEnchanted creature can't be blocked except by Walls.","imageName":"invisibility"},{"type":"Artifact","types":["Artifact"],"multiverseid":618,"name":"Iron Star","cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{1}","text":"Whenever a player casts a red spell, you may pay {1}. If you do, you gain 1 life.","imageName":"iron star"},{"type":"Creature - Orc","types":["Creature"],"multiverseid":804,"name":"Ironclaw Orcs","subtypes":["Orc"],"cmc":2,"rarity":"Common","artist":"Anson Maddocks","power":2,"toughness":2,"manaCost":"{1}{R}","text":"Ironclaw Orcs can't block creatures with power 2 or greater.","flavor":"Generations of genetic weeding have given rise to the deviously cowardly Ironclaw clan. To say that Orcs in general are vicious, depraved, and ignoble does not do justice to the Ironclaw.","imageName":"ironclaw orcs"},{"type":"Creature - Treefolk","types":["Creature"],"multiverseid":756,"name":"Ironroot Treefolk","subtypes":["Treefolk"],"cmc":5,"rarity":"Common","artist":"Jesper Myrfors","power":3,"toughness":5,"manaCost":"{4}{G}","flavor":"The mating habits of Treefolk, particularly the stalwart Ironroot Treefolk, are truly absurd. Molasses comes to mind. It's amazing the species can survive at all given such protracted periods of mate selection, conjugation, and gestation.","imageName":"ironroot treefolk"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":854,"name":"Island Sanctuary","cmc":2,"rarity":"Rare","artist":"Mark Poole","manaCost":"{1}{W}","text":"If you would draw a card during your draw step, instead you may skip that draw. If you do, until your next turn, you can't be attacked except by creatures with flying and/or islandwalk.","rulings":[{"date":"2004-10-04","text":"If you get multiple draws or you use a spell or ability during the draw step to draw extra cards, you can have the replacement effect apply to any one or all of those. You need only have it apply once to get the effect. If you skip more than one, there is no additional effect."},{"date":"2004-10-04","text":"If the replacement effect is applied, the effect will continue until your next turn even if this card leaves the battlefield."},{"date":"2004-10-04","text":"Since the draw is replaced, you can't use the same draw to do other things."}],"imageName":"island sanctuary"},{"supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"multiverseid":896,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Mark Poole","text":"U","variations":[894,895],"imageName":"island1"},{"supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"multiverseid":894,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Mark Poole","text":"U","variations":[896,895],"imageName":"island2"},{"supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"multiverseid":895,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Mark Poole","text":"U","variations":[896,894],"imageName":"island3"},{"type":"Artifact","types":["Artifact"],"multiverseid":619,"name":"Ivory Cup","cmc":1,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{1}","text":"Whenever a player casts a white spell, you may pay {1}. If you do, you gain 1 life.","imageName":"ivory cup"},{"type":"Artifact","types":["Artifact"],"multiverseid":620,"name":"Jade Monolith","cmc":4,"rarity":"Rare","artist":"Anson Maddocks","manaCost":"{4}","text":"{1}: The next time a source of your choice would deal damage to target creature this turn, that source deals that damage to you instead.","imageName":"jade monolith"},{"type":"Artifact","types":["Artifact"],"multiverseid":621,"name":"Jade Statue","cmc":4,"rarity":"Uncommon","artist":"Dan Frazier","power":3,"toughness":6,"manaCost":"{4}","text":"{2}: Jade Statue becomes a 3/6 Golem artifact creature until end of combat. Activate this ability only during combat.","flavor":"\"Some of the other guys dared me to touch it, but I knew it weren't no ordinary hunk o' rock.\"Norin the Wary","rulings":[{"date":"2004-10-04","text":"If an external effect that animates an artifact is used on the Statue, you get a 4/4 artifact creature which can becomes a 3/6 artifact creature during the combat phase."},{"date":"2004-10-04","text":"It can only make itself into a creature during combat phases and therefore it is difficult to get Auras placed on it."},{"date":"2005-08-01","text":"A delayed triggered ability that refers to Jade Statue still affects it even if it's no longer a creature. For example, if Jade Statue blocks the Kashi-Tribe Warriors (\"Whenever Kashi-Tribe Warriors deals combat damage to a creature, tap that creature and it doesn't untap during its controller's next untap step.\"), the Warriors' effect stops Jade Statue from untapping."},{"date":"2005-08-01","text":"If Jade Statue's ability has been activated, abilities that trigger \"at end of combat\" will see Jade Statue as an artifact creature."},{"date":"2008-08-01","text":"A noncreature permanent that turns into a creature can attack, and its {T} abilities can be activated, only if its controller has continuously controlled that permanent since the beginning of his or her most recent turn. It doesn't matter how long the permanent has been a creature."}],"imageName":"jade statue"},{"type":"Artifact","types":["Artifact"],"multiverseid":622,"name":"Jayemdae Tome","cmc":4,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{4}","text":"{4}, {T}: Draw a card.","imageName":"jayemdae tome"},{"type":"Artifact Creature - Juggernaut","types":["Artifact","Creature"],"multiverseid":623,"name":"Juggernaut","subtypes":["Juggernaut"],"cmc":4,"rarity":"Uncommon","artist":"Dan Frazier","power":5,"toughness":3,"manaCost":"{4}","text":"Juggernaut attacks each turn if able.\n\nJuggernaut can't be blocked by Walls.","flavor":"We had taken refuge in a small cave, thinking the entrance was too narrow for it to follow. To our horror, its gigantic head smashed into the mountainside, ripping itself a new entrance.","rulings":[{"date":"2004-10-04","text":"An effect that states \"Enchanted creature can only be blocked by Walls\" will make the Juggernaut unblockable. The \"can only be blocked by walls\" effect doesn't override the text on the Juggernaut's ability."},{"date":"2004-10-04","text":"There is no penalty if for some reason the Juggernaut can't attack, but if it can attack you must do so."},{"date":"2010-08-15","text":"If, during your declare attackers step, Juggernaut is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" then it doesn't attack. If there's a cost associated with having Juggernaut attack, you aren't forced to pay that cost, so it doesn't have to attack in that case either."},{"date":"2010-08-15","text":"If there are multiple combat phases in a turn, Juggernaut must attack only in the first one in which it's able to."}],"imageName":"juggernaut"},{"type":"Instant","types":["Instant"],"multiverseid":705,"name":"Jump","cmc":1,"rarity":"Common","artist":"Mark Poole","manaCost":"{U}","text":"Target creature gains flying until end of turn.","rulings":[{"date":"2009-10-01","text":"To work as an evasion ability, an attacking creature must already have flying when the declare blockers step begins. Once a creature has become blocked, giving it flying won't change that."}],"imageName":"jump"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":855,"name":"Karma","cmc":4,"rarity":"Uncommon","artist":"Richard Thomas","manaCost":"{2}{W}{W}","text":"At the beginning of each player's upkeep, Karma deals damage to that player equal to the number of Swamps he or she controls.","rulings":[{"date":"2004-10-04","text":"Amount of damage is determined when the ability resolves and not when it is placed on the stack."}],"imageName":"karma"},{"type":"Creature - Human Barbarian","types":["Creature"],"multiverseid":805,"name":"Keldon Warlord","subtypes":["Human","Barbarian"],"cmc":4,"rarity":"Uncommon","artist":"Kev Brockschmidt","power":null,"toughness":null,"manaCost":"{2}{R}{R}","text":"Keldon Warlord's power and toughness are each equal to the number of non-Wall creatures you control.","rulings":[{"date":"2008-08-01","text":"This is a Characteristic-Defining Ability. It checks the number of non-Wall creatures you control continuously, and applies in all zones. It is never \"locked in\"."}],"imageName":"keldon warlord"},{"type":"Artifact","types":["Artifact"],"multiverseid":624,"name":"Kormus Bell","cmc":4,"rarity":"Rare","artist":"Christopher Rush","manaCost":"{4}","text":"All Swamps are 1/1 black creatures that are still lands.","rulings":[{"date":"2004-10-04","text":"The lands are both lands and creatures at the same time. They are affected by anything that affects either permanent type."},{"date":"2004-10-04","text":"It affects Swamps controlled by any and all players."},{"date":"2008-08-01","text":"A noncreature permanent that turns into a creature can attack, and its {T} abilities can be activated, only if its controller has continuously controlled that permanent since the beginning of his or her most recent turn. It doesn't matter how long the permanent has been a creature."}],"imageName":"kormus bell"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":757,"name":"Kudzu","subtypes":["Aura"],"cmc":3,"rarity":"Rare","artist":"Mark Poole","manaCost":"{1}{G}{G}","text":"Enchant land\n\nWhen enchanted land becomes tapped, destroy it. That land's controller attaches Kudzu to a land of his or her choice.","rulings":[{"date":"2004-10-04","text":"You can move it to any other player's land whenever you get to move it."},{"date":"2005-08-01","text":"If Kudzu is destroyed directly, or the land is destroyed by a spell or ability, then Kudzu goes to the graveyard like any Aura would."},{"date":"2008-04-01","text":"The controller of the destroyed land must attach it to another land if possible. If there are no valid choices, Kudzu is simply put into the graveyard."},{"date":"2008-04-01","text":"Because the ability isn't targeted, the controller of the destroyed land may attach it to a land that can't be the target of abilities."}],"imageName":"kudzu"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":856,"name":"Lance","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Rob Alexander","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has first strike.","imageName":"lance"},{"type":"Creature - Human Druid","types":["Creature"],"multiverseid":758,"name":"Ley Druid","subtypes":["Human","Druid"],"cmc":3,"rarity":"Uncommon","artist":"Sandra Everingham","power":1,"toughness":1,"manaCost":"{2}{G}","text":"{T}: Untap target land.","flavor":"After years of training, the Druid becomes one with nature, drawing power from the land and returning it when needed.","rulings":[{"date":"2004-10-04","text":"The land is untapped as a normal ability that goes on the stack. It is not a mana ability, so it can't be used at times that only mana abilities can be used."}],"imageName":"ley druid"},{"type":"Artifact","types":["Artifact"],"multiverseid":625,"name":"Library of Leng","cmc":1,"rarity":"Uncommon","artist":"Daniel Gelon","manaCost":"{1}","text":"You have no maximum hand size.\n\nIf an effect causes you to discard a card, discard it, but you may put it on top of your library instead of into your graveyard.","rulings":[{"date":"2004-10-04","text":"This effect has no effect on the cards being put into the graveyard from a library, because they are not \"discarded\"."},{"date":"2004-10-04","text":"You can't use the Library of Leng ability to place a discarded card on top of your library when you discard a card as a cost, because costs aren't effects."},{"date":"2004-10-04","text":"The discard triggers anything else that triggers on discards."},{"date":"2004-10-04","text":"You can look at a randomly discarded card before deciding where it goes."},{"date":"2004-10-04","text":"The ability applies any time a spell or ability has you discard as part of its effect. It does not matter if you or your opponent control the spell or ability. The discard is forced because it is an effect."},{"date":"2004-10-04","text":"If more than one card is discarded due to a single effect, the Library allows you to decide whether or not to use it on each of the cards. You get to decide the order the cards are placed on the library if more than one goes there."},{"date":"2004-10-04","text":"Since the card goes directly to the library, the card is not revealed unless the spell or ability requiring the discard specifically says it is."},{"date":"2004-10-04","text":"The ability replaces the normal discard action with a discard action that puts the card on the library instead of the graveyard."},{"date":"2009-10-01","text":"If multiple effects modify your hand size, apply them in timestamp order. For example, if you put Null Profusion (an enchantment that says your maximum hand size is two) onto the battlefield and then put Library of Leng onto the battlefield, you'll have no maximum hand size. However, if those permanents entered the battlefield in the opposite order, your maximum hand size would be two."}],"imageName":"library of leng"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":666,"name":"Lich","cmc":4,"rarity":"Rare","artist":"Daniel Gelon","manaCost":"{B}{B}{B}{B}","text":"As Lich enters the battlefield, you lose life equal to your life total.\n\nYou don't lose the game for having 0 or less life.\n\nIf you would gain life, draw that many cards instead.\n\nWhenever you're dealt damage, sacrifice that many nontoken permanents. If you can't, you lose the game.\n\nWhen Lich is put into a graveyard from the battlefield, you lose the game.","rulings":[{"date":"2004-10-04","text":"If you have multiple Lich cards on the battlefield, you must sacrifice a permanent for each damage done to you for each Lich. This is because the sacrifice is a triggered ability. But you only draw one card for each life gained regardless of how many Liches you have. This is because the draw is a replacement effect and not a triggered one. You lose if any one of the Liches leaves the battlefield."},{"date":"2004-10-04","text":"If you take more than one damage at a time, sacrifice the permanents for that damage simultaneously. This allows you to sacrifice both a creature and any Aura that is on it all at once."},{"date":"2004-10-04","text":"You can't pay life, just like any player at less than one life can't pay life. You can pay zero life if you want."},{"date":"2004-10-04","text":"If an opponent steals control of Lich and no other effect prevents you from losing with a life total of zero, you will lose the game due to a zero life total as a State-Based Action before you can take any actions. The last sentence doesn't apply in this case since the Lich didn't leave the battlefield."},{"date":"2004-10-04","text":"If an opponent steals control of Lich, their life total does not change. The life total changes for a player only when it enters the battlefield under that player's control."},{"date":"2004-10-04","text":"You can lose life and take damage, and thereby have a negative life total, while Lich is on the battlefield."},{"date":"2010-08-15","text":"The last ability will cause you to lose the game even if you somehow manage to have a life-total greater than 0 at the time the Lich leaves the battlefield or if some other effect would prevent you from losing for having 0 life. If, on the other hand, some effect such as that from Platinum Angel says that you can't lose the game then even the last ability of the Lich cannot cause you to do so. The ability will just resolve and the game will continue as normal."},{"date":"2010-08-15","text":"Note that usually you will have 0 or less life at the time Lich leaves the battlefield causing you to lose as a State-Based Action before the last ability can even go on the stack."},{"date":"2011-01-01","text":"The last ability will cause you to lose the game even if you somehow manage to have a life-total greater than 0 at the time the Lich is put into the graveyard or if some other effect would prevent you from losing for having 0 life. If, on the other hand, some effect such as that from Platinum Angel says that you can't lose the game then even the last ability of the Lich cannot cause you to do so. The ability will just resolve and the game will continue as normal."}],"imageName":"lich"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":759,"name":"Lifeforce","cmc":2,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{G}{G}","text":"{G}{G}: Counter target black spell.","imageName":"lifeforce"},{"type":"Instant","types":["Instant"],"multiverseid":760,"name":"Lifelace","cmc":1,"rarity":"Rare","artist":"Amy Weber","manaCost":"{G}","text":"Target spell or permanent becomes green. (Mana symbols on that permanent remain unchanged.)","imageName":"lifelace"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":706,"name":"Lifetap","cmc":2,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{U}{U}","text":"Whenever a Forest an opponent controls becomes tapped, you gain 1 life.","rulings":[{"date":"2004-10-04","text":"Gives one life for each and every Forest tapped."},{"date":"2004-10-04","text":"In multi-player games it affects all opponents."}],"imageName":"lifetap"},{"type":"Instant","types":["Instant"],"multiverseid":806,"name":"Lightning Bolt","cmc":1,"rarity":"Common","artist":"Christopher Rush","manaCost":"{R}","text":"Lightning Bolt deals 3 damage to target creature or player.","imageName":"lightning bolt"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":761,"name":"Living Artifact","subtypes":["Aura"],"cmc":1,"rarity":"Rare","artist":"Anson Maddocks","manaCost":"{G}","text":"Enchant artifact\n\nWhenever you're dealt damage, put that many vitality counters on Living Artifact.\n\nAt the beginning of your upkeep, you may remove a vitality counter from Living Artifact. If you do, you gain 1 life.","rulings":[{"date":"2004-10-04","text":"You can cast it targeting your opponent's artifacts. The controller of the Aura (not the controller of the artifact) controls the Living Artifact ability."},{"date":"2004-10-04","text":"Does not trigger on loss of life, just on damage."}],"imageName":"living artifact"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":762,"name":"Living Lands","cmc":4,"rarity":"Rare","artist":"Jesper Myrfors","manaCost":"{3}{G}","text":"All Forests are 1/1 creatures that are still lands.","rulings":[{"date":"2008-08-01","text":"A noncreature permanent that turns into a creature can attack, and its {T} abilities can be activated, only if its controller has continuously controlled that permanent since the beginning of his or her most recent turn. It doesn't matter how long the permanent has been a creature."}],"imageName":"living lands"},{"type":"Artifact Creature - Wall","types":["Artifact","Creature"],"multiverseid":626,"name":"Living Wall","subtypes":["Wall"],"cmc":4,"rarity":"Uncommon","artist":"Anson Maddocks","power":0,"toughness":6,"manaCost":"{4}","text":"Defender (This creature can't attack.)\n\n{1}: Regenerate Living Wall.","flavor":"Some fiendish mage had created a horrifying wall of living flesh, patched together from a jumble of still-recognizable body parts. As we sought to hew our way through it, some unknown power healed the gaping wounds we cut, denying us passage.","imageName":"living wall"},{"type":"Creature - Elf Druid","types":["Creature"],"multiverseid":763,"name":"Llanowar Elves","subtypes":["Elf","Druid"],"cmc":1,"rarity":"Common","artist":"Anson Maddocks","power":1,"toughness":1,"manaCost":"{G}","text":"{T}: Add {G} to your mana pool.","flavor":"Whenever the Llanowar Elves gather the fruits of their forest, they leave one plant of each type untouched, considering that nature's portion.","imageName":"llanowar elves"},{"type":"Creature - Merfolk","types":["Creature"],"multiverseid":707,"name":"Lord of Atlantis","subtypes":["Merfolk"],"cmc":2,"rarity":"Rare","artist":"Melissa Benson","power":2,"toughness":2,"manaCost":"{U}{U}","text":"Other Merfolk creatures get +1/+1 and have islandwalk.","flavor":"A master of tactics, the Lord of Atlantis makes his people bold in battle merely by arriving to lead them.","imageName":"lord of atlantis"},{"type":"Creature - Demon","types":["Creature"],"multiverseid":667,"name":"Lord of the Pit","subtypes":["Demon"],"cmc":7,"rarity":"Rare","artist":"Mark Tedin","power":7,"toughness":7,"manaCost":"{4}{B}{B}{B}","text":"Flying, trample\n\nAt the beginning of your upkeep, sacrifice a creature other than Lord of the Pit. If you can't, Lord of the Pit deals 7 damage to you.","rulings":[{"date":"2004-10-04","text":"You can select creatures with Protection from Black to be sacrificed."},{"date":"2004-10-04","text":"If you have a creature, you must sacrifice it. The 7 damage can only be taken if no creature can be sacrificed."},{"date":"2004-10-04","text":"If you have two Lords of the Pit, you can sacrifice them to each other."}],"imageName":"lord of the pit"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":764,"name":"Lure","subtypes":["Aura"],"cmc":3,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{1}{G}{G}","text":"Enchant creature\n\nAll creatures able to block enchanted creature do so.","rulings":[{"date":"2004-10-04","text":"Lure does not give a creature the ability to block the Lured creature, it just forces those creatures which are already able to block the Lured creature to do so."},{"date":"2004-10-04","text":"If a Lured creature is in a band, only blockers able to block the Lured creature are affected by the Lure."},{"date":"2004-10-04","text":"The opponent does not have to activate any abilities in an attempt to make his or her creatures block. More specifically, a cost to block of zero mana is an optional cost you can choose not to pay."}],"imageName":"lure"},{"type":"Instant","types":["Instant"],"multiverseid":708,"name":"Magical Hack","cmc":1,"rarity":"Rare","artist":"Julie Baroh","manaCost":"{U}","text":"Change the text of target spell or permanent by replacing all instances of one basic land type with another. (For example, you may change \"swampwalk\" to \"plainswalk.\" This effect lasts indefinitely.)","rulings":[{"date":"2004-10-04","text":"Alters all occurrences of the chosen word in the text box and the type line of the given card."},{"date":"2004-10-04","text":"Can target a card with no appropriate words on it, or even one with no words at all."},{"date":"2004-10-04","text":"It can't change a word to the same word. It must be a different word."},{"date":"2004-10-04","text":"It only changes what is printed on the card (or set on a token when it was created or set by a copy effect). It will not change any effects that are on the permanent."},{"date":"2004-10-04","text":"You choose the words to change on resolution."},{"date":"2004-10-04","text":"You can't change proper nouns (i.e. card names) such as \"Island Fish Jasconius\"."},{"date":"2004-10-04","text":"Changing the text of a spell will not allow you to change the targets of the spell because the targets were chosen when the spell was cast. The text change will (probably) cause it to be countered since the targets will be illegal."},{"date":"2004-10-04","text":"If you change the text of a spell which is to become a permanent, the permanent will retain the text change until the effect wears off."},{"date":"2004-10-04","text":"It can be used to change a land's type from one basic land type to another. For example, Forest can be changed to Island so it produces blue mana. It doesn't change the name of any permanent."}],"imageName":"magical hack"},{"type":"Creature - Djinn","types":["Creature"],"multiverseid":709,"name":"Mahamoti Djinn","subtypes":["Djinn"],"cmc":6,"rarity":"Rare","artist":"Dan Frazier","power":5,"toughness":6,"manaCost":"{4}{U}{U}","text":"Flying (This creature can't be blocked except by creatures with flying or reach.)","flavor":"Of royal blood amongst the spirits of the air, the Mahamoti Djinn rides on the wings of the winds. As dangerous in the gambling hall as he is in battle, he is a master of trickery and misdirection.","imageName":"mahamoti djinn"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":807,"name":"Mana Flare","cmc":3,"rarity":"Rare","artist":"Christopher Rush","manaCost":"{2}{R}","text":"Whenever a player taps a land for mana, that player adds one mana to his or her mana pool of any type that land produced.","rulings":[{"date":"2004-10-04","text":"If the land produces more than one color of mana at a single time, its controller chooses which of those types is produced by Mana Flare's ability."},{"date":"2004-10-04","text":"The types of mana are white, blue, black, red, green, and colorless."},{"date":"2004-10-04","text":"When used with lands that can produce multiple colors, Mana Flare produces one additional mana of the same color that was produced. It can't give a mana of a color that wasn't produced."},{"date":"2004-10-04","text":"Only produces extra mana when land is tapped for mana, not when tapped by some other effect."},{"date":"2004-10-04","text":"Mana Flare adds one of whatever color the land produces after applying any land type or color changing effects."},{"date":"2004-10-04","text":"This is a triggered mana ability."},{"date":"2007-09-16","text":"Does not copy any restrictions on the mana, such as with Mishra’s Workshop or Pillar of the Paruns."},{"date":"2007-09-16","text":"Produces only one additional mana, regardless of how much was produced by tapping the land."}],"imageName":"mana flare"},{"type":"Instant","types":["Instant"],"multiverseid":710,"name":"Mana Short","cmc":3,"rarity":"Rare","artist":"Dameon Willich","manaCost":"{2}{U}","text":"Tap all lands target player controls and empty his or her mana pool.","rulings":[{"date":"2004-10-04","text":"Since this is an Instant, your opponent may use Instants in response to the casting of this spell. Note that such spells and abilities will be resolved before the mana pool is emptied by the Mana Short. This makes it useless as a countermeasure for spells. To use it effectively, you need to use it during Upkeep and even then it will not prevent the use of Instant spells and abilities."},{"date":"2004-10-04","text":"If you play Mana Short in response to a spell, it will have no effect on that spell since the mana has already been paid."},{"date":"2004-10-04","text":"It even taps lands that do not produce mana."}],"imageName":"mana short"},{"type":"Artifact","types":["Artifact"],"multiverseid":627,"name":"Mana Vault","cmc":1,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{1}","text":"Mana Vault doesn't untap during your untap step.\n\nAt the beginning of your upkeep, you may pay {4}. If you do, untap Mana Vault.\n\nAt the beginning of your draw step, if Mana Vault is tapped, it deals 1 damage to you.\n\n{T}: Add {3} to your mana pool.","imageName":"mana vault"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":808,"name":"Manabarbs","cmc":4,"rarity":"Rare","artist":"Christopher Rush","manaCost":"{3}{R}","text":"Whenever a player taps a land for mana, Manabarbs deals 1 damage to that player.","rulings":[{"date":"2004-10-04","text":"This card has a triggered ability that causes a separate effect for 1 point of damage each time a land is tapped for mana."},{"date":"2009-10-01","text":"This ability is not a mana ability. It goes on the stack and can be responded to."},{"date":"2009-10-01","text":"The ability will trigger each time a land is tapped for mana. Each ability is separate."},{"date":"2009-10-01","text":"If any lands are tapped for mana while a player is casting a spell or activating an ability, Manabarbs's ability will trigger that many times and wait. When the player finishes casting that spell or activating that ability, it's put on the stack, then Manabarbs's triggered abilities are put on the stack on top of it. The Manabarbs abilities will resolve first."},{"date":"2009-10-01","text":"On the other hand, a player can tap lands for mana, let the Manabarbs triggered abilities be put on the stack, and then respond to those abilities by casting an instant or activating an ability using that mana. In that case, the spell or ability will resolve first."}],"imageName":"manabarbs"},{"type":"Artifact","types":["Artifact"],"multiverseid":628,"name":"Meekstone","cmc":1,"rarity":"Rare","artist":"Quinton Hoover","manaCost":"{1}","text":"Creatures with power 3 or greater don't untap during their controllers' untap steps.","imageName":"meekstone"},{"type":"Creature - Merfolk","types":["Creature"],"multiverseid":711,"name":"Merfolk of the Pearl Trident","subtypes":["Merfolk"],"cmc":1,"rarity":"Common","artist":"Jeff A. Menges","power":1,"toughness":1,"manaCost":"{U}","flavor":"Most human scholars believe that Merfolk are the survivors of sunken Atlantis, humans adapted to the water. Merfolk, however, believe that humans sprang forth from Merfolk who adapted themselves in order to explore their last frontier.","imageName":"merfolk of the pearl trident"},{"type":"Creature - Pegasus","types":["Creature"],"multiverseid":857,"name":"Mesa Pegasus","subtypes":["Pegasus"],"cmc":2,"rarity":"Common","artist":"Melissa Benson","power":1,"toughness":1,"manaCost":"{1}{W}","text":"Flying; banding (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)","flavor":"Before a woman marries in the village of Sursi, she must visit the land of the Mesa Pegasus. Legend has it that if the woman is pure of heart and her love is true, a Mesa Pegasus will appear, blessing her family with long life and good fortune.","rulings":[{"date":"2008-10-01","text":"If a creature with banding attacks, it can team up with any number of other attacking creatures with banding (and up to one nonbanding creature) and attack as a unit called a \"band.\" The band can be blocked by any creature that could block a single creature in the band. Blocking any creature in a band blocks the entire band. If a creature with banding is blocked, the attacking player chooses how the blockers' damage is assigned."},{"date":"2008-10-01","text":"A maximum of one nonbanding creature can join an attacking band no matter how many creatures with banding are in it."},{"date":"2008-10-01","text":"Creatures in the same band must all attack the same player or planeswalker."},{"date":"2009-10-01","text":"If a creature in combat has banding, its controller assigns damage for creatures blocking or blocked by it. That player can ignore the damage assignment order when making this assignment."}],"imageName":"mesa pegasus"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":668,"name":"Mind Twist","cmc":1,"rarity":"Rare","artist":"Julie Baroh","manaCost":"{X}{B}","text":"Target player discards X cards at random.","imageName":"mind twist"},{"type":"Creature - Goblin","types":["Creature"],"multiverseid":809,"name":"Mons's Goblin Raiders","subtypes":["Goblin"],"cmc":1,"rarity":"Common","artist":"Jeff A. Menges","power":1,"toughness":1,"manaCost":"{R}","flavor":"The intricate dynamics of Rundvelt Goblin affairs are often confused with anarchy. The chaos, however, is the chaos of a thundercloud, and direction will sporadically and violently appear. Pashalik Mons and his raiders are the thunderhead that leads in the storm.","imageName":"mons's goblin raiders"},{"supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"multiverseid":893,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Douglas Shuler","variations":[891,892],"imageName":"mountain1"},{"supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"multiverseid":892,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Douglas Schuler","variations":[891,893],"imageName":"mountain2"},{"supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"multiverseid":891,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Douglas Schuler","variations":[893,892],"imageName":"mountain3"},{"type":"Artifact","types":["Artifact"],"multiverseid":629,"name":"Mox Emerald","cmc":0,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{0}","text":"{T}: Add {G} to your mana pool.","imageName":"mox emerald"},{"type":"Artifact","types":["Artifact"],"multiverseid":630,"name":"Mox Jet","cmc":0,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{0}","text":"{T}: Add {B} to your mana pool.","imageName":"mox jet"},{"type":"Artifact","types":["Artifact"],"multiverseid":631,"name":"Mox Pearl","cmc":0,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{0}","text":"{T}: Add {W} to your mana pool.","imageName":"mox pearl"},{"type":"Artifact","types":["Artifact"],"multiverseid":632,"name":"Mox Ruby","cmc":0,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{0}","text":"{T}: Add {R} to your mana pool.","imageName":"mox ruby"},{"type":"Artifact","types":["Artifact"],"multiverseid":633,"name":"Mox Sapphire","cmc":0,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{0}","text":"{T}: Add {U} to your mana pool.","imageName":"mox sapphire"},{"type":"Instant","types":["Instant"],"multiverseid":765,"name":"Natural Selection","cmc":1,"rarity":"Rare","artist":"Mark Poole","manaCost":"{G}","text":"Look at the top three cards of target player's library, then put them back in any order. You may have that player shuffle his or her library.","rulings":[{"date":"2007-07-15","text":"This is now targeted."}],"imageName":"natural selection"},{"type":"Creature - Spirit","types":["Creature"],"multiverseid":669,"name":"Nether Shadow","subtypes":["Spirit"],"cmc":2,"rarity":"Rare","artist":"Christopher Rush","power":1,"toughness":1,"manaCost":"{B}{B}","text":"Haste\n\nAt the beginning of your upkeep, if Nether Shadow is in your graveyard with three or more creature cards above it, you may put Nether Shadow onto the battlefield.","rulings":[{"date":"2004-10-04","text":"Note that bringing the Shadow back onto the battlefield from the graveyard is not a spell, it is an ability. It can't be countered with something that counters spells."},{"date":"2004-10-04","text":"Since it enters the battlefield due to triggering at the beginning of upkeep, it is not possible to get an infinite loop with four Nether Shadows."},{"date":"2008-10-01","text":"A card is \"above\" another card in your graveyard if it was put into that graveyard later."},{"date":"2008-10-01","text":"layers may not rearrange the cards in their graveyards."},{"date":"2008-10-01","text":"If an effect or rule puts two or more cards into the same graveyard at the same time, the owner of those cards may arrange them in any order."},{"date":"2008-10-01","text":"The last thing that happens to a resolving instant or sorcery spell is that it's put into its owner's graveyard. Example: You cast Wrath of God. All creatures on the battlefield are destroyed. You arrange all the cards put into your graveyard this way in any order you want. The other players in the game do the same to the cards that are put into their graveyards. Then you put Wrath of God into your graveyard, on top of the other cards."},{"date":"2008-10-01","text":"Say you're the owner of both a permanent and an Aura that's attached to it. If both the permanent and the Aura are destroyed at the same time (by Akroma's Vengeance, for example), you decide the order they're put into your graveyard. If just the enchanted permanent is destroyed, it's put into your graveyard first. Then, after state-based actions are checked, the Aura (which is no longer attached to anything) is put into your graveyard on top of it."}],"imageName":"nether shadow"},{"type":"Creature - Imp","types":["Creature"],"multiverseid":670,"name":"Nettling Imp","subtypes":["Imp"],"cmc":3,"rarity":"Uncommon","artist":"Quinton Hoover","power":1,"toughness":1,"manaCost":"{2}{B}","text":"{T}: Choose target non-Wall creature the active player has controlled continuously since the beginning of the turn. That creature attacks this turn if able. If it doesn't, destroy it at the beginning of the next end step. Activate this ability only during an opponent's turn, before attackers are declared.","rulings":[{"date":"2004-10-04","text":"If the Imp leaves the battlefield before the end of the turn, the creature still is destroyed."},{"date":"2004-10-04","text":"You can use this effect on a creature you know won't be able to attack. For example, you can use it on a tapped creature."},{"date":"2004-10-04","text":"The creature is destroyed if it does not attack because it simply can't do so legally."}],"imageName":"nettling imp"},{"type":"Artifact","types":["Artifact"],"multiverseid":634,"name":"Nevinyrral's Disk","cmc":4,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{4}","text":"Nevinyrral's Disk enters the battlefield tapped.\n\n{1}, {T}: Destroy all artifacts, creatures, and enchantments.","rulings":[{"date":"2004-10-04","text":"The destruction of the Disk is not a sacrifice. It is destroyed as part of the resolution if it is still on the battlefield. If an effect makes Nevinyrral's Disk indestructible or regenerates it, it won't be destroyed by its ability."},{"date":"2005-08-01","text":"Creatures can be regenerated although the Auras on the creatures will still be destroyed by the Disk."}],"imageName":"nevinyrral's disk"},{"type":"Creature - Nightmare Horse","types":["Creature"],"multiverseid":671,"name":"Nightmare","subtypes":["Nightmare","Horse"],"cmc":6,"rarity":"Rare","artist":"Melissa Benson","power":null,"toughness":null,"manaCost":"{5}{B}","text":"Flying\n\nNightmare's power and toughness are each equal to the number of Swamps you control.","flavor":"The Nightmare arises from its lair in the swamps. As the poisoned land spreads, so does the Nightmare's rage and terrifying strength.","rulings":[{"date":"2008-04-01","text":"If you control 0 swamps, then the Nightmare has 0 toughness and will be put into its owner's graveyard as a state-based action right before the next player gains priority."},{"date":"2009-10-01","text":"Nightmare's power and toughness changes as the number of Swamps you control changes."}],"imageName":"nightmare"},{"type":"Creature - Human Knight","types":["Creature"],"multiverseid":858,"name":"Northern Paladin","subtypes":["Human","Knight"],"cmc":4,"rarity":"Rare","artist":"Douglas Schuler","power":3,"toughness":3,"manaCost":"{2}{W}{W}","text":"{W}{W}, {T}: Destroy target black permanent.","flavor":"\"Look to the north; there you will find aid and comfort.\"\n\n—The Book of Tal","imageName":"northern paladin"},{"type":"Artifact Creature - Golem","types":["Artifact","Creature"],"multiverseid":635,"name":"Obsianus Golem","subtypes":["Golem"],"cmc":6,"rarity":"Uncommon","artist":"Jesper Myrfors","power":4,"toughness":6,"manaCost":"{6}","flavor":"\"The foot stone is connected to the ankle stone, the ankle stone is connected to the leg stone...\"\n\n—Song of the Artificer","imageName":"obsianus golem"},{"type":"Creature - Orc Warrior","types":["Creature"],"multiverseid":810,"name":"Orcish Artillery","subtypes":["Orc","Warrior"],"cmc":3,"rarity":"Uncommon","artist":"Anson Maddocks","power":1,"toughness":3,"manaCost":"{1}{R}{R}","text":"{T}: Orcish Artillery deals 2 damage to target creature or player and 3 damage to you.","flavor":"In a rare display of ingenuity, the Orcs invented an incredibly destructive weapon. Most Orcish artillerists are those who dared criticize its effectiveness.","rulings":[{"date":"2004-10-04","text":"You do not take the 3 points of damage if the ability is countered because the target is illegal."}],"imageName":"orcish artillery"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":811,"name":"Orcish Oriflamme","cmc":4,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{3}{R}","text":"Attacking creatures you control get +1/+0.","imageName":"orcish oriflamme"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":672,"name":"Paralyze","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Anson Maddocks","manaCost":"{B}","text":"Enchant creature\n\nWhen Paralyze enters the battlefield, tap enchanted creature.\n\nEnchanted creature doesn't untap during its controller's untap step.\n\nAt the beginning of the upkeep of enchanted creature's controller, that player may pay {4}. If he or she does, untap the creature.","rulings":[{"date":"2004-10-04","text":"Paying the cost is optional."},{"date":"2004-10-04","text":"Paralyze can be cast targeting a creature which is already tapped."},{"date":"2004-10-04","text":"The creature can only be untapped using Paralyze once per turn."},{"date":"2004-10-04","text":"Two Paralyzes are not cumulative. Paying either one will untap the creature."},{"date":"2007-09-16","text":"This is a change from the most recent wording. As was the case in the past, Paralyze itself has the last triggered ability, rather than granting that ability to the enchanted creature."}],"imageName":"paralyze"},{"type":"Creature - Unicorn","types":["Creature"],"multiverseid":859,"name":"Pearled Unicorn","subtypes":["Unicorn"],"cmc":3,"rarity":"Common","artist":"Cornelius Brudi","power":2,"toughness":2,"manaCost":"{2}{W}","flavor":"\"‘Do you know, I always thought Unicorns were fabulous monsters, too? I never saw one alive before' ‘Well, now that we have seen each other,' said the Unicorn, ‘if you'll believe in me, I'll believe in you.'\"\n\n—Lewis Carroll","imageName":"pearled unicorn"},{"type":"Creature - Avatar Incarnation","types":["Creature"],"multiverseid":860,"name":"Personal Incarnation","subtypes":["Avatar","Incarnation"],"cmc":6,"rarity":"Rare","artist":"Kev Brockschmidt","power":6,"toughness":6,"manaCost":"{3}{W}{W}{W}","text":"{0}: The next 1 damage that would be dealt to Personal Incarnation this turn is dealt to its owner instead. Any player may activate this ability, but only if he or she owns Personal Incarnation.\n\nWhen Personal Incarnation dies, its owner loses half his or her life, rounded up.","rulings":[{"date":"2004-10-04","text":"You do not lose life if this card is exiled or sent someplace without going to the graveyard first."},{"date":"2004-10-04","text":"The owner of the Incarnation loses life when it is destroyed, not the controller. So if you control your opponent's Incarnation you can let it die to make them lose life."},{"date":"2007-02-01","text":"If you attempt to halve a negative life total, you halve 0.  This means that the life total stays the same.  A life total of -10 would remain -10."}],"imageName":"personal incarnation"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":673,"name":"Pestilence","cmc":4,"rarity":"Common","artist":"Jesper Myrfors","manaCost":"{2}{B}{B}","text":"At the beginning of the end step, if no creatures are on the battlefield, sacrifice Pestilence.\n\n{B}: Pestilence deals 1 damage to each creature and each player.","rulings":[{"date":"2004-10-04","text":"Each activation is considered a new damage effect. An activation can only be 1 point of damage."},{"date":"2011-06-01","text":"Note that \"until end of turn\" effects wear off after \"at the beginning of the end step\" triggered abilities, so an artifact that animates until end of turn can keep this on the battlefield."},{"date":"2011-06-01","text":"It will stay on the battlefield if there is a creature that is put into the graveyard during the end step. This is because this ability will not trigger at all if there is at least one creature on the battlefield as the end step begins."}],"imageName":"pestilence"},{"type":"Creature - Illusion","types":["Creature"],"multiverseid":712,"name":"Phantasmal Forces","subtypes":["Illusion"],"cmc":4,"rarity":"Uncommon","artist":"Mark Poole","power":4,"toughness":1,"manaCost":"{3}{U}","text":"Flying\n\nAt the beginning of your upkeep, sacrifice Phantasmal Forces unless you pay {U}.","flavor":"These beings embody the essence of true heroes long dead. Summoned from the dreamrealms, they rise to meet their enemies.","imageName":"phantasmal forces"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":713,"name":"Phantasmal Terrain","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Dameon Willich","manaCost":"{U}{U}","text":"Enchant land\n\nAs Phantasmal Terrain enters the battlefield, choose a basic land type.\n\nEnchanted land is the chosen type.","rulings":[{"date":"2006-10-15","text":"Will not add or remove Snow Supertype to or from a land."}],"imageName":"phantasmal terrain"},{"type":"Creature - Illusion","types":["Creature"],"multiverseid":714,"name":"Phantom Monster","subtypes":["Illusion"],"cmc":4,"rarity":"Uncommon","artist":"Jesper Myrfors","power":3,"toughness":3,"manaCost":"{3}{U}","text":"Flying","flavor":"\"While, like a ghastly rapid river,\n\nThrough the pale door,\n\nA hideous throng rush out forever,\n\nAnd laugh—but smile no more.\"\n\n—Edgar Allan Poe, \"The Haunted Palace\"","imageName":"phantom monster"},{"type":"Creature - Human Pirate","types":["Creature"],"multiverseid":715,"name":"Pirate Ship","subtypes":["Human","Pirate"],"cmc":5,"rarity":"Rare","artist":"Tom Wänerstrand","power":4,"toughness":3,"manaCost":"{4}{U}","text":"Pirate Ship can't attack unless defending player controls an Island.\n\n{T}: Pirate Ship deals 1 damage to target creature or player.\n\nWhen you control no Islands, sacrifice Pirate Ship.","imageName":"pirate ship"},{"type":"Creature - Rat","types":["Creature"],"multiverseid":674,"name":"Plague Rats","subtypes":["Rat"],"cmc":3,"rarity":"Common","artist":"Anson Maddocks","power":null,"toughness":null,"manaCost":"{2}{B}","text":"Plague Rats's power and toughness are each equal to the number of creatures named Plague Rats on the battlefield.","flavor":"\"Should you a Rat to madness tease \n\nWhy ev'n a Rat may plague you...\"\n\n—Samuel Coleridge, \"Recantation\"","imageName":"plague rats"},{"supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"multiverseid":897,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Jesper Myrfors","text":"W","variations":[899,898],"imageName":"plains1"},{"supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"multiverseid":898,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Jesper Myrfors","text":"W","variations":[899,897],"imageName":"plains2"},{"supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"multiverseid":899,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Jesper Myrfors","text":"W","variations":[897,898],"imageName":"plains3"},{"type":"Land - Mountain Plains","types":["Land"],"multiverseid":880,"name":"Plateau","subtypes":["Mountain","Plains"],"rarity":"Rare","artist":"Drew Tucker","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"plateau"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":716,"name":"Power Leak","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Drew Tucker","manaCost":"{1}{U}","text":"Enchant enchantment\n\nAt the beginning of the upkeep of enchanted enchantment's controller, that player may pay any amount of mana. Power Leak deals 2 damage to that player. Prevent X of that damage, where X is the amount of mana that player paid this way.","imageName":"power leak"},{"type":"Instant","types":["Instant"],"multiverseid":717,"name":"Power Sink","cmc":1,"rarity":"Common","artist":"Richard Thomas","manaCost":"{X}{U}","text":"Counter target spell unless its controller pays {X}. If he or she doesn't, that player taps all lands with mana abilities he or she controls and empties his or her mana pool.","rulings":[{"date":"2004-10-04","text":"Does not increase the mana cost of the spell. It just requires a separate expenditure in order for it to succeed."},{"date":"2004-10-04","text":"When this spell resolves, you either pay X mana or let your lands become tapped. The lands that become tapped are not \"tapped for mana\". If you choose to pay, you may pay the X mana using whatever mana abilities you want to use."},{"date":"2010-03-01","text":"Only lands that actually have mana abilities will get tappped. This includes basic lands and lands with mana abilities printed on them, as well as lands which have been granted a mana ability by some effect."}],"imageName":"power sink"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":812,"name":"Power Surge","cmc":2,"rarity":"Rare","artist":"Douglas Schuler","manaCost":"{R}{R}","text":"At the beginning of each player's upkeep, Power Surge deals X damage to that player, where X is the number of untapped lands he or she controlled at the beginning of this turn.","rulings":[{"date":"2004-10-04","text":"This card knows how many were untapped even if it was not on the battlefield at the beginning of the turn."}],"imageName":"power surge"},{"type":"Creature - Human Wizard","types":["Creature"],"multiverseid":718,"name":"Prodigal Sorcerer","subtypes":["Human","Wizard"],"cmc":3,"rarity":"Common","artist":"Douglas Schuler","power":1,"toughness":1,"manaCost":"{2}{U}","text":"{T}: Prodigal Sorcerer deals 1 damage to target creature or player.","flavor":"Occasionally a member of the Institute of Arcane Study acquires a taste for worldly pleasures. Seldom do they have trouble finding employment.","imageName":"prodigal sorcerer"},{"type":"Instant","types":["Instant"],"multiverseid":719,"name":"Psionic Blast","cmc":3,"rarity":"Uncommon","artist":"Douglas Schuler","manaCost":"{2}{U}","text":"Psionic Blast deals 4 damage to target creature or player and 2 damage to you.","imageName":"psionic blast"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":720,"name":"Psychic Venom","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Brian Snoddy","manaCost":"{1}{U}","text":"Enchant land\n\nWhenever enchanted land becomes tapped, Psychic Venom deals 2 damage to that land's controller.","rulings":[{"date":"2004-10-04","text":"Whenever the land is tapped for any reason, the ability triggers."}],"imageName":"psychic venom"},{"type":"Instant","types":["Instant"],"multiverseid":861,"name":"Purelace","cmc":1,"rarity":"Rare","artist":"Sandra Everingham","manaCost":"{W}","text":"Target spell or permanent becomes white. (Mana symbols on that permanent remain unchanged.)","imageName":"purelace"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":813,"name":"Raging River","cmc":2,"rarity":"Rare","artist":"Sandra Everingham","manaCost":"{R}{R}","text":"Whenever one or more creatures you control attack, each defending player divides all creatures without flying he or she controls into a \"left\" pile and a \"right\" pile. Then, for each attacking creature you control, choose \"left\" or \"right.\" That creature can't be blocked this combat except by creatures with flying and creatures in a pile with the chosen label.","rulings":[{"date":"2008-05-01","text":"If a creature enters the battlefield (or something becomes a creature) after the ability resolves, that creature will not be able to block any creature that was attacking at the time the ability resolved."},{"date":"2008-05-01","text":"If a creature is put onto the battlefield attacking after the ability resolves, it can be blocked by any creature that could normally block it (including others creatures that entered the battlefield after the ability resolved)."}],"imageName":"raging river"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":675,"name":"Raise Dead","cmc":1,"rarity":"Common","artist":"Jeff A. Menges","manaCost":"{B}","text":"Return target creature card from your graveyard to your hand.","rulings":[{"date":"2004-10-04","text":"You must show the card you bring out of the graveyard to your opponent."},{"date":"2004-10-04","text":"The creature being brought back is chosen on announcement and not on resolution of the spell because it is targeted."},{"date":"2008-04-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"raise dead"},{"type":"Instant","types":["Instant"],"multiverseid":814,"name":"Red Elemental Blast","cmc":1,"rarity":"Common","artist":"Richard Thomas","manaCost":"{R}","text":"Choose one — Counter target blue spell; or destroy target blue permanent.","imageName":"red elemental blast"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":862,"name":"Red Ward","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from red. This effect doesn't remove Red Ward.","imageName":"red ward"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":766,"name":"Regeneration","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Quinton Hoover","manaCost":"{1}{G}","text":"Enchant creature (Target a creature as you cast this. This card enters the battlefield attached to that creature.)\n\n{G}: Regenerate enchanted creature. (The next time that creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)","imageName":"regeneration"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":767,"name":"Regrowth","cmc":2,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{1}{G}","text":"Return target card from your graveyard to your hand.","imageName":"regrowth"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":863,"name":"Resurrection","cmc":4,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{2}{W}{W}","text":"Return target creature card from your graveyard to the battlefield.","imageName":"resurrection"},{"type":"Instant","types":["Instant"],"multiverseid":864,"name":"Reverse Damage","cmc":3,"rarity":"Rare","artist":"Dameon Willich","manaCost":"{1}{W}{W}","text":"The next time a source of your choice would deal damage to you this turn, prevent that damage. You gain life equal to the damage prevented this way.","rulings":[{"date":"2004-10-04","text":"It only affects damage dealt by the source one time. If the source damages you a second time this turn, the damage will not be reversed."}],"imageName":"reverse damage"},{"type":"Instant","types":["Instant"],"multiverseid":865,"name":"Righteousness","cmc":1,"rarity":"Rare","artist":"Douglas Schuler","manaCost":"{W}","text":"Target blocking creature gets +7/+7 until end of turn.","rulings":[{"date":"2009-10-01","text":"A \"blocking creature\" is one that has been declared as a blocker this combat, or one that was put onto the battlefield blocking this combat. Unless that creature leaves combat, it continues to be a blocking creature through the end of combat step, even if the creature or creatures it was blocking are no longer on the battlefield or have otherwise left combat."}],"imageName":"righteousness"},{"type":"Creature - Bird","types":["Creature"],"multiverseid":815,"name":"Roc of Kher Ridges","subtypes":["Bird"],"cmc":4,"rarity":"Rare","artist":"Andi Rusu","power":3,"toughness":3,"manaCost":"{3}{R}","text":"Flying","flavor":"We encountered a valley topped with immense boulders and eerie rock formations. Suddenly one of these boulders toppled from its perch and spread gargantuan wings, casting a shadow of darkness and sending us fleeing in terror.","imageName":"roc of kher ridges"},{"type":"Creature - Hydra","types":["Creature"],"multiverseid":816,"name":"Rock Hydra","subtypes":["Hydra"],"cmc":2,"rarity":"Rare","artist":"Jeff A. Menges","power":0,"toughness":0,"manaCost":"{X}{R}{R}","text":"Rock Hydra enters the battlefield with X +1/+1 counters on it.\n\nFor each 1 damage that would be dealt to Rock Hydra, if it has a +1/+1 counter on it, remove a +1/+1 counter from it and prevent that 1 damage.\n\n{R}: Prevent the next 1 damage that would be dealt to Rock Hydra this turn.\n\n{R}{R}{R}: Put a +1/+1 counter on Rock Hydra. Activate this ability only during your upkeep.","rulings":[{"date":"2004-10-04","text":"If put onto the battlefield without casting it from your hand, X will be zero."},{"date":"2004-10-04","text":"Once on the battlefield, the X is considered to be zero when calculating its mana cost."},{"date":"2008-08-01","text":"You can activate the activated ability that prevents damage any time, even if no source seems likely to deal damage to you in the near future. It will prevent the next 1 damage that would be dealt this turn, even if that turns out to be much later in the turn."},{"date":"2008-08-01","text":"If damage that would be dealt to Rock Hydra can't be prevented, you still remove a +1/+1 counter from it for each 1 damage dealt."}],"imageName":"rock hydra"},{"type":"Artifact","types":["Artifact"],"multiverseid":636,"name":"Rod of Ruin","cmc":4,"rarity":"Uncommon","artist":"Christopher Rush","manaCost":"{4}","text":"{3}, {T}: Rod of Ruin deals 1 damage to target creature or player.","imageName":"rod of ruin"},{"type":"Creature - Human Assassin","types":["Creature"],"multiverseid":676,"name":"Royal Assassin","subtypes":["Human","Assassin"],"cmc":3,"rarity":"Rare","artist":"Tom Wänerstrand","power":1,"toughness":1,"manaCost":"{1}{B}{B}","text":"{T}: Destroy target tapped creature.","flavor":"Trained in the arts of stealth, the royal assassins choose their victims carefully, relying on timing and precision rather than brute force.","rulings":[{"date":"2004-10-04","text":"Can't target itself because you choose the target before you tap him. At that time he is not yet a legal target."},{"date":"2004-10-04","text":"If the creature is no longer tapped when the Assassin's ability resolves, then the ability is countered."}],"imageName":"royal assassin"},{"type":"Instant","types":["Instant"],"multiverseid":677,"name":"Sacrifice","cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{B}","text":"As an additional cost to cast Sacrifice, sacrifice a creature.\n\nAdd to your mana pool an amount of {B} equal to the sacrificed creature's converted mana cost.","rulings":[{"date":"2004-10-04","text":"Sacrificing an animated land gives no mana since the converted mana cost was zero."},{"date":"2013-04-15","text":"You must sacrifice exactly one creature to cast this spell; you cannot cast it without sacrificing a creature, and you cannot sacrifice additional creatures."},{"date":"2013-04-15","text":"Players can only respond once this spell has been cast and all its costs have been paid. No one can try to destroy the creature you sacrificed to prevent you from casting this spell."}],"imageName":"sacrifice"},{"type":"Creature - Human Cleric","types":["Creature"],"multiverseid":866,"name":"Samite Healer","subtypes":["Human","Cleric"],"cmc":2,"rarity":"Common","artist":"Tom Wänerstrand","power":1,"toughness":1,"manaCost":"{1}{W}","text":"{T}: Prevent the next 1 damage that would be dealt to target creature or player this turn.","flavor":"Healers ultimately acquire the divine gifts of spiritual and physical wholeness. The most devout are also granted the ability to pass physical wholeness on to others.","imageName":"samite healer"},{"type":"Land - Forest Plains","types":["Land"],"multiverseid":881,"name":"Savannah","subtypes":["Forest","Plains"],"rarity":"Rare","artist":"Rob Alexander","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"savannah"},{"type":"Creature - Cat","types":["Creature"],"multiverseid":867,"name":"Savannah Lions","subtypes":["Cat"],"cmc":1,"rarity":"Rare","artist":"Daniel Gelon","power":2,"toughness":1,"manaCost":"{W}","flavor":"The traditional kings of the jungle command a healthy respect in other climates as well. Relying mainly on their stealth and speed, Savannah Lions can take a victim by surprise, even in the endless flat plains of their homeland.","imageName":"savannah lions"},{"type":"Creature - Zombie","types":["Creature"],"multiverseid":678,"name":"Scathe Zombies","subtypes":["Zombie"],"cmc":3,"rarity":"Common","artist":"Jesper Myrfors","power":2,"toughness":2,"manaCost":"{2}{B}","flavor":"\"They groaned, they stirred, they all uprose,/ Nor spake, nor moved their eyes;/ It had been strange, even in a dream,/\n\nTo have seen those dead men rise.\"/Samuel Coleridge, \"The Rime of the Ancient Mariner\"","imageName":"scathe zombies"},{"type":"Creature - Zombie","types":["Creature"],"multiverseid":679,"name":"Scavenging Ghoul","subtypes":["Zombie"],"cmc":4,"rarity":"Uncommon","artist":"Jeff A. Menges","power":2,"toughness":2,"manaCost":"{3}{B}","text":"At the beginning of each end step, put a corpse counter on Scavenging Ghoul for each creature that died this turn.\n\nRemove a corpse counter from Scavenging Ghoul: Regenerate Scavenging Ghoul.","rulings":[{"date":"2004-10-04","text":"The Ghoul still gets to claim counters even if it enters the battlefield after the creatures died."}],"imageName":"scavenging ghoul"},{"type":"Land - Plains Swamp","types":["Land"],"multiverseid":882,"name":"Scrubland","subtypes":["Plains","Swamp"],"rarity":"Rare","artist":"Jesper Myrfors","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"scrubland"},{"type":"Creature - Faerie","types":["Creature"],"multiverseid":768,"name":"Scryb Sprites","subtypes":["Faerie"],"cmc":1,"rarity":"Common","artist":"Amy Weber","power":1,"toughness":1,"manaCost":"{G}","text":"Flying","flavor":"The only sound was the gentle clicking of the Faeries' wings. Then those intruders who were still standing turned and fled. One thing was certain: they didn't think the Scryb were very funny anymore.","imageName":"scryb sprites"},{"type":"Creature - Serpent","types":["Creature"],"multiverseid":721,"name":"Sea Serpent","subtypes":["Serpent"],"cmc":6,"rarity":"Common","artist":"Jeff A. Menges","power":5,"toughness":5,"manaCost":"{5}{U}","text":"Sea Serpent can't attack unless defending player controls an Island.\n\n\n\nWhen you control no Islands, sacrifice Sea Serpent.","flavor":"Legend has it that Serpents used to be bigger, but how could that be?","imageName":"sea serpent"},{"type":"Creature - Troll","types":["Creature"],"multiverseid":817,"name":"Sedge Troll","subtypes":["Troll"],"cmc":3,"rarity":"Rare","artist":"Dan Frazier","power":2,"toughness":2,"manaCost":"{2}{R}","text":"Sedge Troll gets +1/+1 as long as you control a Swamp.\n\n{B}: Regenerate Sedge Troll.","flavor":"The stench in the hovel was overpowering; something loathsome was cooking. Occasionally something surfaced in the thick paste, but my host would casually push it down before I could make out what it was.","imageName":"sedge troll"},{"type":"Creature - Vampire","types":["Creature"],"multiverseid":680,"name":"Sengir Vampire","subtypes":["Vampire"],"cmc":5,"rarity":"Uncommon","artist":"Anson Maddocks","power":4,"toughness":4,"manaCost":"{3}{B}{B}","text":"Flying\n\nWhenever a creature dealt damage by Sengir Vampire this turn dies, put a +1/+1 counter on Sengir Vampire.","rulings":[{"date":"2007-07-15","text":"If Sengir Vampire deals nonlethal damage to a creature and then a different effect or damage source causes that creature to be put into a graveyard later in the turn, Sengir Vampire's ability will trigger and it will get a +1/+1 counter."},{"date":"2011-09-22","text":"Each time a creature is put into a graveyard from the battlefield, check whether Sengir Vampire had dealt any damage to it at any time during that turn. If so, Sengir Vampire's ability will trigger. It doesn't matter who controlled the creature or whose graveyard it was put into."},{"date":"2011-09-22","text":"If Sengir Vampire and a creature it dealt damage to are both put into a graveyard at the same time, Sengir Vampire's ability will trigger, but it will do nothing when it resolves."}],"imageName":"sengir vampire"},{"type":"Creature - Angel","types":["Creature"],"multiverseid":868,"name":"Serra Angel","subtypes":["Angel"],"cmc":5,"rarity":"Uncommon","artist":"Douglas Schuler","power":4,"toughness":4,"manaCost":"{3}{W}{W}","text":"Flying\n\nVigilance (Attacking doesn't cause this creature to tap.)","flavor":"Born with wings of light and a sword of faith, this heavenly incarnation embodies both fury and purity.","imageName":"serra angel"},{"type":"Creature - Dryad","types":["Creature"],"multiverseid":769,"name":"Shanodin Dryads","subtypes":["Dryad"],"cmc":1,"rarity":"Common","artist":"Anson Maddocks","power":1,"toughness":1,"manaCost":"{G}","text":"Forestwalk","flavor":"Moving without sound, swift figures pass through branches and undergrowth completely unhindered. One with the trees around them, the Dryads of Shanodin Forest are seen only when they wish to be.","imageName":"shanodin dryads"},{"type":"Instant","types":["Instant"],"multiverseid":818,"name":"Shatter","cmc":2,"rarity":"Common","artist":"Amy Weber","manaCost":"{1}{R}","text":"Destroy target artifact.","rulings":[{"date":"2004-10-04","text":"Regenerating artifacts can regenerate from this."}],"imageName":"shatter"},{"type":"Creature - Dragon","types":["Creature"],"multiverseid":819,"name":"Shivan Dragon","subtypes":["Dragon"],"cmc":6,"rarity":"Rare","artist":"Melissa Benson","power":5,"toughness":5,"manaCost":"{4}{R}{R}","text":"Flying\n\n{R}: Shivan Dragon gets +1/+0 until end of turn.","flavor":"While it's true most Dragons are cruel, the Shivan Dragon seems to take particular glee in the misery of others, often tormenting its victims much like a cat plays with a mouse before delivering the final blow.","imageName":"shivan dragon"},{"type":"Instant","types":["Instant"],"multiverseid":681,"name":"Simulacrum","cmc":2,"rarity":"Uncommon","artist":"Mark Poole","manaCost":"{1}{B}","text":"You gain life equal to the damage dealt to you this turn. Simulacrum deals damage to target creature you control equal to the damage dealt to you this turn.","rulings":[{"date":"2004-10-04","text":"You can't use Simulacrum on Loss of Life, just damage."},{"date":"2004-10-04","text":"This is not damage prevention or redirection. It actually is life gain and newly dealt damage."},{"date":"2008-08-01","text":"Simulacrum is the source of the damage. If an effect needs to know a characteristic of the damage's source (Protection from Black, for instance), it will see the damage coming from Simulacrum."}],"imageName":"simulacrum"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":682,"name":"Sinkhole","cmc":2,"rarity":"Common","artist":"Sandra Everingham","manaCost":"{B}{B}","text":"Destroy target land.","imageName":"sinkhole"},{"type":"Instant","types":["Instant"],"multiverseid":722,"name":"Siren's Call","cmc":1,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{U}","text":"Cast Siren's Call only during an opponent's turn, before attackers are declared.\n\nCreatures the active player controls attack this turn if able.\n\nAt the beginning of the next end step, destroy all non-Wall creatures that player controls that didn't attack this turn. Ignore this effect for each creature the player didn't control continuously since the beginning of the turn.","rulings":[{"date":"2004-10-04","text":"It will require creatures with Haste to attack since they are able, but it won't destroy them if they don't for some reason."},{"date":"2004-10-04","text":"The creature is destroyed if it does not attack because it simply can't do so legally."},{"date":"2009-02-01","text":"This will destroy creatures that weren't able to attack because they had been previously tapped."}],"imageName":"siren's call"},{"type":"Instant","types":["Instant"],"multiverseid":723,"name":"Sleight of Mind","cmc":1,"rarity":"Rare","artist":"Mark Poole","manaCost":"{U}","text":"Change the text of target spell or permanent by replacing all instances of one color word with another. (For example, you may change \"target black spell\" to \"target blue spell.\" This effect lasts indefinitely.)","rulings":[{"date":"2004-10-04","text":"You can't Sleight proper nouns (i.e. card names). This means that you can't affect a \"Black Vise\"."},{"date":"2004-10-04","text":"Can target a card with no color words on it."},{"date":"2004-10-04","text":"Can't change a color word to the same color word. It must be a different word."},{"date":"2004-10-04","text":"Alters all occurrences of the chosen word in the text box and the type line of the given card."},{"date":"2004-10-04","text":"Can target a card with no appropriate words on it, or even one with no words at all."},{"date":"2004-10-04","text":"It can't change a word to the same word. It must be a different word."},{"date":"2004-10-04","text":"It only changes what is printed on the card (or set on a token when it was created or set by a copy effect). It will not change any effects that are on the permanent."},{"date":"2004-10-04","text":"You choose the words to change on resolution."},{"date":"2004-10-04","text":"Changing the text of a spell will not allow you to change the targets of the spell because the targets were chosen when the spell was cast. The text change will (probably) cause it to be countered since the targets will be illegal."},{"date":"2004-10-04","text":"If you change the text of a spell which is to become a permanent, the permanent will retain the text change until the effect wears off."}],"imageName":"sleight of mind"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":820,"name":"Smoke","cmc":2,"rarity":"Rare","artist":"Jesper Myrfors","manaCost":"{R}{R}","text":"Players can't untap more than one creature during their untap steps.","rulings":[{"date":"2004-10-04","text":"Animated lands are affected by this spell. If on the battlefield with an effect that limits the number of land you untap, untapping an animated land will count as the one creature and the one land you can untap... thereby limiting you to one thing to be untapped."}],"imageName":"smoke"},{"type":"Artifact","types":["Artifact"],"multiverseid":637,"name":"Sol Ring","cmc":1,"rarity":"Uncommon","artist":"Mark Tedin","manaCost":"{1}","text":"{T}: Add {2} to your mana pool.","imageName":"sol ring"},{"type":"Artifact","types":["Artifact"],"multiverseid":638,"name":"Soul Net","cmc":1,"rarity":"Uncommon","artist":"Dameon Willich","manaCost":"{1}","text":"Whenever a creature dies, you may pay {1}. If you do, you gain 1 life.","rulings":[{"date":"2004-10-04","text":"If animated so it is a creature, it can be triggered off its own destruction."}],"imageName":"soul net"},{"type":"Instant","types":["Instant"],"multiverseid":724,"name":"Spell Blast","cmc":1,"rarity":"Common","artist":"Brian Snoddy","manaCost":"{X}{U}","text":"Counter target spell with converted mana cost X.","imageName":"spell blast"},{"type":"Enchantment","types":["Enchantment"],"multiverseid":725,"name":"Stasis","cmc":2,"rarity":"Rare","artist":"Fay Jones","manaCost":"{1}{U}","text":"Players skip their untap steps.\n\n\n\nAt the beginning of your upkeep, sacrifice Stasis unless you pay {U}.","rulings":[{"date":"2004-10-04","text":"Since there is no untap step, Phasing in/out won't happen."},{"date":"2004-10-04","text":"Does not prevent cards from being untapped outside the untap step."}],"imageName":"stasis"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":726,"name":"Steal Artifact","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Amy Weber","manaCost":"{2}{U}{U}","text":"Enchant artifact\n\nYou control enchanted artifact.","rulings":[{"date":"2004-10-04","text":"Can be used on artifact creatures."}],"imageName":"steal artifact"},{"type":"Creature - Giant","types":["Creature"],"multiverseid":821,"name":"Stone Giant","subtypes":["Giant"],"cmc":4,"rarity":"Uncommon","artist":"Dameon Willich","power":3,"toughness":4,"manaCost":"{2}{R}{R}","text":"{T}: Target creature you control with toughness less than Stone Giant's power gains flying until end of turn. Destroy that creature at the beginning of the next end step.","flavor":"What goes up, must come down.","rulings":[{"date":"2008-08-01","text":"If the Giant's power and/or toughness change so that its toughness is less than its power, you can have the ability target the Giant itself."},{"date":"2009-10-01","text":"To work as an evasion ability, an attacking creature must already have flying when the declare blockers step begins. Once a creature has become blocked, giving it flying won't change that."},{"date":"2009-10-01","text":"If Stone Giant's ability is activated during a turn's end step, the delayed triggered ability won't trigger until the beginning of the next turn's end step. The targeted creature will be destroyed at that time."},{"date":"2009-10-01","text":"When the delayed triggered ability resolves, the targeted creature is destroyed, even if it's no longer a creature, no longer under your control, or no longer has toughness less than Stone Giant's power at that time."}],"imageName":"stone giant"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":822,"name":"Stone Rain","cmc":3,"rarity":"Common","artist":"Daniel Gelon","manaCost":"{2}{R}","text":"Destroy target land.","imageName":"stone rain"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":770,"name":"Stream of Life","cmc":1,"rarity":"Common","artist":"Mark Poole","manaCost":"{X}{G}","text":"Target player gains X life.","imageName":"stream of life"},{"type":"Artifact","types":["Artifact"],"multiverseid":639,"name":"Sunglasses of Urza","cmc":3,"rarity":"Rare","artist":"Dan Frazier","manaCost":"{3}","text":"You may spend white mana as though it were red mana.","imageName":"sunglasses of urza"},{"supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"multiverseid":877,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Dan Frazier","text":"B","variations":[876,875],"imageName":"swamp1"},{"supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"multiverseid":876,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Dan Frazier","text":"B","variations":[875,877],"imageName":"swamp2"},{"supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"multiverseid":875,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Dan Frazier","text":"B","variations":[876,877],"imageName":"swamp3"},{"type":"Instant","types":["Instant"],"multiverseid":869,"name":"Swords to Plowshares","cmc":1,"rarity":"Uncommon","artist":"Jeff A. Menges","manaCost":"{W}","text":"Exile target creature. Its controller gains life equal to its power.","rulings":[{"date":"2004-10-04","text":"If the creature has a negative power, the player does not lose life. It acts the same as if it had a power of zero."},{"date":"2008-10-01","text":"The amount of life that's gained is equal to the power of the targeted creature as it last existed on the battlefield."}],"imageName":"swords to plowshares"},{"type":"Land - Mountain Forest","types":["Land"],"multiverseid":883,"name":"Taiga","subtypes":["Mountain","Forest"],"rarity":"Rare","artist":"Rob Alexander","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"taiga"},{"type":"Instant","types":["Instant"],"multiverseid":683,"name":"Terror","cmc":2,"rarity":"Common","artist":"Ron Spencer","manaCost":"{1}{B}","text":"Destroy target nonartifact, nonblack creature. It can't be regenerated.","imageName":"terror"},{"type":"Artifact","types":["Artifact"],"multiverseid":640,"name":"The Hive","cmc":5,"rarity":"Rare","artist":"Sandra Everingham","manaCost":"{5}","text":"{5}, {T}: Put a 1/1 colorless Insect artifact creature token with flying named Wasp onto the battlefield. (It can't be blocked except by creatures with flying or reach.)","imageName":"the hive"},{"type":"Creature - Basilisk","types":["Creature"],"multiverseid":771,"name":"Thicket Basilisk","subtypes":["Basilisk"],"cmc":5,"rarity":"Uncommon","artist":"Dan Frazier","power":2,"toughness":4,"manaCost":"{3}{G}{G}","text":"Whenever Thicket Basilisk blocks or becomes blocked by a non-Wall creature, destroy that creature at end of combat.","flavor":"Moss-covered statues littered the area, a macabre monument to the Basilisk's power.","rulings":[{"date":"2004-10-04","text":"Protection from Green does not stop the Basilisk's ability because the ability is not targeted."},{"date":"2004-10-04","text":"The ability destroys the creature at the end of the combat, which is after all first strike and normal damage dealing is done. This means that a creature may have to regenerate twice to survive the combat, once from damage and once again at end of combat."}],"imageName":"thicket basilisk"},{"type":"Instant","types":["Instant"],"multiverseid":727,"name":"Thoughtlace","cmc":1,"rarity":"Rare","artist":"Mark Poole","manaCost":"{U}","text":"Target spell or permanent becomes blue. (Mana symbols on that permanent remain unchanged.)","imageName":"thoughtlace"},{"type":"Artifact","types":["Artifact"],"multiverseid":641,"name":"Throne of Bone","cmc":1,"rarity":"Uncommon","artist":"Anson Maddocks","manaCost":"{1}","text":"Whenever a player casts a black spell, you may pay {1}. If you do, you gain 1 life.","imageName":"throne of bone"},{"type":"Creature - Wolf","types":["Creature"],"multiverseid":772,"name":"Timber Wolves","subtypes":["Wolf"],"cmc":1,"rarity":"Rare","artist":"Melissa Benson","power":1,"toughness":1,"manaCost":"{G}","text":"Banding (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)","flavor":"Though many think of Wolves as solitary predators, they are actually extremely social animals. During a hunt they often call to each other, which can be quite unsettling for their prey.","rulings":[{"date":"2008-10-01","text":"If a creature with banding attacks, it can team up with any number of other attacking creatures with banding (and up to one nonbanding creature) and attack as a unit called a \"band.\" The band can be blocked by any creature that could block a single creature in the band. Blocking any creature in a band blocks the entire band. If a creature with banding is blocked, the attacking player chooses how the blockers' damage is assigned."},{"date":"2008-10-01","text":"A maximum of one nonbanding creature can join an attacking band no matter how many creatures with banding are in it."},{"date":"2008-10-01","text":"Creatures in the same band must all attack the same player or planeswalker."},{"date":"2009-10-01","text":"If a creature in combat has banding, its controller assigns damage for creatures blocking or blocked by it. That player can ignore the damage assignment order when making this assignment."}],"imageName":"timber wolves"},{"type":"Artifact","types":["Artifact"],"multiverseid":642,"name":"Time Vault","cmc":2,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{2}","text":"Time Vault enters the battlefield tapped.\n\nTime Vault doesn't untap during your untap step.\n\nIf you would begin your turn while Time Vault is tapped, you may skip that turn instead. If you do, untap Time Vault.\n\n{T}: Take an extra turn after this one.","rulings":[{"date":"2004-10-04","text":"If multiple \"extra turn\" effects resolve in the same turn, take them in the reverse of the order that the effects resolved."},{"date":"2008-10-01","text":"The choice of whether or not to skip a turn is made as that turn would begin, and only if Time Vault is tapped at that time. If you choose to skip your turn, Time Vault untaps before anything else happens in the next turn."},{"date":"2008-10-01","text":"This wording means that you no longer end up skipping multiple turns if you find a way to activate the ability multiple times."}],"imageName":"time vault"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":728,"name":"Time Walk","cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{1}{U}","text":"Take an extra turn after this one.","rulings":[{"date":"2004-10-04","text":"If multiple \"extra turn\" effects resolve in the same turn, take them in the reverse of the order that the effects resolved."}],"imageName":"time walk"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":729,"name":"Timetwister","cmc":3,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{2}{U}","text":"Each player shuffles his or her hand and graveyard into his or her library, then draws seven cards. (Then put Timetwister into its owner's graveyard.)","imageName":"timetwister"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":773,"name":"Tranquility","cmc":3,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{2}{G}","text":"Destroy all enchantments.","imageName":"tranquility"},{"type":"Land - Forest Island","types":["Land"],"multiverseid":884,"name":"Tropical Island","subtypes":["Forest","Island"],"rarity":"Rare","artist":"Jesper Myrfors","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"tropical island"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":774,"name":"Tsunami","cmc":4,"rarity":"Uncommon","artist":"Richard Thomas","manaCost":"{3}{G}","text":"Destroy all Islands.","imageName":"tsunami"},{"type":"Land - Plains Island","types":["Land"],"multiverseid":885,"name":"Tundra","subtypes":["Plains","Island"],"rarity":"Rare","artist":"Jesper Myrfors","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"tundra"},{"type":"Instant","types":["Instant"],"multiverseid":823,"name":"Tunnel","cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{R}","text":"Destroy target Wall. It can't be regenerated.","imageName":"tunnel"},{"type":"Instant","types":["Instant"],"multiverseid":730,"name":"Twiddle","cmc":1,"rarity":"Common","artist":"Rob Alexander","manaCost":"{U}","text":"You may tap or untap target artifact, creature, or land.","rulings":[{"date":"2004-10-04","text":"This is not a toggle effect. If you use Twiddle to tap a card and before it takes effect your opponent taps it, Twiddle will not automatically untap the card."},{"date":"2004-10-04","text":"The decision whether or not to tap or untap is made on resolution. This is not a modal spell."}],"imageName":"twiddle"},{"type":"Creature - Giant","types":["Creature"],"multiverseid":824,"name":"Two-Headed Giant of Foriys","subtypes":["Giant"],"cmc":5,"rarity":"Rare","artist":"Anson Maddocks","power":4,"toughness":4,"manaCost":"{4}{R}","text":"Trample\n\nTwo-Headed Giant of Foriys can block an additional creature.","flavor":"None know if this Giant is the result of aberrant magics, Siamese twins, or a mentalist's schizophrenia.","imageName":"two-headed giant of foriys"},{"type":"Land - Island Swamp","types":["Land"],"multiverseid":886,"name":"Underground Sea","subtypes":["Island","Swamp"],"rarity":"Rare","artist":"Rob Alexander","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"underground sea"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":684,"name":"Unholy Strength","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{B}","text":"Enchant creature\n\nEnchanted creature gets +2/+1.","imageName":"unholy strength"},{"type":"Instant","types":["Instant"],"multiverseid":731,"name":"Unsummon","cmc":1,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{U}","text":"Return target creature to its owner's hand.","imageName":"unsummon"},{"type":"Creature - Troll","types":["Creature"],"multiverseid":825,"name":"Uthden Troll","subtypes":["Troll"],"cmc":3,"rarity":"Uncommon","artist":"Douglas Schuler","power":2,"toughness":2,"manaCost":"{2}{R}","text":"{R}: Regenerate Uthden Troll.","flavor":"\"Oi oi oi, me gotta hurt in 'ere\n\nOi oi oi, me smell a ting is near,\n\nGonna bosh 'n gonna nosh 'n da\n\nhurt'll disappear.\"\n\n—Traditional","imageName":"uthden troll"},{"type":"Creature - Human Druid","types":["Creature"],"multiverseid":775,"name":"Verduran Enchantress","subtypes":["Human","Druid"],"cmc":3,"rarity":"Rare","artist":"Kev Brockschmidt","power":0,"toughness":2,"manaCost":"{1}{G}{G}","text":"Whenever you cast an enchantment spell, you may draw a card.","flavor":"Some say magic was first practiced by women, who have always felt strong ties to the land.","rulings":[{"date":"2005-08-01","text":"This does not trigger on the moving of an Aura from one permanent to another."}],"imageName":"verduran enchantress"},{"type":"Creature - Shapeshifter","types":["Creature"],"multiverseid":732,"name":"Vesuvan Doppelganger","subtypes":["Shapeshifter"],"cmc":5,"rarity":"Rare","artist":"Quinton Hoover","power":0,"toughness":0,"manaCost":"{3}{U}{U}","text":"You may have Vesuvan Doppelganger enter the battlefield as a copy of any creature on the battlefield except it doesn't copy that creature's color and it gains \"At the beginning of your upkeep, you may have this creature become a copy of target creature except it doesn't copy that creature's color. If you do, this creature gains this ability.\"","rulings":[{"date":"2004-10-04","text":"When the Doppelganger switches creatures, the creature it used to be is not considered to have left the battlefield. Such effects will consider the creature to have left the battlefield when the Doppelganger leaves the battlefield."},{"date":"2004-10-04","text":"Damage is not removed when it changes forms."},{"date":"2004-10-04","text":"Can switch to the same creature it is currently a copy of."},{"date":"2004-10-04","text":"When it takes on the characteristics of the other card, it is no longer of creature type Shapeshifter."},{"date":"2004-10-04","text":"When changing forms, any text changes that exist on the Doppelganger are applied to the new text, if appropriate."},{"date":"2004-12-01","text":"If a Doppelganger is flipped, and it copies a flip card in any state, it will copy both \"sides\" of that card but use the flipped side. If a Doppelganger is unflipped, and it copies a flip card in any state, it will copy both \"sides\" of that card but use the unflipped side. In the second case, if it ever meets the flip conditions of its new ability, it will flip and used the flipped side of what it is copying."},{"date":"2007-09-16","text":"When Vesuvan Doppelganger's triggered ability triggers, you must choose a target for it. You determine whether to have the Doppelganger become a copy of that target when the ability resolves."},{"date":"2007-09-16","text":"Vesuvan Doppelganger copies the mana cost of the creature it's copying but doesn't copy its color."},{"date":"2007-09-16","text":"If another creature copies Vesuvan Doppelganger, the new creature will become a copy of whatever Vesuvan Doppelganger is copying except for its color, will copy Vesuvan Doppelganger's color, and will gain Vesuvan Doppelganger's triggered ability."},{"date":"2007-09-16","text":"Vesuvan Doppelganger's triggered ability may cause it to become a copy of itself. A Vesuvan Doppelganger that becomes a copy of a Vesuvan Doppelganger (either itself or a different one) will gain another instance of its triggered ability. Each instance of that ability will trigger during its controller's upkeep. They'll all be put on the stack and resolve one at a time. The last one to resolve determines the Doppelganger's characteristics for the rest of the turn."},{"date":"2007-09-16","text":"Vesuvan Doppelganger copies a face-down creature, it becomes a face-up 2/2 blue creature with no name and no abilities other than the one it gives itself."},{"date":"2007-09-16","text":"Although Vesuvan Doppelganger's triggered ability is targeted, its \"as enters the battlefield\" ability is not."}],"imageName":"vesuvan doppelganger"},{"type":"Creature - Human","types":["Creature"],"multiverseid":870,"name":"Veteran Bodyguard","subtypes":["Human"],"cmc":5,"rarity":"Rare","artist":"Douglas Schuler","power":2,"toughness":5,"manaCost":"{3}{W}{W}","text":"As long as Veteran Bodyguard is untapped, all damage that would be dealt to you by unblocked creatures is dealt to Veteran Bodyguard instead.","flavor":"Good bodyguards are hard to find, mainly because they don't live long.","rulings":[{"date":"2004-10-04","text":"If a creature is blocked but Trample damage is still done to a player, this damage can't be redirected to the Bodyguard because the Bodyguard only takes damage from unblocked creatures."},{"date":"2004-10-04","text":"Damage goes to the Bodyguard as long as he is untapped. This works even if he is blocking."},{"date":"2004-10-04","text":"If you have multiple Veteran Bodyguards, you can decide which one receives the redirected damage each time damage would be dealt to you."}],"imageName":"veteran bodyguard"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":733,"name":"Volcanic Eruption","cmc":3,"rarity":"Rare","artist":"Douglas Schuler","manaCost":"{X}{U}{U}{U}","text":"Destroy X target Mountains. Volcanic Eruption deals damage to each creature and each player equal to the number of Mountains put into a graveyard this way.","rulings":[{"date":"2004-10-04","text":"Can be used with X equal to zero. This is useful if no Mountains are on the battlefield."}],"imageName":"volcanic eruption"},{"type":"Land - Island Mountain","types":["Land"],"multiverseid":887,"name":"Volcanic Island","subtypes":["Island","Mountain"],"rarity":"Rare","artist":"Brian Snoddy","rulings":[{"date":"2008-10-01","text":"This has the mana abilities associated with both of its basic land types."},{"date":"2008-10-01","text":"This has basic land types, but it isn't a basic land. Things that affect basic lands don't affect it. Things that affect basic land types do."}],"imageName":"volcanic island"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":734,"name":"Wall of Air","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Richard Thomas","power":1,"toughness":5,"manaCost":"{1}{U}{U}","text":"Defender, flying (This creature can't attack, and it can block creatures with flying.)","flavor":"\"This ‘standing windstorm' can hold us off indefinitely? Ridiculous\" Saying nothing, she put a pinch of salt on the table. With a bang she clapped her hands, and the salt disappeared, blown away.","imageName":"wall of air"},{"type":"Creature - Skeleton Wall","types":["Creature"],"multiverseid":685,"name":"Wall of Bone","subtypes":["Skeleton","Wall"],"cmc":3,"rarity":"Uncommon","artist":"Anson Maddocks","power":1,"toughness":4,"manaCost":"{2}{B}","text":"Defender (This creature can't attack.)\n\n{B}: Regenerate Wall of Bone. (The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)","flavor":"The Wall of Bone is said to be an aspect of the Great Wall in Hel, where the bones of all sinners wait for Ragnarok, when Hela will call them forth for the final battle.","imageName":"wall of bone"},{"type":"Creature - Plant Wall","types":["Creature"],"multiverseid":776,"name":"Wall of Brambles","subtypes":["Plant","Wall"],"cmc":3,"rarity":"Uncommon","artist":"Anson Maddocks","power":2,"toughness":3,"manaCost":"{2}{G}","text":"Defender (This creature can't attack.)\n\n{G}: Regenerate Wall of Brambles.","flavor":"\"What else, when chaos draws all forces inward to shape a single leaf.\"Conrad Aiken","imageName":"wall of brambles"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":826,"name":"Wall of Fire","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Richard Thomas","power":0,"toughness":5,"manaCost":"{1}{R}{R}","text":"Defender (This creature can't attack.)\n\n{R}: Wall of Fire gets +1/+0 until end of turn.","flavor":"Conjured from the bowels of hell, the fiery wall forms an impassable barrier, searing the soul of any creature attempting to pass through its terrible bursts of flame.","imageName":"wall of fire"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":777,"name":"Wall of Ice","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Richard Thomas","power":0,"toughness":7,"manaCost":"{2}{G}","text":"Defender (This creature can't attack.)","flavor":"\"And through the drifts the snowy cliffs/ Did send a dismal sheen:/ Nor shapes of men nor beasts we ken—/ The ice was all between.\"/Samuel Coleridge, \"The Rime of the Ancient Mariner\"","imageName":"wall of ice"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":827,"name":"Wall of Stone","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Dan Frazier","power":0,"toughness":8,"manaCost":"{1}{R}{R}","text":"Defender (This creature can't attack.)","flavor":"The Earth herself lends her strength to these walls of living stone, which possess the stability of ancient mountains. These mighty bulwarks thwart ground-based troops, providing welcome relief for weary warriors who defend the land.","imageName":"wall of stone"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":871,"name":"Wall of Swords","subtypes":["Wall"],"cmc":4,"rarity":"Uncommon","artist":"Mark Tedin","power":3,"toughness":5,"manaCost":"{3}{W}","text":"Defender, flying (This creature can't attack, and it can block creatures with flying.)","flavor":"Just as the evil ones approached to slay Justina, she cast a great spell, imbuing her weapons with her own life force. Thus she fulfilled the prophecy: \"In the death of your savior will you find salvation.\"","imageName":"wall of swords"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":735,"name":"Wall of Water","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Richard Thomas","power":0,"toughness":5,"manaCost":"{1}{U}{U}","text":"Defender (This creature can't attack.)\n\n{U}: Wall of Water gets +1/+0 until end of turn.","flavor":"A deafening roar arose as the fury of an enormous vertical river supplanted our serenity. Eddies turned into whirling geysers, leveling everything in their path.","imageName":"wall of water"},{"type":"Creature - Wall","types":["Creature"],"multiverseid":778,"name":"Wall of Wood","subtypes":["Wall"],"cmc":1,"rarity":"Common","artist":"Mark Tedin","power":0,"toughness":3,"manaCost":"{G}","text":"Defender (This creature can't attack.)","flavor":"Everybody knows that to ward off trouble, you knock on wood. But usually it's better to make a wall out of the wood and let trouble do the knocking.","imageName":"wall of wood"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":779,"name":"Wanderlust","subtypes":["Aura"],"cmc":3,"rarity":"Uncommon","artist":"Cornelius Brudi","manaCost":"{2}{G}","text":"Enchant creature\n\nAt the beginning of the upkeep of enchanted creature's controller, Wanderlust deals 1 damage to that player.","imageName":"wanderlust"},{"type":"Creature - Elephant","types":["Creature"],"multiverseid":780,"name":"War Mammoth","subtypes":["Elephant"],"cmc":4,"rarity":"Common","artist":"Jeff A. Menges","power":3,"toughness":3,"manaCost":"{3}{G}","text":"Trample","flavor":"I didn't think Mammoths could ever hold a candle to a well-trained battle horse. Then one day I turned my back on a drunken soldier. His blow never landed; Mi'cha flung the brute over ten meters.","imageName":"war mammoth"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":686,"name":"Warp Artifact","subtypes":["Aura"],"cmc":2,"rarity":"Rare","artist":"Amy Weber","manaCost":"{B}{B}","text":"Enchant artifact\n\nAt the beginning of the upkeep of enchanted artifact's controller, Warp Artifact deals 1 damage to that player.","imageName":"warp artifact"},{"type":"Creature - Elemental","types":["Creature"],"multiverseid":736,"name":"Water Elemental","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Jeff A. Menges","power":5,"toughness":4,"manaCost":"{3}{U}{U}","flavor":"Unpredictable as the sea itself, Water Elementals shift without warning from tranquility to tempest. Capricious and fickle, they flow restlessly from one shape to another, expressing their moods with their physical forms.","imageName":"water elemental"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":687,"name":"Weakness","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Douglas Schuler","manaCost":"{B}","text":"Enchant creature\n\nEnchanted creature gets -2/-1.","imageName":"weakness"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":781,"name":"Web","subtypes":["Aura"],"cmc":1,"rarity":"Rare","artist":"Rob Alexander","manaCost":"{G}","text":"Enchant creature (Target a creature as you cast this. This card enters the battlefield attached to that creature.)\n\nEnchanted creature gets +0/+2 and has reach. (It can block creatures with flying.)","imageName":"web"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":828,"name":"Wheel of Fortune","cmc":3,"rarity":"Rare","artist":"Daniel Gelon","manaCost":"{2}{R}","text":"Each player discards his or her hand and draws seven cards.","imageName":"wheel of fortune"},{"type":"Creature - Human Knight","types":["Creature"],"multiverseid":872,"name":"White Knight","subtypes":["Human","Knight"],"cmc":2,"rarity":"Uncommon","artist":"Daniel Gelon","power":2,"toughness":2,"manaCost":"{W}{W}","text":"First strike (This creature deals combat damage before creatures without first strike.)\n\nProtection from black (This creature can't be blocked, targeted, dealt damage, or enchanted by anything black.)","flavor":"Out of the blackness and stench of the engulfing swamp emerged a shimmering figure. Only the splattered armor and ichor-stained sword hinted at the unfathomable evil the knight had just laid waste.","imageName":"white knight"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":873,"name":"White Ward","subtypes":["Aura"],"cmc":1,"rarity":"Uncommon","artist":"Dan Frazier","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from white. This effect doesn't remove White Ward.","imageName":"white ward"},{"type":"Enchantment - Aura","types":["Enchantment"],"multiverseid":782,"name":"Wild Growth","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Mark Poole","manaCost":"{G}","text":"Enchant land\n\nWhenever enchanted land is tapped for mana, its controller adds {G} to his or her mana pool (in addition to the mana the land produces).","rulings":[{"date":"2004-10-04","text":"The additional mana is not an ability of the land and is not something the land can produce."}],"imageName":"wild growth"},{"type":"Creature - Spirit","types":["Creature"],"multiverseid":688,"name":"Will-o'-the-Wisp","subtypes":["Spirit"],"cmc":1,"rarity":"Rare","artist":"Jesper Myrfors","power":0,"toughness":1,"manaCost":"{B}","text":"Flying (This creature can't be blocked except by creatures with flying or reach.)\n\n{B}: Regenerate Will-o'-the-Wisp. (The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)","flavor":"\"About, about in reel and rout\n\nThe death-fires danced at night;\n\nThe water, like a witch's oils,\n\nBurnt green, and blue and white.\"\n\n—Samuel Coleridge, \"The Rime of the Ancient Mariner\"","imageName":"will-o'-the-wisp"},{"type":"Artifact","types":["Artifact"],"multiverseid":643,"name":"Winter Orb","cmc":2,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{2}","text":"Players can't untap more than one land during their untap steps.","rulings":[{"date":"2004-10-04","text":"Even lands that are also creatures are affected by this card's ability."}],"imageName":"winter orb"},{"type":"Artifact","types":["Artifact"],"multiverseid":644,"name":"Wooden Sphere","cmc":1,"rarity":"Uncommon","artist":"Mark Tedin","manaCost":"{1}","text":"Whenever a player casts a green spell, you may pay {1}. If you do, you gain 1 life.","imageName":"wooden sphere"},{"type":"Instant","types":["Instant"],"multiverseid":689,"name":"Word of Command","cmc":2,"rarity":"Rare","artist":"Jesper Myrfors","manaCost":"{B}{B}","text":"Look at target opponent's hand and choose a card from it. You control that player until Word of Command finishes resolving. The player plays that card if able. While doing so, the player can activate mana abilities only if they're from lands he or she controls and only if mana they produce is spent to activate other mana abilities of lands he or she controls and/or play that card. If the chosen card is cast as a spell, you control the player while that spell is resolving.","rulings":[{"date":"2004-10-04","text":"To \"play a card\" is to either cast a spell or to put a land onto the battlefield using the main phase special action."},{"date":"2009-10-01","text":"You do get to choose which lands get tapped. You can make them choose an optional mana generating ability of the land that they tap, such as making them tap and sacrifice the land instead of just tap it."},{"date":"2011-01-01","text":"Word of Command can't be used to force a player to play a card that isn't in his or her hand."},{"date":"2011-01-01","text":"You control the player while this spell is resolving, which means you get to see anything he or she can see. If that player is required to search his or her library as part of playing the card or as part of its resolution if it's cast as a spell, then you can see the cards in that player's library as well."},{"date":"2011-01-01","text":"Your opponent can't counter the Word of Command after letting you look at his or her hand, but they can attempt to counter the spell you force them to cast."},{"date":"2011-01-01","text":"You may Command your opponent to play a land (if they have not already done so this turn)."},{"date":"2011-01-01","text":"You must order your opponent to play the chosen card if it is possible to do so."},{"date":"2011-01-01","text":"If there is a non-mana way to cast a spell, as with Pitch Spells, you may require that way to be used if it is possible to do so."},{"date":"2011-01-01","text":"Since this spell is an Instant, your opponent gets a chance to respond to it as normal. Once this spell resolves, you look at your opponent's hand and choose a card. Note that it is common practice to respond to Word of Command by using up any spells or mana you have prior to letting it resolve."},{"date":"2011-01-01","text":"During the resolution of this spell, that player plays the chosen card."}],"imageName":"word of command"},{"type":"Sorcery","types":["Sorcery"],"multiverseid":874,"name":"Wrath of God","cmc":4,"rarity":"Rare","artist":"Quinton Hoover","manaCost":"{2}{W}{W}","text":"Destroy all creatures. They can't be regenerated.","imageName":"wrath of god"},{"type":"Creature - Zombie","types":["Creature"],"multiverseid":690,"name":"Zombie Master","subtypes":["Zombie"],"cmc":3,"rarity":"Rare","artist":"Jeff A. Menges","power":2,"toughness":3,"manaCost":"{1}{B}{B}","text":"Other Zombie creatures have swampwalk.\n\nOther Zombies have \"{B}: Regenerate this permanent.\"","flavor":"They say the Zombie Master controlled these foul creatures even before his own death, but now that he is one of them, nothing can make them betray him.","imageName":"zombie master"}]}