{"name":"Gatecrash","code":"GTC","releaseDate":"2013-02-01","border":"black","cards":[{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":366305,"name":"Act of Treason","cmc":3,"rarity":"Common","artist":"Matt Stewart","manaCost":"{2}{R}","text":"Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn.","flavor":"Each day uncertainty and rumors spread, and each night attendance at the Juri Revue increases.","number":"85","rulings":[{"date":"2009-10-01","text":"Act of Treason can target any creature, even one that's untapped or one you already control."},{"date":"2010-08-15","text":"Gaining control of a creature doesn't cause you to gain control of any Auras or Equipment attached to it."}],"imageName":"act of treason"},{"layout":"normal","type":"Creature - Lizard Beast","types":["Creature"],"colors":["Green"],"multiverseid":366290,"name":"Adaptive Snapjaw","subtypes":["Lizard","Beast"],"cmc":5,"rarity":"Common","artist":"Tomasz Jedruszek","power":"6","toughness":"2","manaCost":"{4}{G}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","flavor":"\"Eh, needs more toad.\"\r\n\n—Gulistan, Simic biomancer","number":"113","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"adaptive snapjaw"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":366294,"name":"Aerial Maneuver","cmc":2,"rarity":"Common","artist":"Scott Chou","manaCost":"{1}{W}","text":"Target creature gets +1/+1 and gains flying and first strike until end of turn.","flavor":"\"When you put all of yourself into an attack, without fear or hesitation, in that instant you may attain greatness.\"\r\n\n—Predak, Gateless freemage","number":"1","imageName":"aerial maneuver"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366273,"name":"Ætherize","cmc":4,"rarity":"Uncommon","artist":"Ryan Barger","manaCost":"{3}{U}","text":"Return all attacking creatures to their owner's hand.","flavor":"\"You can come back once you've learned some manners—and figured out how to reconstitute your physical forms.\"","number":"29","rulings":[{"date":"2013-01-24","text":"An “attacking creature” is one that has been declared as an attacker this combat, or one that was put onto the battlefield attacking this combat. Unless that creature leaves combat, it continues to be an attacking creature through the end of combat step, even if the player it was attacking has left the game, or the planeswalker it was attacking has left combat. There’s no such thing as an attacking creature outside of the combat phase."}],"imageName":"aetherize"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":366258,"name":"Agoraphobia","subtypes":["Aura"],"cmc":2,"rarity":"Uncommon","artist":"Jim Murray","manaCost":"{1}{U}","text":"Enchant creature\n\nEnchanted creature gets -5/-0.\n\n{2}{U}: Return Agoraphobia to its owner's hand.","flavor":"\"Everyone in this city is choosing sides. I choose inside.\"","number":"30","rulings":[{"date":"2013-01-24","text":"Only Agoraphobia’s controller can activate its last ability, no matter who controls the creature Agoraphobia’s attached to."},{"date":"2013-01-24","text":"Agoraphobia’s last ability can be activated only while it’s on the battlefield."},{"date":"2013-01-24","text":"Players don’t have priority to cast spells and activate abilities between combat damage being assigned and being dealt. This means that if you want to return Agoraphobia to its owner’s hand before combat damage is dealt, you must do so before combat damage is assigned (and the creature will no longer get -5/-0)."}],"imageName":"agoraphobia"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["White","Black"],"multiverseid":366402,"name":"Alms Beast","subtypes":["Beast"],"cmc":4,"rarity":"Rare","artist":"Dan Scott","power":"6","toughness":"6","manaCost":"{2}{W}{B}","text":"Creatures blocking or blocked by Alms Beast have lifelink.","flavor":"Alms-coins are only redeemable at Orzhov businesses.","number":"141","rulings":[{"date":"2013-01-24","text":"Multiple instances of lifelink are redundant. If a creature that had lifelink already is blocking or blocked by Alms Beast, the controller of that creature won’t gain extra life."}],"imageName":"alms beast"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":366325,"name":"Alpha Authority","subtypes":["Aura"],"cmc":2,"rarity":"Uncommon","artist":"Dave Kendall","manaCost":"{1}{G}","text":"Enchant creature\n\nEnchanted creature has hexproof and can't be blocked by more than one creature.","flavor":"Even the bitterest enemies of the Burning-Tree Clan respect the strength of Borborygmos's rule.","number":"114","imageName":"alpha authority"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":366400,"name":"Angelic Edict","cmc":5,"rarity":"Common","artist":"Trevor Claxton","manaCost":"{4}{W}","text":"Exile target creature or enchantment.","flavor":"The Boros built a prison in the sky where Azorius statutes couldn't restrict their sense of justice.","number":"2","imageName":"angelic edict"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":366395,"name":"Angelic Skirmisher","subtypes":["Angel"],"cmc":6,"rarity":"Rare","artist":"David Rapoza","power":"4","toughness":"4","manaCost":"{4}{W}{W}","text":"Flying\n\nAt the beginning of each combat, choose first strike, vigilance, or lifelink. Creatures you control gain that ability until end of turn.","flavor":"\"A keen mind wields an army as a deft hand wields a sword.\"","number":"3","rulings":[{"date":"2013-01-24","text":"You choose which ability creatures you control will gain when Angelic Skirmisher’s ability resolves. This happens before attacking creatures are declared."},{"date":"2013-01-24","text":"Only creatures you control when the ability resolves will gain the chosen ability. Creatures that come under your control later in the turn will not gain the ability."}],"imageName":"angelic skirmisher"},{"layout":"normal","type":"Artifact Creature - Construct","types":["Artifact","Creature"],"colors":[],"multiverseid":366344,"name":"Armored Transport","subtypes":["Construct"],"cmc":3,"rarity":"Common","artist":"Cliff Childs","power":"2","toughness":"1","manaCost":"{3}","text":"Prevent all combat damage that would be dealt to Armored Transport by creatures blocking it.","flavor":"\"If only our jails were as secure.\"\r\n\n—Arrester Lavinia, Tenth Precinct","number":"226","imageName":"armored transport"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Red"],"multiverseid":366381,"name":"Arrows of Justice","cmc":3,"rarity":"Uncommon","artist":"James Ryman","manaCost":"{2}{R/W}","text":"Arrows of Justice deals 4 damage to target attacking or blocking creature.","flavor":"Archers from the Horizon Military Academy hone their skills by targeting pickpockets blocks away.","number":"211","rulings":[{"date":"2013-01-24","text":"An “attacking creature” or “blocking creature” is one that has been declared as an attacker or blocker this combat, or one that was put onto the battlefield attacking or blocking this combat. Unless that creature leaves combat, it continues to be an attacking or blocking creature through the end of combat step, even if the player it was attacking has left the game, the planeswalker it was attacking has left combat, or the creature or creatures it was blocking have left combat, as appropriate."},{"date":"2013-01-24","text":"Arrows of Justice may be cast during the end of combat step, after combat damage has been dealt."}],"imageName":"arrows of justice"},{"layout":"normal","type":"Creature - Griffin","types":["Creature"],"colors":["White"],"multiverseid":366337,"name":"Assault Griffin","subtypes":["Griffin"],"cmc":4,"rarity":"Common","artist":"Eric Velhagen","power":"3","toughness":"2","manaCost":"{3}{W}","text":"Flying","flavor":"\"The Simic offer a prize to any biomancer who can breed a krasis to match a griffin in the air. It's never been claimed.\"\r\n\n—Libuse, Boros sergeant","number":"4","imageName":"assault griffin"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White","Red"],"multiverseid":366470,"name":"Assemble the Legion","cmc":5,"rarity":"Rare","artist":"Eric Deschamps","manaCost":"{3}{R}{W}","text":"At the beginning of your upkeep, put a muster counter on Assemble the Legion. Then put a 1/1 red and white Soldier creature token with haste onto the battlefield for each muster counter on Assemble the Legion.","number":"142","rulings":[{"date":"2013-01-24","text":"If Assemble the Legion isn’t on the battlefield when its ability resolves, use the number of muster counters it had when it was last on the battlefield to determine how many Soldier tokens to put onto the battlefield."}],"imageName":"assemble the legion"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Red"],"multiverseid":366384,"name":"Aurelia's Fury","cmc":2,"rarity":"Mythic Rare","artist":"Tyler Jacobson","manaCost":"{X}{R}{W}","text":"Aurelia's Fury deals X damage divided as you choose among any number of target creatures and/or players. Tap each creature dealt damage this way. Players dealt damage this way can't cast noncreature spells this turn.","number":"144","imageName":"aurelia's fury"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Angel","types":["Creature"],"colors":["White","Red"],"multiverseid":366448,"name":"Aurelia, the Warleader","subtypes":["Angel"],"cmc":6,"rarity":"Mythic Rare","artist":"Slawomir Maniak","power":"3","toughness":"4","manaCost":"{2}{R}{R}{W}{W}","text":"Flying, vigilance, haste\n\nWhenever Aurelia, the Warleader attacks for the first time each turn, untap all creatures you control. After this phase, there is an additional combat phase.","flavor":"Where Razia was aloof and untouchable, Aurelia is on the frontlines, calling for war.","number":"143","rulings":[{"date":"2013-01-24","text":"You untap all creatures you control, including ones that aren’t attacking."},{"date":"2013-01-24","text":"You don’t have to attack with any creatures during the additional combat phase."},{"date":"2013-01-24","text":"If Aurelia is put onto the battlefield attacking, the triggered ability won’t trigger."}],"imageName":"aurelia, the warleader"},{"layout":"normal","type":"Creature - Vampire Rogue","types":["Creature"],"colors":["Black"],"multiverseid":366464,"name":"Balustrade Spy","subtypes":["Vampire","Rogue"],"cmc":4,"rarity":"Common","artist":"Jaime Jones","power":"2","toughness":"3","manaCost":"{3}{B}","text":"Flying\n\nWhen Balustrade Spy enters the battlefield, target player reveals cards from the top of his or her library until he or she reveals a land card, then puts those cards into his or her graveyard.","number":"57","rulings":[{"date":"2013-01-24","text":"If the target player has no land cards in his or her library, all cards from that library will be revealed and put into his or her graveyard."}],"imageName":"balustrade spy"},{"layout":"normal","type":"Creature - Human Rogue","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366475,"name":"Bane Alley Broker","subtypes":["Human","Rogue"],"cmc":3,"rarity":"Uncommon","artist":"Clint Cearley","power":"0","toughness":"3","manaCost":"{1}{U}{B}","text":"{T}: Draw a card, then exile a card from your hand face down.\n\nYou may look at cards exiled with Bane Alley Broker.\n\n{U}{B}, {T}: Return a card exiled with Bane Alley Broker to its owner's hand.","number":"145","rulings":[{"date":"2013-01-24","text":"If Bane Alley Broker’s first ability resolves when you have no cards in your hand, you’ll draw a card and then exile it. You won’t have the opportunity to cast that card (or do anything else with it) before exiling it."},{"date":"2013-01-24","text":"Once you are allowed to look at a face-down card in exile, you are allowed to look at that card as long as it’s exiled. If you no longer control Bane Alley Broker when its last ability resolves, you can continue to look at the relevant cards in exile to choose one to return."},{"date":"2013-01-24","text":"Bane Alley Broker’s second and third abilities apply to cards exiled with that specific Bane Alley Broker, not any other creature named Bane Alley Broker. You should keep cards exiled by different Bane Alley Brokers separate."},{"date":"2013-01-24","text":"If Bane Alley Broker leaves the battlefield, the cards exiled with it will be exiled indefinitely. If it later returns to the battlefield, it will be a new object with no connection to the cards exiled with it in its previous existence. You won’t be able to use the “new” Bane Alley Broker to return cards exiled with the “old” one."},{"date":"2013-01-24","text":"Even if not all players can look at the exiled cards, each card’s owner is still known. It is advisable to keep cards owned by different players in distinct piles in case another player gains control of Bane Alley Broker and exiles one or more cards with it."}],"imageName":"bane alley broker"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":366347,"name":"Basilica Guards","subtypes":["Human","Soldier"],"cmc":3,"rarity":"Common","artist":"Dan Scott","power":"1","toughness":"4","manaCost":"{2}{W}","text":"Defender\n\nExtort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"\"None may pass . . . for free.\"","number":"5","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"basilica guards"},{"layout":"normal","type":"Creature - Bat","types":["Creature"],"colors":["Black"],"multiverseid":366321,"name":"Basilica Screecher","subtypes":["Bat"],"cmc":2,"rarity":"Common","artist":"Christine Choi","power":"1","toughness":"2","manaCost":"{1}{B}","text":"Flying\n\nExtort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"A screech in the night is all it takes for Orzhov debtors to clutch at their coin purses.","number":"58","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"basilica screecher"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Black"],"multiverseid":366461,"name":"Beckon Apparition","cmc":1,"rarity":"Common","artist":"Cliff Childs","manaCost":"{W/B}","text":"Exile target card from a graveyard. Put a 1/1 white and black Spirit creature token with flying onto the battlefield.","flavor":"The foyer is littered with the coins it demands but can no longer hold.","number":"212","rulings":[{"date":"2008-08-01","text":"The controller of Beckon Apparition gets the token."},{"date":"2013-01-24","text":"Beckon Apparition will be on the stack when you choose its target. It can’t target itself."},{"date":"2013-01-24","text":"If the target card is an illegal target when Beckon Apparition tries to resolve (if it's no longer in the graveyard, for instance), the spell will be countered and none of its effects will happen. You won’t get a Spirit token."}],"imageName":"beckon apparition"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Green"],"multiverseid":366312,"name":"Biomass Mutation","cmc":2,"rarity":"Rare","artist":"Dan Scott","manaCost":"{X}{G/U}{G/U}","text":"Creatures you control become X/X until end of turn.","flavor":"\"A regression to ancient forms? A glimpse of future evolutions? Or a fleeting alteration of the present?\"\r\n\n—Vorel of the Hull Clade","number":"213","rulings":[{"date":"2013-01-24","text":"Choosing 0 as the value for X will likely cause creatures you control to become 0/0 and be put into the graveyard."},{"date":"2013-01-24","text":"Biomass Mutation overwrites any effects that set the power and/or toughness of a creature you control to a specific value. Effects that modify power and/or toughness but don’t set them to a specific value (like the one created by Giant Growth), power/toughness changes from counters, and effects that switch a creature’s power and toughness will continue to apply. For example, say you control a 1/1 creature that’s getting +4/+2 from an Aura, has a +1/+1 counter on it, and is affected by an effect that switches its power and toughness. This creature is 4/6. If you cast Biomass Mutation with X equal to 4, the creature would become 7/9 (4/4, +4/+2 from the Aura, +1/+1 from the counter, then switch power and toughness)."}],"imageName":"biomass mutation"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Green"],"multiverseid":366299,"name":"Bioshift","cmc":1,"rarity":"Common","artist":"Scott Chou","manaCost":"{G/U}","text":"Move any number of +1/+1 counters from target creature onto another target creature with the same controller.","flavor":"\"It's all right if you change your mind. There's always a chance we can rearrange parts later.\"\r\n\n—Zija, Simic mutationist","number":"214","rulings":[{"date":"2013-01-24","text":"To move a counter from one creature to another, the counter is removed from the first creature and placed on the second. Any abilities that care about a counter being removed or placed on a creature will apply."},{"date":"2013-01-24","text":"You decide how many counters to move when Bioshift resolves."},{"date":"2013-01-24","text":"If one of the two creatures is an illegal target when Bioshift tries to resolve, or if the creatures are controlled by different players at that time, no counters will move."}],"imageName":"bioshift"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366414,"name":"Biovisionary","subtypes":["Human","Wizard"],"cmc":3,"rarity":"Rare","artist":"Ryan Barger","power":"2","toughness":"3","manaCost":"{1}{G}{U}","text":"At the beginning of the end step, if you control four or more creatures named Biovisionary, you win the game.","flavor":"He tired of his fellow researchers and their useless prattling, so he decided to make a network of scholars with whom he could carry a conversation.","number":"146","rulings":[{"date":"2013-01-24","text":"Token creatures that are a copy of Biovisionary will count."},{"date":"2013-01-24","text":"If you don’t control four or more creatures named Biovisionary at the beginning of the end step, the ability won’t trigger."},{"date":"2013-01-24","text":"If the ability does trigger, but you don’t control four or more creatures named Biovisionary when the ability tries to resolve, the ability will do nothing."}],"imageName":"biovisionary"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":366465,"name":"Blind Obedience","cmc":2,"rarity":"Rare","artist":"Seb McKinnon","manaCost":"{1}{W}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n\nArtifacts and creatures your opponents control enter the battlefield tapped.","flavor":"\"By the time your knees have worn through your robe, you may have begun to learn your place.\"","number":"6","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"blind obedience"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["Red"],"multiverseid":366370,"name":"Bomber Corps","subtypes":["Human","Soldier"],"cmc":2,"rarity":"Common","artist":"Chase Stone","power":"1","toughness":"2","manaCost":"{1}{R}","text":"Battalion — Whenever Bomber Corps and at least two other creatures attack, Bomber Corps deals 1 damage to target creature or player.","flavor":"\"Subtlety is for lawmages and spies.\"","number":"86","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"bomber corps"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Cyclops","types":["Creature"],"colors":["Red","Green"],"multiverseid":366283,"name":"Borborygmos Enraged","subtypes":["Cyclops"],"cmc":8,"rarity":"Mythic Rare","artist":"Aleksi Briclot","power":"7","toughness":"6","manaCost":"{4}{R}{R}{G}{G}","text":"Trample\n\nWhenever Borborygmos Enraged deals combat damage to a player, reveal the top three cards of your library. Put all land cards revealed this way into your hand and the rest into your graveyard.\n\nDiscard a land card: Borborygmos Enraged deals 3 damage to target creature or player.","number":"147","imageName":"borborygmos enraged"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Red"],"multiverseid":366435,"name":"Boros Charm","cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{R}{W}","text":"Choose one — Boros Charm deals 4 damage to target player; or permanents you control are indestructible this turn; or target creature gains double strike until end of turn.","flavor":"\"Practice compassion and mercy. But know when they must end.\"\r\n\n—Aurelia","number":"148","rulings":[{"date":"2013-01-24","text":"If you choose the second mode, permanents that come under your control later in the turn will also be indestructible."},{"date":"2013-01-24","text":"Indestructible planeswalkers will still have loyalty counters removed from them as they are dealt damage. If an indestructible planeswalker has no loyalty counters, it will still be put into its owner's graveyard, as the rule that does this doesn't destroy the planeswalker."}],"imageName":"boros charm"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":366369,"name":"Boros Elite","subtypes":["Human","Soldier"],"cmc":1,"rarity":"Uncommon","artist":"Willian Murai","power":"1","toughness":"1","manaCost":"{W}","text":"Battalion — Whenever Boros Elite and at least two other creatures attack, Boros Elite gets +2/+2 until end of turn.","flavor":"\"First, you must fight among the rank and file. It is there I will discern your skills as a leader.\"\r\n\n—Aurelia, to Gideon Jura","number":"7","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"boros elite"},{"layout":"normal","type":"Land - Gate","types":["Land"],"colors":[],"multiverseid":366390,"name":"Boros Guildgate","subtypes":["Gate"],"rarity":"Common","artist":"Noah Bradley","text":"Boros Guildgate enters the battlefield tapped.\n\n{T}: Add {R} or {W} to your mana pool.","flavor":"Enter with merciful hearts. Exit with battle cries.","number":"239","rulings":[{"date":"2013-04-15","text":"The subtype Gate has no special rules significance, but other spells and abilities may refer to it."},{"date":"2013-04-15","text":"Gate is not a basic land type."}],"imageName":"boros guildgate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366413,"name":"Boros Keyrune","cmc":3,"rarity":"Uncommon","artist":"Daniel Ljunggren","manaCost":"{3}","text":"{T}: Add {R} or {W} to your mana pool.\n\n{R}{W}: Boros Keyrune becomes a 1/1 red and white Soldier artifact creature with double strike until end of turn. (It deals both first-strike and regular combat damage.)","number":"227","rulings":[{"date":"2013-04-15","text":"Until the ability that turns the Keyrune into a creature resolves, the Keyrune is colorless."},{"date":"2013-04-15","text":"Activating the ability that turns the Keyrune into a creature while it’s already a creature will override any effects that set its power and/or toughness to another number, but effects that modify power and/or toughness without directly setting them will still apply."}],"imageName":"boros keyrune"},{"layout":"normal","type":"Creature - Minotaur Wizard","types":["Creature"],"colors":["White","Red"],"multiverseid":366385,"name":"Boros Reckoner","subtypes":["Minotaur","Wizard"],"cmc":3,"rarity":"Rare","artist":"Howard Lyon","power":"3","toughness":"3","manaCost":"{R/W}{R/W}{R/W}","text":"Whenever Boros Reckoner is dealt damage, it deals that much damage to target creature or player.\n\n{R/W}: Boros Reckoner gains first strike until end of turn.","flavor":"\"Imagine a thunderstorm that's also a tactical genius. That's him.\"\r\n\n—Dars Gostok, Firefist captain","number":"215","rulings":[{"date":"2013-01-24","text":"Boros Reckoner’s first ability will trigger even if it is dealt lethal damage. For example, if it blocks a 7/7 creature, its ability will trigger and Boros Reckoner will deal 7 damage to the target creature or player."},{"date":"2013-01-24","text":"Damage dealt by Boros Reckoner due to its first ability isn’t combat damage, even if it was combat damage that caused that ability to trigger."}],"imageName":"boros reckoner"},{"layout":"normal","type":"Land - Forest Island","types":["Land"],"colors":[],"multiverseid":366291,"name":"Breeding Pool","subtypes":["Forest","Island"],"rarity":"Rare","artist":"Mike Bierek","text":"({T}: Add {G} or {U} to your mana pool.)\n\nAs Breeding Pool enters the battlefield, you may pay 2 life. If you don't, Breeding Pool enters the battlefield tapped.","flavor":"Uncharted depths. Unbounded hopes. Unfathomable mysteries.","number":"240","rulings":[{"date":"2005-10-01","text":"Has basic land types, but isn't a basic land.  Things that affect basic lands don't affect it.  For example, you can't find it with Civic Wayfinder."},{"date":"2005-10-01","text":"If another effect (such as Loxodon Gatekeeper's ability) tells you to put lands onto the battlefield tapped, it enters the battlefield tapped whether you pay 2 life or not."},{"date":"2005-10-01","text":"If multiple permanents with \"as enters the battlefield\" effects are entering the battlefield at the same time, process those effects one at a time, then put the permanents onto the battlefield all at once. For example, if you're at 3 life and an effect puts two of these onto the battlefield, you can pay 2 life for only one of them, not both."}],"imageName":"breeding pool"},{"layout":"normal","type":"Creature - Human Shaman","types":["Creature"],"colors":["Red","Green"],"multiverseid":366467,"name":"Burning-Tree Emissary","subtypes":["Human","Shaman"],"cmc":2,"rarity":"Uncommon","artist":"Izzy","power":"2","toughness":"2","manaCost":"{R/G}{R/G}","text":"When Burning-Tree Emissary enters the battlefield, add {R}{G} to your mana pool.","flavor":"Those who regard the Gruul as savage simpletons underestimate the subtle power of their shamans.","number":"216","rulings":[{"date":"2013-01-24","text":"Burning-Tree Emissary’s enters-the-battlefield ability isn’t a mana ability. It uses the stack and can be responded to."}],"imageName":"burning-tree emissary"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366304,"name":"Burst of Strength","cmc":1,"rarity":"Common","artist":"Marco Nelor","manaCost":"{G}","text":"Put a +1/+1 counter on target creature and untap it.","flavor":"\"Our fight is not about territory or revenge. It is about freedom, plain and simple.\"\r\n\n—Ruric Thar, Ghor-Clan chieftain","number":"115","rulings":[{"date":"2013-01-24","text":"Burst of Strength can target and put a +1/+1 counter on a creature that’s already untapped."}],"imageName":"burst of strength"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Black"],"multiverseid":366308,"name":"Call of the Nightwing","cmc":4,"rarity":"Uncommon","artist":"Adam Paquette","manaCost":"{2}{U}{B}","text":"Put a 1/1 blue and black Horror creature token with flying onto the battlefield.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"149","rulings":[{"date":"2013-01-24","text":"You can exile Call of the Nightwing encoded on the Horror creature token it just created."},{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"call of the nightwing"},{"layout":"normal","type":"Creature - Human Advisor","types":["Creature"],"colors":["White","Black"],"multiverseid":366364,"name":"Cartel Aristocrat","subtypes":["Human","Advisor"],"cmc":2,"rarity":"Uncommon","artist":"James Ryman","power":"2","toughness":"2","manaCost":"{W}{B}","text":"Sacrifice another creature: Cartel Aristocrat gains protection from the color of your choice until end of turn.","flavor":"\"Your life serves a higher purpose now: ensuring the continuation of my own.\"","number":"150","rulings":[{"date":"2013-01-24","text":"You choose the color when the ability resolves."}],"imageName":"cartel aristocrat"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":366314,"name":"Cinder Elemental","subtypes":["Elemental"],"cmc":4,"rarity":"Uncommon","artist":"Svetlin Velinov","power":"2","toughness":"2","manaCost":"{3}{R}","text":"{X}{R}, {T}, Sacrifice Cinder Elemental: Cinder Elemental deals X damage to target creature or player.","flavor":"\"The old gods awoke and sent fingers of fire to see what was left of the old ways under the endless city.\"\r\n\n—Daiva, Gruul storyteller","number":"87","imageName":"cinder elemental"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red","Green"],"multiverseid":366468,"name":"Clan Defiance","cmc":2,"rarity":"Rare","artist":"Daarken","manaCost":"{X}{R}{G}","text":"Choose one or more — Clan Defiance deals X damage to target creature with flying; Clan Defiance deals X damage to target creature without flying; and/or Clan Defiance deals X damage to target player.","number":"151","rulings":[{"date":"2013-01-24","text":"You can choose just one mode, any two of the modes, or all three. You make this choice as you cast Clan Defiance."},{"date":"2013-01-24","text":"The value of X is the same for each mode you choose."}],"imageName":"clan defiance"},{"layout":"normal","type":"Creature - Jellyfish","types":["Creature"],"colors":["Blue"],"multiverseid":366363,"name":"Clinging Anemones","subtypes":["Jellyfish"],"cmc":4,"rarity":"Common","artist":"Mike Bierek","power":"1","toughness":"4","manaCost":"{3}{U}","text":"Defender\n\nEvolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","number":"31","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"clinging anemones"},{"layout":"normal","type":"Creature - Bird Mutant","types":["Creature"],"colors":["Blue"],"multiverseid":366403,"name":"Cloudfin Raptor","subtypes":["Bird","Mutant"],"cmc":1,"rarity":"Common","artist":"Peter Mohrbacher","power":"0","toughness":"1","manaCost":"{U}","text":"Flying\n\nEvolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","number":"32","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"cloudfin raptor"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Black"],"multiverseid":366408,"name":"Coerced Confession","cmc":5,"rarity":"Uncommon","artist":"Mathias Kollros","manaCost":"{4}{U/B}","text":"Target player puts the top four cards of his or her library into his or her graveyard. You draw a card for each creature card put into that graveyard this way.","flavor":"\"Ask the right questions in the right way and truth is inevitable.\"\r\n\n—Lazav","number":"217","imageName":"coerced confession"},{"layout":"normal","type":"Creature - Horror","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366391,"name":"Consuming Aberration","subtypes":["Horror"],"cmc":5,"rarity":"Rare","artist":"Karl Kopinski","power":"*","toughness":"*","manaCost":"{3}{U}{B}","text":"Consuming Aberration's power and toughness are each equal to the number of cards in your opponents' graveyards.\n\nWhenever you cast a spell, each opponent reveals cards from the top of his or her library until he or she reveals a land card, then puts those cards into his or her graveyard.","number":"152","rulings":[{"date":"2013-01-24","text":"If any opponent has no land cards in his or her library, all the cards from that library will be revealed and put into his or her graveyard."},{"date":"2013-01-24","text":"The cards will be put into graveyards before the spell you cast to cause the ability to trigger resolves. However, none of those cards will be in a graveyard as you cast that spell, so they can’t be chosen as a target of that spell."}],"imageName":"consuming aberration"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":366420,"name":"Contaminated Ground","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Christine Choi","manaCost":"{1}{B}","text":"Enchant land\n\nEnchanted land is a Swamp.\n\nWhenever enchanted land becomes tapped, its controller loses 2 life.","flavor":"\"No one cares about pollution until they can see it.\"\r\n\n—Gurras, Golgari rot farmer","number":"59","rulings":[{"date":"2010-06-15","text":"The enchanted land loses its existing land types and any abilities  printed on it. It now has the land type Swamp and has the ability to tap  to add {B} to its controller's mana pool. Contaminated Ground doesn't  change the enchanted land's name or whether it's legendary, basic, or  snow."},{"date":"2010-06-15","text":"Contaminated Ground's last ability triggers whenever the enchanted  land becomes tapped for any reason, not just when it's tapped for mana."},{"date":"2010-06-15","text":"If, while casting a spell or activating an ability, the enchanted  land's controller taps the land for mana to pay for it, Contaminated  Ground's ability triggers and goes on the stack on top of that spell or  ability. Contaminated Ground's ability will resolve first."},{"date":"2010-06-15","text":"On the other hand, the enchanted land's controller may tap the land  for mana, let Contaminated Ground's ability trigger and go on the stack,  then spend that mana to cast an instant or activate an ability in  response. In that case, that instant or ability will resolve first."}],"imageName":"contaminated ground"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":366277,"name":"Corpse Blockade","subtypes":["Zombie"],"cmc":3,"rarity":"Common","artist":"Lucas Graciano","power":"1","toughness":"4","manaCost":"{2}{B}","text":"Defender\n\nSacrifice another creature: Corpse Blockade gains deathtouch until end of turn.","flavor":"There are laws against it, but the dead have no one to complain to and the living are too frightened to investigate.","number":"60","imageName":"corpse blockade"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":366389,"name":"Court Street Denizen","subtypes":["Human","Soldier"],"cmc":3,"rarity":"Common","artist":"Volkan Baga","power":"2","toughness":"2","manaCost":"{2}{W}","text":"Whenever another white creature enters the battlefield under your control, tap target creature an opponent controls.","flavor":"\"The Boros fight for justice. The Azorius fight for law. I hold the line between, and make sure the people are given both.\"","number":"8","imageName":"court street denizen"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":366255,"name":"Crackling Perimeter","cmc":2,"rarity":"Uncommon","artist":"Yeong-Hao Han","manaCost":"{1}{R}","text":"Tap an untapped Gate you control: Crackling Perimeter deals 1 damage to each opponent.","flavor":"As the path he sought came into focus, Niv-Mizzet took steps to prevent others from approaching it.","number":"88","rulings":[{"date":"2013-01-24","text":"You can’t tap an untapped Gate you control for mana and tap it to activate Crackling Perimeter’s ability at the same time. You must choose one or the other."}],"imageName":"crackling perimeter"},{"layout":"normal","type":"Creature - Crocodile Frog","types":["Creature"],"colors":["Green"],"multiverseid":366319,"name":"Crocanura","subtypes":["Crocodile","Frog"],"cmc":3,"rarity":"Common","artist":"Jack Wang","power":"1","toughness":"3","manaCost":"{2}{G}","text":"Reach (This creature can block creatures with flying.)\n\nEvolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","number":"116","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"crocanura"},{"layout":"normal","type":"Creature - Rhino","types":["Creature"],"colors":["Green"],"multiverseid":366256,"name":"Crowned Ceratok","subtypes":["Rhino"],"cmc":4,"rarity":"Uncommon","artist":"Steve Prescott","power":"4","toughness":"3","manaCost":"{3}{G}","text":"Trample\n\nEach creature you control with a +1/+1 counter on it has trample.","flavor":"The best way to calm a rampaging ceratok is to wait until it dies of natural causes.","number":"117","imageName":"crowned ceratok"},{"layout":"normal","type":"Creature - Spirit","types":["Creature"],"colors":["Black"],"multiverseid":366452,"name":"Crypt Ghast","subtypes":["Spirit"],"cmc":4,"rarity":"Rare","artist":"Chris Rahn","power":"2","toughness":"2","manaCost":"{3}{B}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n\nWhenever you tap a Swamp for mana, add {B} to your mana pool (in addition to the mana the land produces).","number":"61","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"crypt ghast"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White"],"multiverseid":366251,"name":"Daring Skyjek","subtypes":["Human","Knight"],"cmc":2,"rarity":"Common","artist":"Jason Chan","power":"3","toughness":"1","manaCost":"{1}{W}","text":"Battalion — Whenever Daring Skyjek and at least two other creatures attack, Daring Skyjek gains flying until end of turn.","flavor":"\"The hard part isn't landing in the saddle. The hard part is leaping before you see it.\"","number":"9","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"daring skyjek"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":366300,"name":"Death's Approach","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Terese Nielsen","manaCost":"{B}","text":"Enchant creature\n\nEnchanted creature gets -X/-X, where X is the number of creature cards in its controller's graveyard.","flavor":"\"It's cold in the grave, and the dead crave your warmth. Who are you to deny them?\"\r\n\n—Strava, Dimir mage","number":"62","imageName":"death's approach"},{"layout":"normal","type":"Creature - Human Rogue","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366254,"name":"Deathcult Rogue","subtypes":["Human","Rogue"],"cmc":3,"rarity":"Common","artist":"David Palumbo","power":"2","toughness":"2","manaCost":"{1}{U/B}{U/B}","text":"Deathcult Rogue can't be blocked except by Rogues.","flavor":"\"The hussars can't catch him, and he evades our traps with ease. I fear he walks unseen even in the halls of New Prahv.\"\r\n\n—Arrester Lavinia, Tenth Precinct","number":"218","rulings":[{"date":"2013-01-24","text":"If a creature already assigned to block Deathcult Rogue stops being a Rogue, it will continue to block."}],"imageName":"deathcult rogue"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White","Black"],"multiverseid":366278,"name":"Deathpact Angel","subtypes":["Angel"],"cmc":6,"rarity":"Mythic Rare","artist":"Jason Chan","power":"5","toughness":"5","manaCost":"{3}{W}{B}{B}","text":"Flying\n\nWhen Deathpact Angel dies, put a 1/1 white and black Cleric creature token onto the battlefield. It has \"{3}{W}{B}{B}, {T}, Sacrifice this creature: Return a card named Deathpact Angel from your graveyard to the battlefield.\"","number":"153","rulings":[{"date":"2013-01-24","text":"The card named Deathpact Angel that you return to the battlefield doesn’t necessarily have to be the same one that created the token you sacrificed."},{"date":"2013-01-24","text":"The activated ability is part of the Cleric token’s copiable values. Any copy of that creature token will also have that ability."},{"date":"2013-01-24","text":"The activated ability of the token doesn’t target any card in your graveyard. You choose the card named Deathpact Angel, if any, when the ability resolves."}],"imageName":"deathpact angel"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":366268,"name":"Debtor's Pulpit","subtypes":["Aura"],"cmc":5,"rarity":"Uncommon","artist":"James Paick","manaCost":"{4}{W}","text":"Enchant land\n\nEnchanted land has \"{T}: Tap target creature.\"","flavor":"\"You may not be able to pay. But you can still kneel.\"\r\n\n—Milana, Orzhov prelate","number":"10","imageName":"debtor's pulpit"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":366379,"name":"Devour Flesh","cmc":2,"rarity":"Common","artist":"Kev Walker","manaCost":"{1}{B}","text":"Target player sacrifices a creature, then gains life equal to that creature's toughness.","flavor":"His twisted mind concluded that if he was what he ate, and he wanted to stay human, . . .","number":"63","rulings":[{"date":"2013-01-24","text":"Devour Flesh targets only a player. It doesn’t target any creatures. The target player chooses which creature to sacrifice when the spell resolves. That player can sacrifice only a creature he or she controls."},{"date":"2013-01-24","text":"The amount of life gained is equal to the creature’s toughness as it last existed on the battlefield."}],"imageName":"devour flesh"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["Blue"],"multiverseid":366326,"name":"Diluvian Primordial","subtypes":["Avatar"],"cmc":7,"rarity":"Rare","artist":"Stephan Martiniere","power":"5","toughness":"5","manaCost":"{5}{U}{U}","text":"Flying\n\nWhen Diluvian Primordial enters the battlefield, for each opponent, you may cast up to one target instant or sorcery card from that player's graveyard without paying its mana cost. If a card cast this way would be put into a graveyard this turn, exile it instead.","number":"33","rulings":[{"date":"2013-01-24","text":"You can choose a number of targets up to the number of opponents you have, one target per opponent."},{"date":"2013-01-24","text":"You cast the cards one at a time, choosing modes, targets and so on. The last card you cast will be the first one to resolve."},{"date":"2013-01-24","text":"When casting an instant or sorcery card this way, ignore timing restrictions based on the card’s type. Other timing restrictions, such as “Cast [this card] only during combat,” must be followed."},{"date":"2013-01-24","text":"If you can’t cast one of the target instant or sorcery cards, perhaps because there are no legal targets available, or if you choose not to cast one, it will remain in its owner’s graveyard."},{"date":"2013-01-24","text":"If you cast a card “without paying its mana cost,” you can’t pay alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the card has mandatory additional costs, you must pay those."},{"date":"2013-01-24","text":"If a card has {X} in its mana cost, you must choose 0 as its value."},{"date":"2013-01-24","text":"If an instant or sorcery card you cast this way is countered, it will still be exiled."},{"date":"2013-01-24","text":"If you cast an instant or sorcery spell with cipher this way, you may exile the card encoded on a creature you control. If you can’t, or if you choose not to, the card will end up exiled but not encoded on a creature."},{"date":"2013-01-24","text":"If an instant or sorcery card you cast this way goes to a zone other than exile or a graveyard, perhaps because one of its abilities says to put it into its owner’s hand, it won’t be exiled. This is true even if the card would be put into a graveyard later that turn."}],"imageName":"diluvian primordial"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Black"],"multiverseid":366473,"name":"Dimir Charm","cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{U}{B}","text":"Choose one — Counter target sorcery spell; or destroy target creature with power 2 or less; or look at the top three cards of target player's library, then put one back and the rest into that player's graveyard.","flavor":"\"Dangerous to recognize. Deadly not to.\"\r\n\n—Lazav","number":"154","imageName":"dimir charm"},{"layout":"normal","type":"Land - Gate","types":["Land"],"colors":[],"multiverseid":366313,"name":"Dimir Guildgate","subtypes":["Gate"],"rarity":"Common","artist":"Cliff Childs","text":"Dimir Guildgate enters the battlefield tapped.\n\n{T}: Add {U} or {B} to your mana pool.","flavor":"Enter and become a mastermind of spies, lies, and deception.","number":"241","rulings":[{"date":"2013-04-15","text":"The subtype Gate has no special rules significance, but other spells and abilities may refer to it."},{"date":"2013-04-15","text":"Gate is not a basic land type."}],"imageName":"dimir guildgate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366270,"name":"Dimir Keyrune","cmc":3,"rarity":"Uncommon","artist":"Daniel Ljunggren","manaCost":"{3}","text":"{T}: Add {U} or {B} to your mana pool.\n\n{U}{B}: Dimir Keyrune becomes a 2/2 blue and black Horror artifact creature until end of turn and is unblockable this turn.","flavor":"A key that slips through every lock.","number":"228","rulings":[{"date":"2013-04-15","text":"Until the ability that turns the Keyrune into a creature resolves, the Keyrune is colorless."},{"date":"2013-04-15","text":"Activating the ability that turns the Keyrune into a creature while it’s already a creature will override any effects that set its power and/or toughness to another number, but effects that modify power and/or toughness without directly setting them will still apply."}],"imageName":"dimir keyrune"},{"layout":"normal","type":"Creature - Horror","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366453,"name":"Dinrova Horror","subtypes":["Horror"],"cmc":6,"rarity":"Uncommon","artist":"Johann Bodin","power":"4","toughness":"4","manaCost":"{4}{U}{B}","text":"When Dinrova Horror enters the battlefield, return target permanent to its owner's hand, then that player discards a card.","flavor":"\"Welcome to the Dimir Public Offices. Not responsible for death or loss of property. Basement off-limits.\"\r\n\n—Sign outside Dinrova Building","number":"155","rulings":[{"date":"2013-01-24","text":"If the target permanent is an illegal target when Dinrova Horror’s ability tries to resolve, the ability will be countered and none of its effects will happen. No player will discard a card."},{"date":"2013-01-24","text":"If a player has no cards in his or her hand and Dinrova’s Horror returns a card to that player’s hand, the player must discard that card. He or she won’t have the opportunity to cast that card (or do anything else with it) before discarding it."},{"date":"2013-01-24","text":"A token permanent returned to a player’s hand isn’t a card and can’t be discarded. It will cease to exist when state-based actions are performed after the ability finishes resolving."}],"imageName":"dinrova horror"},{"layout":"normal","type":"Creature - Human Warrior","types":["Creature"],"colors":["Green"],"multiverseid":366447,"name":"Disciple of the Old Ways","subtypes":["Human","Warrior"],"cmc":2,"rarity":"Common","artist":"Anthony Palumbo","power":"2","toughness":"2","manaCost":"{1}{G}","text":"{R}: Disciple of the Old Ways gains first strike until end of turn.","flavor":"\"Selesnya thinks nature is a pretty plaything. True nature would rip their faces off and wear their skins as trophies.\"","number":"118","imageName":"disciple of the old ways"},{"layout":"normal","type":"Planeswalker - Domri","types":["Planeswalker"],"colors":["Red","Green"],"multiverseid":366367,"name":"Domri Rade","subtypes":["Domri"],"cmc":3,"rarity":"Mythic Rare","artist":"Tyler Jacobson","loyalty":3,"manaCost":"{1}{R}{G}","text":"+1: Look at the top card of your library. If it's a creature card, you may reveal it and put it into your hand.\n\n-2: Target creature you control fights another target creature.\n\n-7: You get an emblem with \"Creatures you control have double strike, trample, hexproof, and haste.\"","number":"156","rulings":[{"date":"2013-01-24","text":"When resolving Domri’s first ability, if the card you look at isn’t a creature card, or it it’s a creature card you don’t want to put into your hand, you simply put it back on top of your library."},{"date":"2013-01-24","text":"The second target of the second ability can be another creature you control, but it can’t be the same creature as the first target."},{"date":"2013-01-24","text":"If either target of the second ability is an illegal target when the ability tries to resolve, neither creature will deal or be dealt damage."},{"date":"2013-01-24","text":"Domri’s emblem doesn’t remove any other abilities of creatures you control."},{"date":"2013-04-15","text":"If a creature has both double strike and trample, the combat damage it assigned during the first combat damage step will be considered when determining how much damage can trample through in the second combat damage step. If the blocker is destroyed during the first combat damage step, then all of the damage must be assigned to the defending player during the second combat damage step."}],"imageName":"domri rade"},{"layout":"normal","type":"Creature - Lizard Drake","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366292,"name":"Drakewing Krasis","subtypes":["Lizard","Drake"],"cmc":3,"rarity":"Common","artist":"Johann Bodin","power":"3","toughness":"1","manaCost":"{1}{G}{U}","text":"Flying, trample","flavor":"Cautious not to repeat Vig's mistakes, the Simic fuse life essences using magic alone. Each result is called a krasis.","number":"157","imageName":"drakewing krasis"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366328,"name":"Duskmantle Guildmage","subtypes":["Human","Wizard"],"cmc":2,"rarity":"Uncommon","artist":"Slawomir Maniak","power":"2","toughness":"2","manaCost":"{U}{B}","text":"{1}{U}{B}: Whenever a card is put into an opponent's graveyard from anywhere this turn, that player loses 1 life.\n\n{2}{U}{B}: Target player puts the top two cards of his or her library into his or her graveyard.","number":"158","rulings":[{"date":"2013-01-24","text":"The first ability considers each of your opponents. You don’t choose just one of them."},{"date":"2013-01-24","text":"Each time the first ability resolves, a delayed triggered ability is created. Whenever a card is put into an opponent’s graveyard that turn, each of those abilities will trigger. For example, if you activate the first ability twice (and let those abilities resolve) and then activate the second ability targeting an opponent, that player will lose a total of 4 life. Each card put into that player’s graveyard will cause two abilities to trigger, each causing that player to lose 1 life."},{"date":"2013-01-24","text":"The delayed triggered ability created won’t trigger if a token permanent is put into an opponent’s graveyard."}],"imageName":"duskmantle guildmage"},{"layout":"normal","type":"Creature - Vampire Wizard","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366310,"name":"Duskmantle Seer","subtypes":["Vampire","Wizard"],"cmc":4,"rarity":"Mythic Rare","artist":"Kev Walker","power":"4","toughness":"4","manaCost":"{2}{U}{B}","text":"Flying\n\nAt the beginning of your upkeep, each player reveals the top card of his or her library, loses life equal to that card's converted mana cost, then puts it into his or her hand.","number":"159","rulings":[{"date":"2013-01-24","text":"The loss of life is simultaneous. If this causes both players to end up at 0 or less life, the game will be a draw. In a multiplayer game, players with 0 or less life will lose the game."},{"date":"2013-01-24","text":"The cards put into hands this way are not “drawn.” For example, you couldn’t reveal a card with miracle put into your hand this way (but it also won’t count as the first card you’ve drawn this turn either)."}],"imageName":"duskmantle seer"},{"layout":"normal","type":"Creature - Thrull","types":["Creature"],"colors":["White"],"multiverseid":366457,"name":"Dutiful Thrull","subtypes":["Thrull"],"cmc":1,"rarity":"Common","artist":"Daarken","power":"1","toughness":"1","manaCost":"{W}","text":"{B}: Regenerate Dutiful Thrull.","flavor":"\"They are useful, but there's little satisfaction in supplication that throws itself under your heel.\"\r\n\n—Jozica, Orzhov enforcer","number":"11","imageName":"dutiful thrull"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":366382,"name":"Dying Wish","subtypes":["Aura"],"cmc":2,"rarity":"Uncommon","artist":"Scott Chou","manaCost":"{1}{B}","text":"Enchant creature you control\n\nWhen enchanted creature dies, target player loses X life and you gain X life, where X is its power.","flavor":"\"I wish I could rewrite my every deed and kill you with my first breath instead of my last.\"","number":"64","rulings":[{"date":"2013-01-24","text":"Use the creature’s power the last time it was on the battlefield to determine how much life the target player loses and how much life you gain."},{"date":"2013-01-24","text":"If another player gains control of either Dying Wish or the enchanted creature (but not both), Dying Wish will be enchanting an illegal permanent. The Aura will be put into its owner’s graveyard as a state-based action."}],"imageName":"dying wish"},{"layout":"normal","type":"Creature - Fish Mutant","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366279,"name":"Elusive Krasis","subtypes":["Fish","Mutant"],"cmc":3,"rarity":"Uncommon","artist":"Wesley Burt","power":"0","toughness":"4","manaCost":"{1}{G}{U}","text":"Elusive Krasis is unblockable.\n\nEvolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","number":"160","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"elusive krasis"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Red"],"multiverseid":366306,"name":"Ember Beast","subtypes":["Beast"],"cmc":3,"rarity":"Common","artist":"David Rapoza","power":"3","toughness":"4","manaCost":"{2}{R}","text":"Ember Beast can't attack or block alone.","flavor":"The only livestock that will survive for long in the Smelting District, ember beasts serve many functions—none of them willingly.","number":"89","rulings":[{"date":"2013-01-24","text":"Ember Beast can’t attack or block unless another creature is also assigned to attack or block at the same time. Notably, two Ember Beasts can attack or block together."},{"date":"2013-01-24","text":"Once Ember Beast has been declared as an attacker or blocker, it doesn’t matter what happens to the other creature(s)."},{"date":"2013-01-24","text":"Other creatures assigned to attack alongside Ember Beast don’t have to attack the same player or planeswalker. Other creatures assigned to block alongside Ember Beast don’t have to block the same creature as Ember Beast."}],"imageName":"ember beast"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":366411,"name":"Enter the Infinite","cmc":12,"rarity":"Mythic Rare","artist":"Terese Nielsen","manaCost":"{8}{U}{U}{U}{U}","text":"Draw cards equal to the number of cards in your library, then put a card from your hand on top of your library. You have no maximum hand size until your next turn.","flavor":"\"Don't just have an idea—have all of them.\"\r\n\n—Niv-Mizzet","number":"34","rulings":[{"date":"2013-01-24","text":"You won’t have to discard any card during the cleanup step of the turn you cast Enter the Infinite. You will have to discard down to your maximum hand size during the cleanup step of your next turn."},{"date":"2013-01-24","text":"If you are playing with the top card of your library revealed (due to Garruk’s Horde, for example), you’ll reveal each card before you draw it."}],"imageName":"enter the infinite"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Black"],"multiverseid":366444,"name":"Executioner's Swing","cmc":2,"rarity":"Common","artist":"Karl Kopinski","manaCost":"{W}{B}","text":"Target creature that dealt damage this turn gets -5/-5 until end of turn.","flavor":"\"The contract specified an appendage for a missed payment. Read the fine print: the head is an appendage.\"","number":"161","imageName":"executioner's swing"},{"layout":"normal","type":"Creature - Human Ooze","types":["Creature"],"colors":["Green"],"multiverseid":366441,"name":"Experiment One","subtypes":["Human","Ooze"],"cmc":1,"rarity":"Uncommon","artist":"Chase Stone","power":"1","toughness":"1","manaCost":"{G}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)\n\nRemove two +1/+1 counters from Experiment One: Regenerate Experiment One.","number":"119","rulings":[{"date":"2013-01-24","text":"If removing two +1/+1 counters from Experiment One causes the amount of damage already marked on Experiment One to be equal to or greater than its toughness, it will be put into its owner’s graveyard as a state-based action before the regeneration shield is created."},{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"experiment one"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366399,"name":"Fathom Mage","subtypes":["Human","Wizard"],"cmc":4,"rarity":"Rare","artist":"Ryan Pancoast","power":"1","toughness":"1","manaCost":"{2}{G}{U}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)\n\nWhenever a +1/+1 counter is placed on Fathom Mage, you may draw a card.","number":"162","rulings":[{"date":"2013-01-24","text":"Fathom Mage’s last ability will trigger whenever any +1/+1 counter is placed on it, not just ones due to the evolve ability."},{"date":"2013-01-24","text":"If multiple +1/+1 counters are placed on Fathom Mage simultaneously, its last ability will trigger once for each of those counters."},{"date":"2013-01-24","text":"If Fathom Mage enters the battlefield with a +1/+1 counter on it (perhaps due to Master Biomancer), its last ability will trigger once for each +1/+1 counter it entered the battlefield with."},{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"fathom mage"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["Red"],"multiverseid":366311,"name":"Firefist Striker","subtypes":["Human","Soldier"],"cmc":2,"rarity":"Uncommon","artist":"Tyler Jacobson","power":"2","toughness":"1","manaCost":"{1}{R}","text":"Battalion — Whenever Firefist Striker and at least two other creatures attack, target creature can't block this turn.","flavor":"The flaming fist of Boros holds the promise of both protection and destruction in its grasp.","number":"90","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"firefist striker"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White","Red"],"multiverseid":366341,"name":"Firemane Avenger","subtypes":["Angel"],"cmc":4,"rarity":"Rare","artist":"Wayne Reynolds","power":"3","toughness":"3","manaCost":"{2}{R}{W}","text":"Flying\n\nBattalion — Whenever Firemane Avenger and at least two other creatures attack, Firemane Avenger deals 3 damage to target creature or player and you gain 3 life.","flavor":"Firemane Nevena led the victorious assault on the Barbu Rooftop rebels. Now the Gateless have marked her for death.","number":"163","rulings":[{"date":"2013-01-24","text":"If the target creature or player is an illegal target when Firemane Avenger’s battalion ability tries to resolve, the ability will be countered and none of its effects will happen. You won’t gain life."},{"date":"2013-01-24","text":"If Firemane Avenger’s battalion ability resolves but some or all of the damage is prevented, you’ll still gain 3 life."},{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"firemane avenger"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":366386,"name":"Five-Alarm Fire","cmc":3,"rarity":"Rare","artist":"Karl Kopinski","manaCost":"{1}{R}{R}","text":"Whenever a creature you control deals combat damage, put a blaze counter on Five-Alarm Fire.\n\nRemove five blaze counters from Five-Alarm Fire: Five-Alarm Fire deals 5 damage to target creature or player.","number":"91","rulings":[{"date":"2013-01-24","text":"Five-Alarm Fire’s first ability triggers once for each time a creature you control deals combat damage, even if it deals combat damage to more than one creature, planeswalker, or player. For example, an attacking creature with trample that deals combat damage to a blocking creature and the defending player will cause Five-Alarm Fire’s ability to trigger once. A creature with double strike, however, may cause Five-Alarm Fire’s ability to trigger twice during a single combat."}],"imageName":"five-alarm fire"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":366336,"name":"Forced Adaptation","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Trevor Claxton","manaCost":"{G}","text":"Enchant creature\n\nAt the beginning of your upkeep, put a +1/+1 counter on enchanted creature.","flavor":"\"We're planting the seeds of change. Sometimes, we plant them in people.\"\r\n\n—Vorel of the Hull Clade","number":"120","rulings":[{"date":"2013-01-24","text":"The creature that gets the +1/+1 counter is the creature enchanted by Forced Adaptation when the ability resolves."},{"date":"2013-01-24","text":"If Forced Adaptation’s ability triggers but Forced Adaptation isn’t on the battlefield when the ability resolves, put a +1/+1 counter on the creature it was enchanting when it left the battlefield."}],"imageName":"forced adaptation"},{"layout":"normal","type":"Creature - Cyclops Soldier","types":["Creature"],"colors":["White","Red"],"multiverseid":366280,"name":"Fortress Cyclops","subtypes":["Cyclops","Soldier"],"cmc":5,"rarity":"Uncommon","artist":"Maciej Kuciara","power":"3","toughness":"3","manaCost":"{3}{R}{W}","text":"Whenever Fortress Cyclops attacks, it gets +3/+0 until end of turn.\n\nWhenever Fortress Cyclops blocks, it gets +0/+3 until end of turn.","flavor":"\"They think they tamed him, but he will always be a wild titan, a force of nature.\"\r\n\n—Nedja, Gruul shaman","number":"164","imageName":"fortress cyclops"},{"layout":"normal","type":"Creature - Elemental Soldier","types":["Creature"],"colors":["White","Red"],"multiverseid":366431,"name":"Foundry Champion","subtypes":["Elemental","Soldier"],"cmc":6,"rarity":"Rare","artist":"Todd Lockwood","power":"4","toughness":"4","manaCost":"{4}{R}{W}","text":"When Foundry Champion enters the battlefield, it deals damage to target creature or player equal to the number of creatures you control.\n\n{R}: Foundry Champion gets +1/+0 until end of turn.\n\n{W}: Foundry Champion gets +0/+1 until end of turn.","number":"165","rulings":[{"date":"2013-01-24","text":"The number of creatures you control is counted when Foundry Champion’s triggered ability resolves. Foundry Champion will count itself if it’s still on the battlefield under your control at that time."}],"imageName":"foundry champion"},{"layout":"normal","type":"Creature - Goblin Warrior","types":["Creature"],"colors":["Red"],"multiverseid":366472,"name":"Foundry Street Denizen","subtypes":["Goblin","Warrior"],"cmc":1,"rarity":"Common","artist":"Raoul Vitale","power":"1","toughness":"1","manaCost":"{R}","text":"Whenever another red creature enters the battlefield under your control, Foundry Street Denizen gets +1/+0 until end of turn.","flavor":"After the Foundry Street riot, Arrester Hulbein tried to ban bludgeons. Which, inevitably, resulted in another riot.","number":"92","imageName":"foundry street denizen"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red","Green"],"multiverseid":366295,"name":"Frenzied Tilling","cmc":5,"rarity":"Uncommon","artist":"Noah Bradley","manaCost":"{3}{R}{G}","text":"Destroy target land. Search your library for a basic land card and put that card onto the battlefield tapped. Then shuffle your library.","flavor":"\"Izzet contraptions pollute our lands. Burn them down, kill the makers, cleanse the earth.\"\r\n\n—Nedja, Gruul shaman","number":"166","rulings":[{"date":"2004-10-04","text":"Because the \"search\" requires you to find a card with certain characteristics, you don't have to find the card if you don't want to."},{"date":"2013-01-24","text":"If the target land is an illegal target when Frenzied Tilling tries to resolve, the spell will be countered and none of its effects will happen. You won’t search your library for a basic land card."}],"imageName":"frenzied tilling"},{"layout":"normal","type":"Creature - Homunculus","types":["Creature"],"colors":["Blue"],"multiverseid":366298,"name":"Frilled Oculus","subtypes":["Homunculus"],"cmc":2,"rarity":"Common","artist":"Marco Nelor","power":"1","toughness":"3","manaCost":"{1}{U}","text":"{1}{G}: Frilled Oculus gets +2/+2 until end of turn. Activate this ability only once each turn.","flavor":"\"Understand the Simic? That's about as easy as winning a staring contest with a homunculus.\"\r\n\n—Dars Gostok, Firefist captain","number":"35","imageName":"frilled oculus"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White"],"multiverseid":366460,"name":"Frontline Medic","subtypes":["Human","Cleric"],"cmc":3,"rarity":"Rare","artist":"Willian Murai","power":"3","toughness":"3","manaCost":"{2}{W}","text":"Battalion — Whenever Frontline Medic and at least two other creatures attack, creatures you control are indestructible this turn.\n\nSacrifice Frontline Medic: Counter target spell with {X} in its mana cost unless its controller pays {3}.","number":"12","rulings":[{"date":"2013-01-24","text":"Creatures that come under your control after Frontline Medic’s battalion ability resolves will also be indestructible that turn."},{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"frontline medic"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":366309,"name":"Furious Resistance","cmc":1,"rarity":"Common","artist":"Slawomir Maniak","manaCost":"{R}","text":"Target blocking creature gets +3/+0 and gains first strike until end of turn.","flavor":"\"At least the Gateless rebels have ideals. Rakdos just mocks, defiles, and kills all we hold dear.\"\r\n\n—Libuse, Boros sergeant","number":"93","imageName":"furious resistance"},{"layout":"normal","type":"Creature - Shade","types":["Creature"],"colors":["Black"],"multiverseid":366438,"name":"Gateway Shade","subtypes":["Shade"],"cmc":3,"rarity":"Uncommon","artist":"Ryan Yee","power":"1","toughness":"1","manaCost":"{2}{B}","text":"{B}: Gateway Shade gets +1/+1 until end of turn.\n\nTap an untapped Gate you control: Gateway Shade gets +2/+2 until end of turn.","flavor":"Tireless and merciless, shades are harnessed as spies by the Dimir.","number":"65","rulings":[{"date":"2013-01-24","text":"You can’t tap an untapped Gate you control for mana and tap it to activate Gateway Shade’s ability at the same time. You must choose one or the other."}],"imageName":"gateway shade"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Red","Green"],"multiverseid":366287,"name":"Ghor-Clan Rampager","subtypes":["Beast"],"cmc":4,"rarity":"Uncommon","artist":"Charles Urbach","power":"4","toughness":"4","manaCost":"{2}{R}{G}","text":"Trample\n\nBloodrush — {R}{G}, Discard Ghor-Clan Rampager: Target attacking creature gets +4/+4 and gains trample until end of turn.","flavor":"\"The Simic come from the cold slow depths. How could they understand the fire in a wild heart?\"\r\n\n—Kroshkar, Gruul shaman","number":"167","imageName":"ghor-clan rampager"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["Green"],"multiverseid":366394,"name":"Giant Adephage","subtypes":["Insect"],"cmc":7,"rarity":"Mythic Rare","artist":"Christine Choi","power":"7","toughness":"7","manaCost":"{5}{G}{G}","text":"Trample\n\nWhenever Giant Adephage deals combat damage to a player, put a token onto the battlefield that's a copy of Giant Adephage.","flavor":"\"To a creature like that, we must seem like, well, bugs.\"\r\n\n—Dars Gostok, Firefist captain","number":"121","rulings":[{"date":"2013-01-24","text":"As the token is created, it checks the printed values of the Giant Adephage it’s copying—or, if the Giant Adephage whose ability triggered was itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield—as well as any copy effects that have been applied to it. It won’t copy counters on the Giant Adephage, nor will it copy other effects that have changed Giant Adephage’s power, toughness, types, color, or so on. Normally, this means the token will simply be a Giant Adephage. But if any copy effects have affected that Giant Adephage, they’re taken into account."}],"imageName":"giant adephage"},{"layout":"normal","type":"Planeswalker - Gideon","types":["Planeswalker"],"colors":["White"],"multiverseid":366345,"name":"Gideon, Champion of Justice","subtypes":["Gideon"],"cmc":4,"rarity":"Mythic Rare","artist":"David Rapoza","loyalty":4,"manaCost":"{2}{W}{W}","text":"+1: Put a loyalty counter on Gideon, Champion of Justice for each creature target opponent controls.\n\n0: Until end of turn, Gideon, Champion of Justice becomes an indestructible Human Soldier creature with power and toughness each equal to the number of loyalty counters on him. He's still a planeswalker. Prevent all damage that would be dealt to him this turn.\n\n-15: Exile all other permanents.","number":"13","rulings":[{"date":"2013-01-24","text":"You put a loyalty counter on Gideon, Champion of Justice as part of the cost of activating the first ability. When that ability resolves, you count the number of creatures controlled by the target opponent and put that many additional loyalty counters on Gideon."},{"date":"2013-01-24","text":"If the first ability is countered (perhaps because the target opponent is an illegal target when the ability tries to resolve), you won’t put any additional loyalty counters on Gideon, although the loyalty counter you put on him to activate the ability will remain."},{"date":"2013-01-24","text":"If Gideon, Champion of Justice becomes a creature due to his second ability, that doesn’t count as having a creature enter the battlefield. Gideon was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."},{"date":"2013-01-24","text":"Gideon, Champion of Justice’s power and toughness are set to the number of loyalty counters on him when his second ability resolves. They won’t change later in the turn if the number of loyalty counters on him changes."},{"date":"2013-01-24","text":"If Gideon, Champion of Justice becomes a creature the same turn he enters the battlefield, you can’t attack with him or use any of his {T} abilities (if he gains any)."},{"date":"2013-01-24","text":"If damage that can’t be prevented is dealt to Gideon, Champion of Justice after his second ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). Even though he’s indestructible, if Gideon, Champion of Justice has no loyalty counters on him, he’s put into his owner’s graveyard as a state-based action."},{"date":"2013-01-24","text":"Gideon, Champion of Justice’s second ability causes him to become a creature with the creature types Human and Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."},{"date":"2013-01-24","text":"If you activate Gideon, Champion of Justice’s second ability and then a creature enters the battlefield as a copy of him, that copy will be just a planeswalker, not a creature. (The effect of Gideon’s second ability isn’t copied, just as the effect of a Giant Growth, for example, wouldn’t be copied.) Since both permanents will be planeswalkers with the planeswalker type Gideon, each one will be put into his owner’s graveyard as a state-based action due to the “planeswalker uniqueness rule.”"},{"date":"2013-01-24","text":"If you activate Gideon, Champion of Justice’s second ability and then a permanent that’s already on the battlefield becomes a copy of him, that copy will be just a planeswalker, not a creature. If the first Gideon, Champion of Justice is still on the battlefield by the time the copy effect happens, each of those permanents will be put into his owner’s graveyard as a state-based action due to the “planeswalker uniqueness rule.” If the first Gideon, Champion of Justice is gone by this time, the other permanent will be put into his owner’s graveyard as a state-based action for having no loyalty counters on him (unless, for some odd reason, he already had loyalty counters on him)."},{"date":"2013-01-24","text":"Say you activate Gideon, Champion of Justice’s second ability, and then an opponent gains control of him before combat. You may have any of your creatures attack Gideon, Champion of Justice (since he’s still a planeswalker). Then Gideon, Champion of Justice may block (since he’s a creature). He may block any eligible attacking creature, including one that’s attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he’s blocking, but he doesn’t deal combat damage to any unblocked creatures that are attacking him."}],"imageName":"gideon, champion of justice"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White","Black"],"multiverseid":366339,"name":"Gift of Orzhova","subtypes":["Aura"],"cmc":3,"rarity":"Uncommon","artist":"Johannes Voss","manaCost":"{1}{W/B}{W/B}","text":"Enchant creature\n\nEnchanted creature gets +1/+1 and has flying and lifelink.","flavor":"\"Remember by whose gift you ascend.\"\r\n\n—Milana, Orzhov prelate","number":"219","imageName":"gift of orzhova"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366334,"name":"Glaring Spotlight","cmc":1,"rarity":"Rare","artist":"Adam Paquette","manaCost":"{1}","text":"Creatures your opponents control with hexproof can be the targets of spells and abilities you control as though they didn't have hexproof.\n\n{3}, Sacrifice Glaring Spotlight: Creatures you control gain hexproof until end of turn and are unblockable this turn.","number":"229","rulings":[{"date":"2013-01-24","text":"Creatures your opponents control don’t actually lose hexproof, although you will ignore hexproof for purposes of choosing targets of spells and abilities you control."},{"date":"2013-01-24","text":"Creatures that come under your control after Glaring Spotlight’s last ability resolves won’t have hexproof but will be unblockable that turn."}],"imageName":"glaring spotlight"},{"layout":"normal","type":"Land - Plains Swamp","types":["Land"],"colors":[],"multiverseid":366302,"name":"Godless Shrine","subtypes":["Plains","Swamp"],"rarity":"Rare","artist":"Cliff Childs","text":"({T}: Add {W} or {B} to your mana pool.)\n\nAs Godless Shrine enters the battlefield, you may pay 2 life. If you don't, Godless Shrine enters the battlefield tapped.","flavor":"Judgment without hope.","number":"242","rulings":[{"date":"2005-10-01","text":"Has basic land types, but isn't a basic land.  Things that affect basic lands don't affect it.  For example, you can't find it with Civic Wayfinder."},{"date":"2005-10-01","text":"If another effect (such as Loxodon Gatekeeper's ability) tells you to put lands onto the battlefield tapped, it enters the battlefield tapped whether you pay 2 life or not."},{"date":"2005-10-01","text":"If multiple permanents with \"as enters the battlefield\" effects are entering the battlefield at the same time, process those effects one at a time, then put the permanents onto the battlefield all at once. For example, if you're at 3 life and an effect puts two of these onto the battlefield, you can pay 2 life for only one of them, not both."}],"imageName":"godless shrine"},{"layout":"normal","type":"Creature - Elf Druid","types":["Creature"],"colors":["Green"],"multiverseid":366440,"name":"Greenside Watcher","subtypes":["Elf","Druid"],"cmc":2,"rarity":"Common","artist":"Ryan Barger","power":"2","toughness":"1","manaCost":"{1}{G}","text":"{T}: Untap target Gate.","flavor":"\"The Izzet may incite war, but my duty is here. I will not abandon the wild.\"","number":"122","rulings":[{"date":"2013-01-24","text":"Greenside Watcher’s ability is not a mana ability. It uses the stack and can be responded to."}],"imageName":"greenside watcher"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366330,"name":"Gridlock","cmc":1,"rarity":"Uncommon","artist":"Yeong-Hao Han","manaCost":"{X}{U}","text":"Tap X target nonland permanents.","flavor":"\"One tiny peg pulled from a single wagon wheel, and an entire district grinds to a halt.\"\r\n\n—Lazav","number":"36","imageName":"gridlock"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":366396,"name":"Grisly Spectacle","cmc":4,"rarity":"Common","artist":"Zoltan Boros","manaCost":"{2}{B}{B}","text":"Destroy target nonartifact creature. Its controller puts a number of cards equal to that creature's power from the top of his or her library into his or her graveyard.","flavor":"\"Watch people flock to a murder scene. Then tell me we're not all a little sick in the head.\"\r\n\n—Juri, proprietor of the Juri Revue","number":"66","rulings":[{"date":"2013-01-24","text":"Use the creature’s power the last time it was on the battlefield to determine how many cards its controller puts into his or her graveyard."},{"date":"2013-01-24","text":"If the creature is an illegal target when Grisly Spectacle tries to resolve, it will be countered and none of its effects will happen. The creature’s controller won’t put any cards into his or her graveyard."}],"imageName":"grisly spectacle"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red","Green"],"multiverseid":366428,"name":"Ground Assault","cmc":2,"rarity":"Uncommon","artist":"Karl Kopinski","manaCost":"{R}{G}","text":"Ground Assault deals damage to target creature equal to the number of lands you control.","flavor":"\"Taking down a dragon is easy. All you need is enough space to get in a good swing.\"\r\n\n—Narbulg Nine Fingers","number":"168","imageName":"ground assault"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red","Green"],"multiverseid":366360,"name":"Gruul Charm","cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{R}{G}","text":"Choose one — Creatures without flying can't block this turn; or gain control of all permanents you own; or Gruul Charm deals 3 damage to each creature with flying.","flavor":"\"Not Gruul? Then die!\"\r\n\n—Borborygmos","number":"169","rulings":[{"date":"2013-01-24","text":"If you choose the first mode, no creature without flying will be able to block that turn, including creatures that lose flying and creatures without flying that enter the battlefield after Gruul Charm resolves."},{"date":"2013-01-24","text":"If you choose the second mode, Gruul Charm’s effect will override any other control-changing effects on those permanents."},{"date":"2013-01-24","text":"A token is owned by the player under whose control it entered the battlefield."}],"imageName":"gruul charm"},{"layout":"normal","type":"Land - Gate","types":["Land"],"colors":[],"multiverseid":366253,"name":"Gruul Guildgate","subtypes":["Gate"],"rarity":"Common","artist":"Randy Gallegos","text":"Gruul Guildgate enters the battlefield tapped.\n\n{T}: Add {R} or {G} to your mana pool.","flavor":"Enter and leave the shackles of society behind.","number":"243","rulings":[{"date":"2013-04-15","text":"The subtype Gate has no special rules significance, but other spells and abilities may refer to it."},{"date":"2013-04-15","text":"Gate is not a basic land type."}],"imageName":"gruul guildgate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366443,"name":"Gruul Keyrune","cmc":3,"rarity":"Uncommon","artist":"Daniel Ljunggren","manaCost":"{3}","text":"{T}: Add {R} or {G} to your mana pool.\n\n{R}{G}: Gruul Keyrune becomes a 3/2 red and green Beast artifact creature with trample until end of turn.","flavor":"As perilous and unpredictable as the wilds themselves.","number":"230","rulings":[{"date":"2013-04-15","text":"Until the ability that turns the Keyrune into a creature resolves, the Keyrune is colorless."},{"date":"2013-04-15","text":"Activating the ability that turns the Keyrune into a creature while it’s already a creature will override any effects that set its power and/or toughness to another number, but effects that modify power and/or toughness without directly setting them will still apply."}],"imageName":"gruul keyrune"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Red","Green"],"multiverseid":366398,"name":"Gruul Ragebeast","subtypes":["Beast"],"cmc":7,"rarity":"Rare","artist":"Dave Kendall","power":"6","toughness":"6","manaCost":"{5}{R}{G}","text":"Whenever Gruul Ragebeast or another creature enters the battlefield under your control, that creature fights target creature an opponent controls.","flavor":"\"If the other guilds want a war, they should know we've been ready the whole time.\"\r\n\n—Ruric Thar, Ghor-Clan chieftain","number":"170","rulings":[{"date":"2013-01-24","text":"Gruul Ragebeast’s triggered ability isn’t optional. However, if no opponent controls a creature when a creature enters the battlefield under your control, the ability will be removed from the stack."},{"date":"2013-01-24","text":"If one or both of the creatures that are supposed to fight are no longer on the battlefield when the ability resolves, the fight won’t happen. Neither creature will deal or be dealt damage."},{"date":"2013-01-24","text":"If the target creature is an illegal target when the ability tries to resolve, it will be countered and none of its effects will happen. Neither creature will deal or be dealt damage."}],"imageName":"gruul ragebeast"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":366260,"name":"Guardian of the Gateless","subtypes":["Angel"],"cmc":5,"rarity":"Uncommon","artist":"Wesley Burt","power":"3","toughness":"3","manaCost":"{4}{W}","text":"Flying\n\nGuardian of the Gateless can block any number of creatures.\n\nWhenever Guardian of the Gateless blocks, it gets +1/+1 until end of turn for each creature it's blocking.","number":"14","rulings":[{"date":"2013-01-24","text":"Guardian of the Gateless’s last ability triggers only once when it’s declared as a blocker no matter how many creatures it’s blocking."}],"imageName":"guardian of the gateless"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":366392,"name":"Guildscorn Ward","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Ryan Barger","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature has protection from multicolored.","flavor":"\"The Gateless have risen. The Ten shall fall.\"\r\n\n—Ninth District graffiti","number":"15","rulings":[{"date":"2013-01-24","text":"The enchanted creature can’t be enchanted or equipped by multicolored Auras and Equipment, it can’t be blocked by multicolored creatures, it can’t be targeted by multicolored spells or abilities from multicolored sources, and all damage dealt to it by multicolored sources is prevented."},{"date":"2013-01-24","text":"Hybrid spells and permanents in the Return to Ravnica block are multicolored, even if you cast them with one color of mana."}],"imageName":"guildscorn ward"},{"layout":"normal","type":"Creature - Zombie Rat","types":["Creature"],"colors":["Black"],"multiverseid":366234,"name":"Gutter Skulk","subtypes":["Zombie","Rat"],"cmc":2,"rarity":"Common","artist":"Mark Winters","power":"2","toughness":"2","manaCost":"{1}{B}","flavor":"Upon finding his warehouse infested, Gaven didn't know whether to get an exterminator or an exorcist.","number":"67","imageName":"gutter skulk"},{"layout":"normal","type":"Creature - Elf Druid","types":["Creature"],"colors":["Green"],"multiverseid":366289,"name":"Gyre Sage","subtypes":["Elf","Druid"],"cmc":2,"rarity":"Rare","artist":"Tyler Jacobson","power":"1","toughness":"2","manaCost":"{1}{G}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)\n\n{T}: Add {G} to your mana pool for each +1/+1 counter on Gyre Sage.","number":"123","rulings":[{"date":"2013-01-24","text":"Gyre Sage’s last ability is a mana ability. It doesn’t use the stack and can’t be responded to."},{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"gyre sage"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":366445,"name":"Hands of Binding","cmc":2,"rarity":"Common","artist":"Raymond Swanland","manaCost":"{1}{U}","text":"Tap target creature an opponent controls. That creature doesn't untap during its controller's next untap step.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"37","rulings":[{"date":"2013-01-24","text":"If the creature that was tapped by Hands of Binding is untapped during its controller’s next untap step (perhaps because a spell untapped it), Hands of Binding has no effect at that time. It won’t apply at some later time when the creature is tapped."},{"date":"2013-01-24","text":"If a different player gains control of the creature that was tapped by Hands of Binding, Hands of Binding will stop that creature from untapping during its new controller’s next untap step."},{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."},{"date":"2013-04-15","text":"This spell can target tapped creatures. If a targeted creature is already tapped when the spell resolves, that creature just remains tapped and doesn't untap during its controller's next untap step."}],"imageName":"hands of binding"},{"layout":"normal","type":"Creature - Dragon","types":["Creature"],"colors":["Red"],"multiverseid":366244,"name":"Hellkite Tyrant","subtypes":["Dragon"],"cmc":6,"rarity":"Mythic Rare","artist":"Aleksi Briclot","power":"6","toughness":"5","manaCost":"{4}{R}{R}","text":"Flying, trample\n\nWhenever Hellkite Tyrant deals combat damage to a player, gain control of all artifacts that player controls.\n\nAt the beginning of your upkeep, if you control twenty or more artifacts, you win the game.","number":"94","rulings":[{"date":"2013-01-24","text":"If you don’t control twenty or more artifacts at the beginning of your upkeep, Hellkite Tyrant’s last ability won’t trigger. If it does trigger, it will check again when it tries to resolve. If you don’t control twenty or more artifacts at that time, the ability will do nothing."}],"imageName":"hellkite tyrant"},{"layout":"normal","type":"Creature - Goblin Berserker","types":["Creature"],"colors":["Red"],"multiverseid":366342,"name":"Hellraiser Goblin","subtypes":["Goblin","Berserker"],"cmc":3,"rarity":"Uncommon","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{2}{R}","text":"Creatures you control have haste and attack each combat if able.","flavor":"Don't let him lead the soldiers, but by all means let him lead the way.","number":"95","rulings":[{"date":"2013-01-24","text":"Hellraiser Goblin’s ability also affects itself. If it enters the battlefield before combat, it will have to attack that combat if able."},{"date":"2013-01-24","text":"If, during your declare attackers step, a creature you control is tapped or is affected by a spell or ability that says it can’t attack, then it doesn’t attack. If there’s a cost associated with having a creature attack, you aren’t forced to pay that cost, so it doesn’t have to attack in that case either."},{"date":"2013-01-24","text":"Unlike many other effects that force a creature to attack if able, Hellraiser Goblin’s ability applies during each combat. If a turn has multiple combat phases, creatures you control must attack in each of them if able."}],"imageName":"hellraiser goblin"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White","Black"],"multiverseid":366266,"name":"High Priest of Penance","subtypes":["Human","Cleric"],"cmc":2,"rarity":"Rare","artist":"Mark Zug","power":"1","toughness":"1","manaCost":"{W}{B}","text":"Whenever High Priest of Penance is dealt damage, you may destroy target nonland permanent.","flavor":"\"All I require is faith, loyalty, obedience, trust, and complete and utter devotion.\"","number":"171","rulings":[{"date":"2013-01-24","text":"High Priest of Penance’s ability triggers once for each instance of damage dealt to it, not once for each 1 damage. The ability will trigger even if High Priest of Penance is dealt lethal damage."}],"imageName":"high priest of penance"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366459,"name":"Hindervines","cmc":3,"rarity":"Uncommon","artist":"Svetlin Velinov","manaCost":"{2}{G}","text":"Prevent all combat damage that would be dealt this turn by creatures with no +1/+1 counters on them.","flavor":"\"Woodlands and laws. Both grow faster than the Azorius's ability to manage them.\"\r\n\n—Suniel the Woodwise","number":"124","rulings":[{"date":"2013-01-24","text":"Hindervines checks whether a creature has a +1/+1 counter on it at the moment it deals damage. It doesn’t matter whether a creature had a +1/+1 counter, or was even on the battlefield, when Hindervines resolved."}],"imageName":"hindervines"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":366276,"name":"Hold the Gates","cmc":3,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{2}{W}","text":"Creatures you control get +0/+1 for each Gate you control and have vigilance.","flavor":"\"We grew up on these streets. We know them better than any Boros grunt from Zelzo.\"","number":"16","rulings":[{"date":"2013-01-24","text":"Creatures you control will have vigilance even if you control no Gates."}],"imageName":"hold the gates"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":366368,"name":"Holy Mantle","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Maciej Kuciara","manaCost":"{2}{W}{W}","text":"Enchant creature\n\nEnchanted creature gets +2/+2 and has protection from creatures.","flavor":"\"The guilds promise to provide safety. I prefer to make my own.\"\r\n\n—Briska, Ninth District freemage","number":"17","rulings":[{"date":"2013-01-24","text":"The enchanted creature can’t be blocked, it can’t be targeted by abilities of creatures or creature cards (like, notably, the scavenge ability), and all damage dealt to it by creatures or creature cards is prevented."}],"imageName":"holy mantle"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":366297,"name":"Homing Lightning","cmc":4,"rarity":"Uncommon","artist":"Slawomir Maniak","manaCost":"{2}{R}{R}","text":"Homing Lightning deals 4 damage to target creature and each other creature with the same name as that creature.","flavor":"\"I see countless worlds. What makes them think I can't find them in just one?\"\r\n\n—Ral Zarek","number":"96","rulings":[{"date":"2013-01-24","text":"Homing Lightning has only one target. Other creatures with that name are not targeted. For example, a creature with hexproof will be dealt damage if it has the same name as the target creature."},{"date":"2013-01-24","text":"The name of a creature token is the same as its creature types unless the token is a copy of another creature or the effect that created the token specifically gives it a different name. For example, a 1/1 Soldier creature token is named “Soldier.”"}],"imageName":"homing lightning"},{"layout":"normal","type":"Creature - Horror","types":["Creature"],"colors":["Black"],"multiverseid":366397,"name":"Horror of the Dim","subtypes":["Horror"],"cmc":5,"rarity":"Common","artist":"Jack Wang","power":"3","toughness":"4","manaCost":"{4}{B}","text":"{U}: Horror of the Dim gains hexproof until end of turn. (It can't be the target of spells or abilities your opponents control.)","flavor":"\"Lesser minds can scarcely imagine such a marriage of necromancy and mind magic.\"\r\n\n—Strava, Dimir mage","number":"68","imageName":"horror of the dim"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Green"],"multiverseid":366423,"name":"Hydroform","cmc":2,"rarity":"Common","artist":"Howard Lyon","manaCost":"{G}{U}","text":"Target land becomes a 3/3 Elemental creature with flying until end of turn. It's still a land.","flavor":"\"While the sea may be our home, the sky is our destiny.\"\r\n\n—Prime Speaker Zegana","number":"172","rulings":[{"date":"2013-01-24","text":"If the target land hasn’t been under its controller’s control continuously since the beginning of his or her most recent turn, that land won’t be able to attack and its {T} abilities won’t be able to be activated. In most cases, that means it will no longer be able to be tapped for mana that turn."},{"date":"2013-01-24","text":"Hydroform doesn’t affect the land’s name or any other types, subtypes, or supertypes (such as basic or legendary) the land may have. The land will also keep any abilities it had."},{"date":"2013-01-24","text":"Effects that modify power and/or toughness but don’t set them to a specific value (like the one created by Giant Growth), power/toughness changes from counters, and effects that switch a creature’s power and toughness will continue to apply. This may happen if the land was already a creature when Hydroform resolved."}],"imageName":"hydroform"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":366354,"name":"Illness in the Ranks","cmc":1,"rarity":"Uncommon","artist":"Nils Hamm","manaCost":"{B}","text":"Creature tokens get -1/-1.","flavor":"\"Selesnya denied us tribute. Let's show them the error of their ways.\"\r\n\n—Milana, Orzhov prelate","number":"69","rulings":[{"date":"2013-01-24","text":"If an effect creates a creature token that normally has toughness 1, it will enter the battlefield with toughness 0, be put into its owner’s graveyard as a state-based action, and then cease to exist. Any abilities that trigger when a creature enters the battlefield or dies will trigger."}],"imageName":"illness in the ranks"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":366426,"name":"Illusionist's Bracers","subtypes":["Equipment"],"cmc":2,"rarity":"Rare","artist":"Svetlin Velinov","manaCost":"{2}","text":"Whenever an ability of equipped creature is activated, if it isn't a mana ability, copy that ability. You may choose new targets for the copy.\n\nEquip {3}","flavor":"It's easy to believe you're a god when you're twice as powerful as everyone else.","number":"231","rulings":[{"date":"2013-04-15","text":"A mana ability is an ability that doesn't target and could put mana into a player's mana pool when it resolves."},{"date":"2013-04-15","text":"A mana ability is an ability that (1) isn't a loyalty ability, (2) doesn't target, and (3) could put mana into a player's mana pool when it resolves."}],"imageName":"illusionist's bracers"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White","Black"],"multiverseid":366247,"name":"Immortal Servitude","cmc":3,"rarity":"Rare","artist":"Seb McKinnon","manaCost":"{X}{W/B}{W/B}{W/B}","text":"Return each creature card with converted mana cost X from your graveyard to the battlefield.","flavor":"\"The fine print of countless contracts has ensured we are never defenseless.\"\r\n\n—Teysa Karlov, Grand Envoy of Orzhov","number":"220","rulings":[{"date":"2013-01-24","text":"If a creature card in a graveyard has X in its mana cost, that X is considered to be 0."}],"imageName":"immortal servitude"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":366301,"name":"Incursion Specialist","subtypes":["Human","Wizard"],"cmc":2,"rarity":"Uncommon","artist":"Svetlin Velinov","power":"1","toughness":"3","manaCost":"{1}{U}","text":"Whenever you cast your second spell each turn, Incursion Specialist gets +2/+0 until end of turn and is unblockable this turn.","flavor":"\"Work for the Dimir again? That depends. Tell me more about this maze.\"","number":"38","rulings":[{"date":"2013-01-24","text":"Incursion Specialist’s ability can trigger only once each turn. The ability will resolve before the second spell resolves. It doesn’t matter if the first spell you cast that turn has resolved, was countered, or is still on the stack."}],"imageName":"incursion specialist"},{"layout":"normal","type":"Creature - Elf Warrior","types":["Creature"],"colors":["Green"],"multiverseid":366317,"name":"Ivy Lane Denizen","subtypes":["Elf","Warrior"],"cmc":4,"rarity":"Common","artist":"Winona Nelson","power":"2","toughness":"3","manaCost":"{3}{G}","text":"Whenever another green creature enters the battlefield under your control, put a +1/+1 counter on target creature.","flavor":"\"Skyknight gear? Well, I have drake-skin gauntlets, supple and fireproof. Or a ceratok chestplate that'll stop a crossbow bolt.\"","number":"125","rulings":[{"date":"2013-01-24","text":"The green creature that entered the battlefield can be chosen as the target of Ivy Lane Denizen’s ability."},{"date":"2013-01-24","text":"Ivy Lane Denizen can be chosen as the target of its own ability."}],"imageName":"ivy lane denizen"},{"layout":"normal","type":"Creature - Human Rogue","types":["Creature"],"colors":["Blue"],"multiverseid":366380,"name":"Keymaster Rogue","subtypes":["Human","Rogue"],"cmc":4,"rarity":"Common","artist":"Winona Nelson","power":"3","toughness":"2","manaCost":"{3}{U}","text":"Keymaster Rogue is unblockable.\n\nWhen Keymaster Rogue enters the battlefield, return a creature you control to its owner's hand.","flavor":"\"This one opens the grate outside Zelzo Base. This one is for Ismeri Library. This one is for an invisible door . . . No, I've said too much.\"","number":"39","rulings":[{"date":"2013-01-24","text":"Keymaster Rogue’s last ability isn’t optional. If Keymaster Rogue is the only creature you control when the ability resolves, you’ll have to return it to its owner’s hand."}],"imageName":"keymaster rogue"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":366466,"name":"Killing Glare","cmc":1,"rarity":"Uncommon","artist":"Peter Mohrbacher","manaCost":"{X}{B}","text":"Destroy target creature with power X or less.","flavor":"A casual glance into a dark corner may be your last.","number":"70","rulings":[{"date":"2013-01-24","text":"The power of the target creature is checked both as you target it and as Killing Glare resolves. If its power is greater than the value chosen for X when Killing Glare tries to resolve, it will be countered and none of its effects will happen."}],"imageName":"killing glare"},{"layout":"normal","type":"Creature - Thrull","types":["Creature"],"colors":["White","Black"],"multiverseid":366361,"name":"Kingpin's Pet","subtypes":["Thrull"],"cmc":3,"rarity":"Common","artist":"Mark Zug","power":"2","toughness":"2","manaCost":"{1}{W}{B}","text":"Flying\n\nExtort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"\"Debt and death sound so similar, and thrulls are so hard of hearing. Mistakes are inevitable.\"\r\n\n—Milana, Orzhov prelate","number":"173","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"kingpin's pet"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White"],"multiverseid":366237,"name":"Knight of Obligation","subtypes":["Human","Knight"],"cmc":4,"rarity":"Uncommon","artist":"Ryan Barger","power":"2","toughness":"4","manaCost":"{3}{W}","text":"Vigilance\n\nExtort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"He can calculate interest to six decimal places even in the midst of a deadly duel.","number":"18","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"knight of obligation"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":366477,"name":"Knight Watch","cmc":5,"rarity":"Common","artist":"Matt Stewart","manaCost":"{4}{W}","text":"Put two 2/2 white Knight creature tokens with vigilance onto the battlefield.","flavor":"\"We lost respect after the battle for Barbu Rooftop. Send the troops to mingle respectfully with the citizens.\"\r\n\n—Commander Yaszen of Boros","number":"19","imageName":"knight watch"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":366407,"name":"Last Thoughts","cmc":4,"rarity":"Common","artist":"Peter Mohrbacher","manaCost":"{3}{U}","text":"Draw a card.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"40","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"last thoughts"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Shapeshifter","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366469,"name":"Lazav, Dimir Mastermind","subtypes":["Shapeshifter"],"cmc":4,"rarity":"Mythic Rare","artist":"David Rapoza","power":"3","toughness":"3","manaCost":"{U}{U}{B}{B}","text":"Hexproof\n\nWhenever a creature card is put into an opponent's graveyard from anywhere, you may have Lazav, Dimir Mastermind become a copy of that card except its name is still Lazav, Dimir Mastermind, it's legendary in addition to its other types, and it gains hexproof and this ability.","number":"174","rulings":[{"date":"2013-01-24","text":"Lazav, Dimir Mastermind becomes a copy of the creature card in the graveyard. If that card is no longer in the graveyard when Lazav’s ability resolves, use the characteristics of that card as it last existed in the graveyard. Notably, copy effects that applied to the creature card when it was on the battlefield won’t be copied by Lazav. For example, if a Clone is put into an opponent’s graveyard from the battlefield and you use Lazav’s ability, it will become 0/0. It won’t become a copy of whatever Clone was copying."},{"date":"2013-01-24","text":"Lazav doesn’t copy the creature card’s name and remains legendary, so if another Lazav is on the battlefield, both will be put into their owners’ graveyards as a state-based action, even if the first one is copying another creature card."},{"date":"2013-01-24","text":"If multiple creature cards are put into an opponent’s graveyard at the same time, you choose the order that Lazav’s triggered abilities go on the stack."},{"date":"2013-01-24","text":"Enters-the-battlefield abilities of the creature card Lazav is copying won’t trigger as Lazav is already on the battlefield when it becomes a copy of that creature card."},{"date":"2013-01-24","text":"Token creatures dying won’t cause Lazav’s triggered ability to trigger."}],"imageName":"lazav, dimir mastermind"},{"layout":"normal","type":"Creature - Goblin Soldier","types":["Creature"],"colors":["Red"],"multiverseid":366348,"name":"Legion Loyalist","subtypes":["Goblin","Soldier"],"cmc":1,"rarity":"Rare","artist":"Eric Deschamps","power":"1","toughness":"1","manaCost":"{R}","text":"Haste\n\nBattalion — Whenever Legion Loyalist and at least two other creatures attack, creatures you control gain first strike and trample until end of turn and can't be blocked by creature tokens this turn.","number":"97","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"legion loyalist"},{"layout":"normal","type":"Creature - Illusion","types":["Creature"],"colors":["Blue"],"multiverseid":366329,"name":"Leyline Phantom","subtypes":["Illusion"],"cmc":5,"rarity":"Common","artist":"Ryan Yee","power":"5","toughness":"5","manaCost":"{4}{U}","text":"When Leyline Phantom deals combat damage, return it to its owner's hand. (Return it only if it survived combat.)","flavor":"\"Is the maze itself a phantom? Or is one as real as the other? Perhaps I am as mad as the dragon.\"\r\n\n—Jace Beleren, journal","number":"41","imageName":"leyline phantom"},{"layout":"normal","type":"Creature - Demon","types":["Creature"],"colors":["Black"],"multiverseid":366412,"name":"Lord of the Void","subtypes":["Demon"],"cmc":7,"rarity":"Mythic Rare","artist":"Chris Rahn","power":"7","toughness":"7","manaCost":"{4}{B}{B}{B}","text":"Flying\n\nWhenever Lord of the Void deals combat damage to a player, exile the top seven cards of that player's library, then put a creature card from among them onto the battlefield under your control.","number":"71","rulings":[{"date":"2013-01-24","text":"Lord of the Void’s ability isn’t optional. If there is a creature card among the seven cards you exiled, you must put one onto the battlefield under your control."}],"imageName":"lord of the void"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["White"],"multiverseid":366240,"name":"Luminate Primordial","subtypes":["Avatar"],"cmc":7,"rarity":"Rare","artist":"Stephan Martiniere","power":"4","toughness":"7","manaCost":"{5}{W}{W}","text":"Vigilance\n\nWhen Luminate Primordial enters the battlefield, for each opponent, exile up to one target creature that player controls and that player gains life equal to its power.","number":"20","rulings":[{"date":"2013-01-24","text":"You can choose a number of targets up to the number of opponents you have, one target per opponent."},{"date":"2013-01-24","text":"To determine how much life each opponent gains, use the power of the creature that opponent controlled as it last existed on the battlefield."},{"date":"2013-01-24","text":"If some, but not all, of the targets become illegal, the controller(s) of the illegal target(s) will still gain life, even though the creature is not exiled."}],"imageName":"luminate primordial"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red"],"multiverseid":366377,"name":"Madcap Skills","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Anthony Palumbo","manaCost":"{1}{R}","text":"Enchant creature\n\nEnchanted creature gets +3/+0 and can't be blocked except by two or more creatures.","flavor":"The larger the crowd, the harder it is for them to run away.","number":"98","imageName":"madcap skills"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":366286,"name":"Mark for Death","cmc":4,"rarity":"Uncommon","artist":"Mathias Kollros","manaCost":"{3}{R}","text":"Target creature an opponent controls blocks this turn if able. Untap that creature. Other creatures that player controls can't block this turn.","flavor":"Everyone roots for the little guy, but nobody bets on him.","number":"99","rulings":[{"date":"2013-01-24","text":"That creature’s controller still decides which attacking creature it blocks."},{"date":"2013-01-24","text":"If the creature can’t block (perhaps because it has become tapped or it doesn’t have flying and all attacking creatures do), then the requirement to block does nothing."},{"date":"2013-01-24","text":"If there are any costs required for that creature to block (such as the one imposed by War Cadence), the creature’s controller isn’t required to pay those costs. In that case, the requirement to block would do nothing."}],"imageName":"mark for death"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Red"],"multiverseid":366358,"name":"Martial Glory","cmc":2,"rarity":"Common","artist":"Raymond Swanland","manaCost":"{R}{W}","text":"Target creature gets +3/+0 until end of turn.\n\nTarget creature gets +0/+3 until end of turn.","flavor":"\"Yes, Boros tactics are unparalleled. But when your comrades are dying around you, inner strength must carry the day.\"\r\n\n—Gideon Jura, to Aurelia","number":"175","rulings":[{"date":"2013-01-24","text":"You may choose the same creature for both targets since the card says “target creature” multiple times. You may also choose two different creatures."}],"imageName":"martial glory"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":366320,"name":"Massive Raid","cmc":3,"rarity":"Common","artist":"Zoltan Boros","manaCost":"{1}{R}{R}","text":"Massive Raid deals damage to target creature or player equal to the number of creatures you control.","flavor":"\"The Boros lack vision. Give them a convenient scapegoat and they'll be blind to the true threats.\"\r\n\n—Lazav","number":"100","rulings":[{"date":"2013-01-24","text":"Count the number of creatures you control when Massive Raid resolves to determine how much damage is dealt."}],"imageName":"massive raid"},{"layout":"normal","type":"Creature - Elf Wizard","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366352,"name":"Master Biomancer","subtypes":["Elf","Wizard"],"cmc":4,"rarity":"Mythic Rare","artist":"Willian Murai","power":"2","toughness":"4","manaCost":"{2}{G}{U}","text":"Each other creature you control enters the battlefield with a number of additional +1/+1 counters on it equal to Master Biomancer's power and as a Mutant in addition to its other types.","flavor":"\"Nature is a wonderful engineer but works far too slowly for my tastes.\"","number":"176","rulings":[{"date":"2013-01-24","text":"To determine how many additional +1/+1 counters a creature enters the battlefield with, use Master Biomancer’s power as that creature is entering the battlefield."},{"date":"2013-01-24","text":"The creature type Mutant becomes part of the creature’s copiable values."}],"imageName":"master biomancer"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":366373,"name":"Mental Vapors","cmc":4,"rarity":"Uncommon","artist":"Mark Winters","manaCost":"{3}{B}","text":"Target player discards a card.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"72","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"mental vapors"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White","Black"],"multiverseid":366316,"name":"Merciless Eviction","cmc":6,"rarity":"Rare","artist":"Richard Wright","manaCost":"{4}{W}{B}","text":"Choose one — Exile all artifacts; or exile all creatures; or exile all enchantments; or exile all planeswalkers.","flavor":"\"I once saw the Obzedat moved to action. Since that day, I've been thankful that they're mainly lazy, and dead.\"\r\n\n—Aurelia, to Gideon Jura","number":"177","rulings":[{"date":"2013-01-24","text":"You choose the mode as you cast the spell."}],"imageName":"merciless eviction"},{"layout":"normal","type":"Creature - Merfolk Soldier","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366442,"name":"Merfolk of the Depths","subtypes":["Merfolk","Soldier"],"cmc":6,"rarity":"Uncommon","artist":"Scott Chou","power":"4","toughness":"2","manaCost":"{4}{G/U}{G/U}","text":"Flash (You may cast this spell any time you could cast an instant.)","flavor":"When giant sinkholes opened across Ravnica, they revealed buried oceans and the merfolk, once thought to be extinct.","number":"221","imageName":"merfolk of the depths"},{"layout":"normal","type":"Creature - Faerie Rogue","types":["Creature"],"colors":["Blue"],"multiverseid":366293,"name":"Metropolis Sprite","subtypes":["Faerie","Rogue"],"cmc":2,"rarity":"Common","artist":"Scott Chou","power":"1","toughness":"2","manaCost":"{1}{U}","text":"Flying\n\n{U}: Metropolis Sprite gets +1/-1 until end of turn.","flavor":"\"Well, if that goblin didn't want his tongue pierced, he shouldn't have stuck it out at me.\"","number":"42","imageName":"metropolis sprite"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":366476,"name":"Midnight Recovery","cmc":4,"rarity":"Common","artist":"Peter Mohrbacher","manaCost":"{3}{B}","text":"Return target creature card from your graveyard to your hand.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"73","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"midnight recovery"},{"layout":"normal","type":"Artifact Creature - Gargoyle","types":["Artifact","Creature"],"colors":[],"multiverseid":366451,"name":"Millennial Gargoyle","subtypes":["Gargoyle"],"cmc":4,"rarity":"Common","artist":"Seb McKinnon","power":"2","toughness":"2","manaCost":"{4}","text":"Flying","flavor":"\"You've got to keep your wits about you on the roofs. Not all stones are compliant handholds.\"\r\n\n—Iveta, rooftop runner","number":"232","imageName":"millennial gargoyle"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":366340,"name":"Miming Slime","cmc":3,"rarity":"Uncommon","artist":"Svetlin Velinov","manaCost":"{2}{G}","text":"Put an X/X green Ooze creature token onto the battlefield, where X is the greatest power among creatures you control.","flavor":"\"We paid the Simic very well for this capability, but we should quickly recoup our expenses in saved wages.\"\r\n\n—Milana, Orzhov prelate","number":"126","rulings":[{"date":"2013-01-24","text":"The value of X is the greatest power among creatures you control when Miming Slime resolves. If you control no creatures at that time, X will be 0, creating a 0/0 Ooze token that will be put into your graveyard as a state-based action (unless something else is raising its toughness)."},{"date":"2013-01-24","text":"The power and toughness of the Ooze token is determined when Miming Slime resolves. It won’t change as the greatest power among creatures you control changes."}],"imageName":"miming slime"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Black"],"multiverseid":366418,"name":"Mind Grind","cmc":2,"rarity":"Rare","artist":"Daarken","manaCost":"{X}{U}{B}","text":"Each opponent reveals cards from the top of his or her library until he or she reveals X land cards, then puts all cards revealed this way into his or her graveyard. X can't be 0.","number":"178","rulings":[{"date":"2013-01-24","text":"If an opponent’s library contains fewer than X land cards, all cards from that library are revealed and put into his or her graveyard."},{"date":"2013-01-24","text":"If another spell or ability instructs you to cast Mind Grind “without paying its mana cost,” you won’t be able to. You must pick 0 as the value of X in the mana cost of a spell being cast “without paying its mana cost,” but the X in Mind Grind’s mana cost can’t be 0."}],"imageName":"mind grind"},{"layout":"normal","type":"Creature - Drake","types":["Creature"],"colors":["Blue"],"multiverseid":366284,"name":"Mindeye Drake","subtypes":["Drake"],"cmc":5,"rarity":"Uncommon","artist":"Lars Grant-West","power":"2","toughness":"5","manaCost":"{4}{U}","text":"Flying\n\nWhen Mindeye Drake dies, target player puts the top five cards of his or her library into his or her graveyard.","flavor":"They can map both the cityscape and the minds of its architects.","number":"43","imageName":"mindeye drake"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["Red"],"multiverseid":366356,"name":"Molten Primordial","subtypes":["Avatar"],"cmc":7,"rarity":"Rare","artist":"Stephan Martiniere","power":"6","toughness":"4","manaCost":"{5}{R}{R}","text":"Haste\n\nWhen Molten Primordial enters the battlefield, for each opponent, gain control of up to one target creature that player controls until end of turn. Untap those creatures. They gain haste until end of turn.","number":"101","rulings":[{"date":"2013-01-24","text":"You can choose a number of targets up to the number of opponents you have, one target per opponent."},{"date":"2013-01-24","text":"Molten Primordial’s triggered ability can target a creature that’s already untapped."}],"imageName":"molten primordial"},{"layout":"normal","type":"Creature - Skeleton","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366449,"name":"Mortus Strider","subtypes":["Skeleton"],"cmc":3,"rarity":"Common","artist":"Tomasz Jedruszek","power":"1","toughness":"1","manaCost":"{1}{U}{B}","text":"When Mortus Strider dies, return it to its owner's hand.","flavor":"Dimir's best agents hide from death itself.","number":"179","rulings":[{"date":"2013-01-24","text":"Mortis Strider will return to its owner’s hand only if it is still in the graveyard when its ability resolves."}],"imageName":"mortus strider"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":366430,"name":"Mugging","cmc":1,"rarity":"Common","artist":"Greg Staples","manaCost":"{R}","text":"Mugging deals 2 damage to target creature. That creature can't block this turn.","flavor":"Scream: muffled. Pockets: emptied. Neck function: never the same again.","number":"102","imageName":"mugging"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":366327,"name":"Murder Investigation","subtypes":["Aura"],"cmc":2,"rarity":"Uncommon","artist":"Igor Kieryluk","manaCost":"{1}{W}","text":"Enchant creature you control\n\nWhen enchanted creature dies, put X 1/1 white Soldier creature tokens onto the battlefield, where X is its power.","flavor":"\"Every death has a web of consequences. Our job is to find the spider.\"","number":"21","rulings":[{"date":"2013-01-24","text":"To determine how many Soldier tokens are created, use the power of the enchanted creature as it last existed on the battlefield."},{"date":"2013-01-24","text":"If another player gains control of either Murder Investigation or the enchanted creature (but not both), Murder Investigation will be enchanting an illegal permanent. The Aura will be put into its owner’s graveyard as a state-based action."}],"imageName":"murder investigation"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Green"],"multiverseid":366401,"name":"Mystic Genesis","cmc":5,"rarity":"Rare","artist":"Mike Bierek","manaCost":"{2}{G}{U}{U}","text":"Counter target spell. Put an X/X green Ooze creature token onto the battlefield, where X is that spell's converted mana cost.","flavor":"\"The Simic can grow anything out of a puddle of sludge. I just hope they never join forces with the Golgari.\"\r\n\n—Teysa Karlov, Grand Envoy of Orzhov","number":"180","rulings":[{"date":"2013-01-24","text":"If the target spell is an illegal target when Mystic Genesis tries to resolve, Mystic Genesis will be countered and none of its effects will happen. You won’t get an Ooze token."},{"date":"2013-01-24","text":"You may target a spell that can’t be countered. When Mystic Genesis resolves, the target spell will be unaffected, but you’ll still get an Ooze token."}],"imageName":"mystic genesis"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366303,"name":"Naturalize","cmc":2,"rarity":"Common","artist":"Daniel Ljunggren","manaCost":"{1}{G}","text":"Destroy target artifact or enchantment.","flavor":"\"And if you threaten me again, your shiny steel trousers will be sprouting daggerthorn vines.\"\r\n\n—Iveta, rooftop runner","number":"127","imageName":"naturalize"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":366378,"name":"Nav Squad Commandos","subtypes":["Human","Soldier"],"cmc":5,"rarity":"Common","artist":"Steve Prescott","power":"3","toughness":"5","manaCost":"{4}{W}","text":"Battalion — Whenever Nav Squad Commandos and at least two other creatures attack, Nav Squad Commandos gets +1/+1 until end of turn. Untap it.","flavor":"Funded by the Azorius to keep current maps of the undercity, the Boros nav squads survey even the most unsavory areas.","number":"22","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"nav squad commandos"},{"layout":"normal","type":"Creature - Specter","types":["Creature"],"colors":["Blue","Black"],"multiverseid":366242,"name":"Nightveil Specter","subtypes":["Specter"],"cmc":3,"rarity":"Rare","artist":"Min Yum","power":"2","toughness":"3","manaCost":"{U/B}{U/B}{U/B}","text":"Flying\n\nWhenever Nightveil Specter deals combat damage to a player, that player exiles the top card of his or her library.\n\nYou may play cards exiled with Nightveil Specter.","number":"222","rulings":[{"date":"2013-01-24","text":"The card is exiled face up. All players may look at it."},{"date":"2013-01-24","text":"Playing a card exiled with Nightveil Specter follows all the normal rules for playing that card. You must pay its costs, and you must follow all timing restrictions, for example."},{"date":"2013-01-24","text":"Nightveil Specter’s last ability applies to cards exiled with that specific Nightveil Specter, not any other creature named Nightveil Specter. You should keep cards exiled by different Nightveil Specters separate."}],"imageName":"nightveil specter"},{"layout":"normal","type":"Creature - Leviathan","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366275,"name":"Nimbus Swimmer","subtypes":["Leviathan"],"cmc":2,"rarity":"Uncommon","artist":"Howard Lyon","power":"0","toughness":"0","manaCost":"{X}{G}{U}","text":"Flying\n\nNimbus Swimmer enters the battlefield with X +1/+1 counters on it.","flavor":"The Simic soon discovered that the sky offered as few constraints on size as the sea.","number":"181","imageName":"nimbus swimmer"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Spirit Advisor","types":["Creature"],"colors":["White","Black"],"multiverseid":366246,"name":"Obzedat, Ghost Council","subtypes":["Spirit","Advisor"],"cmc":5,"rarity":"Mythic Rare","artist":"Svetlin Velinov","power":"5","toughness":"5","manaCost":"{1}{W}{W}{B}{B}","text":"When Obzedat, Ghost Council enters the battlefield, target opponent loses 2 life and you gain 2 life.\n\nAt the beginning of your end step, you may exile Obzedat. If you do, return it to the battlefield under its owner's control at the beginning of your next upkeep. It gains haste.","number":"182","rulings":[{"date":"2013-01-24","text":"When Obzedat is returned to the battlefield by its last ability, it gains haste indefinitely. This may be relevant if a player gains control of it later using a spell or ability that doesn’t give it haste."}],"imageName":"obzedat, ghost council"},{"layout":"normal","type":"Creature - Ogre Rogue","types":["Creature"],"colors":["Black"],"multiverseid":366432,"name":"Ogre Slumlord","subtypes":["Ogre","Rogue"],"cmc":5,"rarity":"Rare","artist":"Trevor Claxton","power":"3","toughness":"3","manaCost":"{3}{B}{B}","text":"Whenever another nontoken creature dies, you may put a 1/1 black Rat creature token onto the battlefield.\n\nRats you control have deathtouch.","flavor":"\"His tenement is filled with the most vile, disgusting vermin. It's infested with rats, too.\"\r\n\n—Branko One-Ear","number":"74","rulings":[{"date":"2013-01-24","text":"All Rats you control have deathtouch while Ogre Slumlord is on the battlefield, not just the ones created by Ogre Slumlord."}],"imageName":"ogre slumlord"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White","Black"],"multiverseid":366261,"name":"One Thousand Lashes","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Daarken","manaCost":"{2}{W}{B}","text":"Enchant creature\n\nEnchanted creature can't attack or block, and its activated abilities can't be activated.\n\nAt the beginning of the upkeep of enchanted creature's controller, that player loses 1 life.","number":"183","imageName":"one thousand lashes"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Green"],"multiverseid":366375,"name":"Ooze Flux","cmc":4,"rarity":"Rare","artist":"Zoltan Boros","manaCost":"{3}{G}","text":"{1}{G}, Remove one or more +1/+1 counters from among creatures you control: Put an X/X green Ooze creature token onto the battlefield, where X is the number of +1/+1 counters removed this way.","number":"128","imageName":"ooze flux"},{"layout":"normal","type":"Creature - Minotaur Soldier","types":["Creature"],"colors":["White","Red"],"multiverseid":366259,"name":"Ordruun Veteran","subtypes":["Minotaur","Soldier"],"cmc":4,"rarity":"Uncommon","artist":"Greg Staples","power":"3","toughness":"1","manaCost":"{2}{R}{W}","text":"Battalion — Whenever Ordruun Veteran and at least two other creatures attack, Ordruun Veteran gains double strike until end of turn. (It deals both first-strike and regular combat damage.)","flavor":"\"My father was Gruul, but I chose the precision of the legion over the fury of the pack.\"","number":"184","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"ordruun veteran"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Black"],"multiverseid":366436,"name":"Orzhov Charm","cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{W}{B}","text":"Choose one — Return target creature you control and all Auras you control attached to it to their owner's hand; or destroy target creature and you lose life equal to its toughness; or return target creature card with converted mana cost 1 or less from your graveyard to the battlefield.","number":"185","rulings":[{"date":"2013-01-24","text":"Orzhov Charm’s first mode doesn’t target any of the Auras attached to the target creature."},{"date":"2013-01-24","text":"If you choose the first mode, any Aura controlled by another player attached to the creature will be put into its owner’s graveyard as a state-based action after the creature leaves the battlefield."},{"date":"2013-01-24","text":"If you choose the second mode, you’ll lose life equal to the creature’s toughness when it was last on the battlefield."},{"date":"2013-01-24","text":"If you choose the second mode, and Orzhov Charm resolves but the creature isn’t destroyed (perhaps because it’s indestructible or it regenerates), you’ll still lose life equal to the creature’s toughness."},{"date":"2013-01-24","text":"For each of the modes, if the target creature or creature card is an illegal target when Orzhov Charm tries to resolve, it will be countered and none of its effects will happen."}],"imageName":"orzhov charm"},{"layout":"normal","type":"Land - Gate","types":["Land"],"colors":[],"multiverseid":366374,"name":"Orzhov Guildgate","subtypes":["Gate"],"rarity":"Common","artist":"John Avon","text":"Orzhov Guildgate enters the battlefield tapped.\n\n{T}: Add {W} or {B} to your mana pool.","flavor":"Enter to find wealth, security, and eternal life . . . for just a small price up front.","number":"244","rulings":[{"date":"2013-04-15","text":"The subtype Gate has no special rules significance, but other spells and abilities may refer to it."},{"date":"2013-04-15","text":"Gate is not a basic land type."}],"imageName":"orzhov guildgate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366479,"name":"Orzhov Keyrune","cmc":3,"rarity":"Uncommon","artist":"Daniel Ljunggren","manaCost":"{3}","text":"{T}: Add {W} or {B} to your mana pool.\n\n{W}{B}: Orzhov Keyrune becomes a 1/4 white and black Thrull artifact creature with lifelink until end of turn.","flavor":"You only need to wield it once to appreciate the power of control.","number":"233","rulings":[{"date":"2013-01-24","text":"Multiple instances of lifelink are redundant. Activating the last ability multiple times won’t cause you to gain more life."},{"date":"2013-04-15","text":"Until the ability that turns the Keyrune into a creature resolves, the Keyrune is colorless."},{"date":"2013-04-15","text":"Activating the ability that turns the Keyrune into a creature while it’s already a creature will override any effects that set its power and/or toughness to another number, but effects that modify power and/or toughness without directly setting them will still apply."}],"imageName":"orzhov keyrune"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Black"],"multiverseid":366324,"name":"Paranoid Delusions","cmc":2,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{U}{B}","text":"Target player puts the top three cards of his or her library into his or her graveyard.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"186","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"paranoid delusions"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red","Green"],"multiverseid":366450,"name":"Pit Fight","cmc":2,"rarity":"Common","artist":"Matt Stewart","manaCost":"{1}{R/G}","text":"Target creature you control fights another target creature. (Each deals damage equal to its power to the other.)","flavor":"\"All the coins in Ravnica can't save his soul now.\"\r\n\n—Narbulg Nine Fingers","number":"223","rulings":[{"date":"2013-01-24","text":"The second target of Pit Fight can be another creature you control, but it can’t be the same creature as the first target."},{"date":"2013-01-24","text":"If either target of Pit Fight is an illegal target when the ability tries to resolve, neither creature will deal or be dealt damage."}],"imageName":"pit fight"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366233,"name":"Predator's Rapport","cmc":3,"rarity":"Common","artist":"Matt Stewart","manaCost":"{2}{G}","text":"Choose target creature you control. You gain life equal to that creature's power plus its toughness.","flavor":"\"Other guilds say the Gruul are savages, no better than the beasts we live with. I say we've found friends who won't stab us in the back.\"\r\n\n—Domri Rade","number":"129","imageName":"predator's rapport"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red","Green"],"multiverseid":366250,"name":"Primal Visitation","subtypes":["Aura"],"cmc":5,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{3}{R}{G}","text":"Enchant creature\n\nEnchanted creature gets +3/+3 and has haste.","flavor":"Gruul shamans believe all sentient beings have the soul of savagery inside them, an animal form clawing to escape.","number":"187","imageName":"primal visitation"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Merfolk Wizard","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366416,"name":"Prime Speaker Zegana","subtypes":["Merfolk","Wizard"],"cmc":6,"rarity":"Mythic Rare","artist":"Willian Murai","power":"1","toughness":"1","manaCost":"{2}{G}{G}{U}{U}","text":"Prime Speaker Zegana enters the battlefield with X +1/+1 counters on it, where X is the greatest power among other creatures you control.\n\nWhen Prime Speaker Zegana enters the battlefield, draw cards equal to its power.","number":"188","rulings":[{"date":"2013-01-24","text":"The value of X is the greatest power among creatures you control as Prime Speaker Zegana enters the battlefield. If you control no creatures at that time, X will be 0."},{"date":"2013-01-24","text":"The number of cards you draw equals Prime Speaker Zegana’s power when the last ability resolves."},{"date":"2013-01-24","text":"If Prime Speaker Zegana enters the battlefield at the same time as another creature you control, you won’t consider that creature when determining the greatest power among creatures you control."}],"imageName":"prime speaker zegana"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366262,"name":"Prophetic Prism","cmc":2,"rarity":"Common","artist":"Daniel Ljunggren","manaCost":"{2}","text":"When Prophetic Prism enters the battlefield, draw a card.\n\n{1}, {T}: Add one mana of any color to your mana pool.","flavor":"To understand Ravnica, one must first understand how each guild contributes to its stability.","number":"234","imageName":"prophetic prism"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Black"],"multiverseid":366296,"name":"Psychic Strike","cmc":3,"rarity":"Common","artist":"Mathias Kollros","manaCost":"{1}{U}{B}","text":"Counter target spell. Its controller puts the top two cards of his or her library into his or her graveyard.","flavor":"Until more information could be gleaned about Niv-Mizzet's intentions, Lazav took every opportunity to stall his experiments.","number":"189","rulings":[{"date":"2013-01-24","text":"If the target spell is an illegal target when Psychic Strike tries to resolve, Psychic Strike will be countered and none of its effects will happen. The target’s controller won’t put any cards from the top of his or her library into his or her graveyard."},{"date":"2013-01-24","text":"You may target a spell that can’t be countered. When Psychic Strike resolves, the target spell will be unaffected, but its controller will still put the top two cards of his or her library into his or her graveyard."}],"imageName":"psychic strike"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White","Black"],"multiverseid":366393,"name":"Purge the Profane","cmc":4,"rarity":"Common","artist":"Michael C. Hayes","manaCost":"{2}{W}{B}","text":"Target opponent discards two cards and you gain 2 life.","flavor":"The Orzhov hear the plans of the other guilds through the guilty thoughts of the disloyal.","number":"190","rulings":[{"date":"2013-01-24","text":"If the opponent has fewer than two cards in his or her hand, he or she will discard them. You’ll still gain 2 life, no matter how many cards were discarded."}],"imageName":"purge the profane"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366388,"name":"Rapid Hybridization","cmc":1,"rarity":"Uncommon","artist":"Jack Wang","manaCost":"{U}","text":"Destroy target creature. It can't be regenerated. That creature's controller puts a 3/3 green Frog Lizard creature token onto the battlefield.","flavor":"\"We've merged your life essence with that of several creatures at once. You're welcome.\"\r\n\n—Speaker Trifon","number":"44","rulings":[{"date":"2013-01-24","text":"If the creature is an illegal target when Rapid Hybridization tries to resolve, it will be countered and none of its effects will happen. No Frog Lizard token will be created."},{"date":"2013-01-24","text":"If Rapid Hybridization resolves and the creature isn’t destroyed (perhaps because it’s indestructible), its controller will still get the Frog Lizard token."}],"imageName":"rapid hybridization"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366405,"name":"Razortip Whip","cmc":2,"rarity":"Common","artist":"James Paick","manaCost":"{2}","text":"{1}, {T}: Razortip Whip deals 1 damage to target opponent.","flavor":"\"It no longer surprises me what shows up in our raid of a Rakdos revue.\"\r\n\n—Janik Bara, Wojek captain","number":"235","imageName":"razortip whip"},{"layout":"normal","type":"Creature - Vedalken Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":366315,"name":"Realmwright","subtypes":["Vedalken","Wizard"],"cmc":1,"rarity":"Rare","artist":"Slawomir Maniak","power":"1","toughness":"1","manaCost":"{U}","text":"As Realmwright enters the battlefield, choose a basic land type.\n\nLands you control are the chosen type in addition to their other types.","flavor":"There is not a single inch of Ravnica that hasn't been altered at one point or another to fit someone's whims.","number":"45","rulings":[{"date":"2013-01-24","text":"The basic land types are Plains, Island, Swamp, Mountain, and Forest. Other land types, like Gate, aren’t basic lands types."},{"date":"2013-01-24","text":"Lands you control will have the ability to tap for the color of mana corresponding to the chosen type. They’ll also retain any other abilities they have."}],"imageName":"realmwright"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":366288,"name":"Righteous Charge","cmc":3,"rarity":"Uncommon","artist":"Svetlin Velinov","manaCost":"{1}{W}{W}","text":"Creatures you control get +2/+2 until end of turn.","flavor":"\"In the name of peace, moderation, and decency—wipe them all out!\"","number":"23","rulings":[{"date":"2013-01-24","text":"Only creatures you control when Righteous Charge resolves will get +2/+2. Creatures that come under your control later in the turn will not."}],"imageName":"righteous charge"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":366349,"name":"Riot Gear","subtypes":["Equipment"],"cmc":2,"rarity":"Common","artist":"Jack Wang","manaCost":"{2}","text":"Equipped creature gets +1/+2.\n\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)","flavor":"Any meeting between guilds requires proper equipment.","number":"236","imageName":"riot gear"},{"layout":"normal","type":"Creature - Lizard","types":["Creature"],"colors":["Red"],"multiverseid":366362,"name":"Ripscale Predator","subtypes":["Lizard"],"cmc":6,"rarity":"Uncommon","artist":"Volkan Baga","power":"6","toughness":"5","manaCost":"{4}{R}{R}","text":"Ripscale Predator can't be blocked except by two or more creatures.","flavor":"As Ravnica's wilds expanded, even advocates for nature had to confront fiercer natural threats.","number":"103","imageName":"ripscale predator"},{"layout":"normal","type":"Creature - Human Warrior","types":["Creature"],"colors":["Red","Green"],"multiverseid":366462,"name":"Rubblebelt Raiders","subtypes":["Human","Warrior"],"cmc":4,"rarity":"Rare","artist":"Chippy","power":"3","toughness":"3","manaCost":"{1}{R/G}{R/G}{R/G}","text":"Whenever Rubblebelt Raiders attacks, put a +1/+1 counter on it for each attacking creature you control.","flavor":"\"This city will perish, and the Gruul will cheer as the boar-god crushes the last bricks into dust.\"\r\n\n—Nikya of the Old Ways","number":"224","rulings":[{"date":"2013-01-24","text":"Count the number of attacking creatures you control when Rubblebelt Raiders’s ability resolves, including Rubblebelt Raiders itself, to determine how many +1/+1 counters to put on it."}],"imageName":"rubblebelt raiders"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red","Green"],"multiverseid":366424,"name":"Rubblehulk","subtypes":["Elemental"],"cmc":6,"rarity":"Rare","artist":"Raymond Swanland","power":"*","toughness":"*","manaCost":"{4}{R}{G}","text":"Rubblehulk's power and toughness are each equal to the number of lands you control.\n\nBloodrush — {1}{R}{G}, Discard Rubblehulk: Target attacking creature gets +X/+X until end of turn, where X is the number of lands you control.","number":"191","rulings":[{"date":"2013-01-24","text":"The ability that defines Rubblehulk’s power and toughness works in all zones, not just the battlefield."},{"date":"2013-01-24","text":"If you activate Rubblehulk’s bloodrush ability, the value of X is the number of lands you control when that ability resolves."}],"imageName":"rubblehulk"},{"layout":"normal","type":"Creature - Wurm","types":["Creature"],"colors":["Red","Green"],"multiverseid":366235,"name":"Ruination Wurm","subtypes":["Wurm"],"cmc":6,"rarity":"Common","artist":"Dave Kendall","power":"7","toughness":"6","manaCost":"{4}{R}{G}","flavor":"When the architects of Ravnica claim a structure will stand against a wurm, they never mention for how long.","number":"192","imageName":"ruination wurm"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["Green"],"multiverseid":366245,"name":"Rust Scarab","subtypes":["Insect"],"cmc":5,"rarity":"Uncommon","artist":"Adam Paquette","power":"4","toughness":"5","manaCost":"{4}{G}","text":"Whenever Rust Scarab becomes blocked, you may destroy target artifact or enchantment defending player controls.","flavor":"\"Behold nature's answer to the problem of society.\"\r\n\n—Nikya of the Old Ways","number":"130","rulings":[{"date":"2013-01-24","text":"Rust Scarab’s ability normally triggers only once per combat, no matter how many creatures are assigned to block it."},{"date":"2013-01-24","text":"The artifact or enchantment will be destroyed before combat damage is dealt but after blockers are chosen."}],"imageName":"rust scarab"},{"layout":"normal","type":"Land - Mountain Plains","types":["Land"],"colors":[],"multiverseid":366439,"name":"Sacred Foundry","subtypes":["Mountain","Plains"],"rarity":"Rare","artist":"Sam Burley","text":"({T}: Add {R} or {W} to your mana pool.)\n\nAs Sacred Foundry enters the battlefield, you may pay 2 life. If you don't, Sacred Foundry enters the battlefield tapped.","flavor":"Burning fervor and fearsome skill create a lethal beauty terrible to behold.","number":"245","rulings":[{"date":"2005-10-01","text":"Has basic land types, but isn't a basic land.  Things that affect basic lands don't affect it.  For example, you can't find it with Civic Wayfinder."},{"date":"2005-10-01","text":"If another effect (such as Loxodon Gatekeeper's ability) tells you to put lands onto the battlefield tapped, it enters the battlefield tapped whether you pay 2 life or not."},{"date":"2005-10-01","text":"If multiple permanents with \"as enters the battlefield\" effects are entering the battlefield at the same time, process those effects one at a time, then put the permanents onto the battlefield all at once. For example, if you're at 3 life and an effect puts two of these onto the battlefield, you can pay 2 life for only one of them, not both."}],"imageName":"sacred foundry"},{"layout":"normal","type":"Creature - Vedalken Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":366406,"name":"Sage's Row Denizen","subtypes":["Vedalken","Wizard"],"cmc":3,"rarity":"Common","artist":"Svetlin Velinov","power":"2","toughness":"3","manaCost":"{2}{U}","text":"Whenever another blue creature enters the battlefield under your control, target player puts the top two cards of his or her library into his or her graveyard.","flavor":"\"I offer you wisdom untainted by false loyalty, learning free of any guild's agenda.\"","number":"46","imageName":"sage's row denizen"},{"layout":"normal","type":"Creature - Drake","types":["Creature"],"colors":["Blue"],"multiverseid":366421,"name":"Sapphire Drake","subtypes":["Drake"],"cmc":6,"rarity":"Uncommon","artist":"Steve Prescott","power":"4","toughness":"4","manaCost":"{5}{U}","text":"Flying\n\nEach creature you control with a +1/+1 counter on it has flying.","flavor":"Sapphire drakes can communicate over great distances, their calls resonating in the gems fixed in their skulls.","number":"47","imageName":"sapphire drake"},{"layout":"normal","type":"Creature - Centaur Warrior","types":["Creature"],"colors":["Green"],"multiverseid":366410,"name":"Scab-Clan Charger","subtypes":["Centaur","Warrior"],"cmc":4,"rarity":"Common","artist":"Nils Hamm","power":"2","toughness":"4","manaCost":"{3}{G}","text":"Bloodrush — {1}{G}, Discard Scab-Clan Charger: Target attacking creature gets +2/+4 until end of turn.","flavor":"\"The only roads I wish to see are those beaten flat by wild hooves.\"","number":"131","imageName":"scab-clan charger"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366241,"name":"Scatter Arc","cmc":4,"rarity":"Common","artist":"Peter Mohrbacher","manaCost":"{3}{U}","text":"Counter target noncreature spell.\n\nDraw a card.","flavor":"\"Should your chosen emissary be able to fluctuate triharmonic pentodes, however unlikely, I shall shunt excess negavolt radicals.\"","number":"48","imageName":"scatter arc"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":366409,"name":"Scorchwalker","subtypes":["Elemental"],"cmc":4,"rarity":"Common","artist":"Anthony Palumbo","power":"5","toughness":"1","manaCost":"{3}{R}","text":"Bloodrush — {1}{R}{R}, Discard Scorchwalker: Target attacking creature gets +5/+1 until end of turn.","flavor":"\"Borborygmos's elemental launched an assault, but the Izzet wards held and experiments continue.\"\r\n\n—Skyknight report on the Rubblebelt","number":"104","imageName":"scorchwalker"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["Black"],"multiverseid":366285,"name":"Sepulchral Primordial","subtypes":["Avatar"],"cmc":7,"rarity":"Rare","artist":"Stephan Martiniere","power":"5","toughness":"4","manaCost":"{5}{B}{B}","text":"Intimidate\n\nWhen Sepulchral Primordial enters the battlefield, for each opponent, you may put up to one target creature card from that player's graveyard onto the battlefield under your control.","number":"75","rulings":[{"date":"2013-01-24","text":"You can choose a number of targets up to the number of opponents you have, one target per opponent."},{"date":"2013-01-24","text":"The creature cards enter the battlefield simultaneously."}],"imageName":"sepulchral primordial"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":366269,"name":"Serene Remembrance","cmc":1,"rarity":"Uncommon","artist":"David Palumbo","manaCost":"{G}","text":"Shuffle Serene Remembrance and up to three target cards from a single graveyard into their owners' libraries.","flavor":"While Lazav schemed and Niv-Mizzet researched, Trostani sought the future in the whispers of the past.","number":"132","rulings":[{"date":"2013-01-24","text":"You may choose zero targets when you cast Serene Remembrance. If you do, you’ll shuffle Serene Remembrance into its owner’s library when it resolves."},{"date":"2013-01-24","text":"If you choose at least one target for Serene Remembrance, and all of its targets are illegal when Serene Remembrance tries to resolve, it will be countered and none of its effects will happen. You won’t shuffle any library and Serene Remembrance will be put into its owner’s graveyard."},{"date":"2013-01-24","text":"If you give Serene Remembrance the flashback ability and cast it from your graveyard, it will be exiled instead of being shuffled into your library. Any other targets will still be shuffled into their owners’ library, however."}],"imageName":"serene remembrance"},{"layout":"normal","type":"Creature - Vampire Rogue","types":["Creature"],"colors":["Black"],"multiverseid":366307,"name":"Shadow Alley Denizen","subtypes":["Vampire","Rogue"],"cmc":1,"rarity":"Common","artist":"Cynthia Sheppard","power":"1","toughness":"1","manaCost":"{B}","text":"Whenever another black creature enters the battlefield under your control, target creature gains intimidate until end of turn. (It can't be blocked except by artifact creatures and/or creatures that share a color with it.)","number":"76","rulings":[{"date":"2013-01-24","text":"The black creature that entered the battlefield can be chosen as the target of Shadow Alley Denizen’s ability, but it won’t be able to attack that turn unless it also has haste."},{"date":"2013-01-24","text":"Shadow Alley Denizen can be chosen as the target of its own ability."}],"imageName":"shadow alley denizen"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":366455,"name":"Shadow Slice","cmc":5,"rarity":"Common","artist":"Raymond Swanland","manaCost":"{4}{B}","text":"Target opponent loses 3 life.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"77","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"shadow slice"},{"layout":"normal","type":"Creature - Fish Crab","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366478,"name":"Shambleshark","subtypes":["Fish","Crab"],"cmc":2,"rarity":"Common","artist":"Wesley Burt","power":"2","toughness":"1","manaCost":"{G}{U}","text":"Flash (You may cast this spell any time you could cast an instant.)\n\nEvolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)","number":"193","rulings":[{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"shambleshark"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White","Red"],"multiverseid":366331,"name":"Shattering Blow","cmc":2,"rarity":"Common","artist":"Steve Prescott","manaCost":"{1}{R/W}","text":"Exile target artifact.","flavor":"\"Aurelia seems too eager to solve her problems by delivering them to oblivion.\"\r\n\n—Prime Speaker Zegana","number":"225","imageName":"shattering blow"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":366332,"name":"Shielded Passage","cmc":1,"rarity":"Common","artist":"Raymond Swanland","manaCost":"{W}","text":"Prevent all damage that would be dealt to target creature this turn.","flavor":"Izzet delved into the depths of Ravnica's past, and Selesnya followed without fear.","number":"24","imageName":"shielded passage"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red","Green"],"multiverseid":366365,"name":"Signal the Clans","cmc":2,"rarity":"Rare","artist":"Dave Kendall","manaCost":"{R}{G}","text":"Search your library for three creature cards and reveal them. If you reveal three cards with different names, choose one of them at random and put that card into your hand. Shuffle the rest into your library.","flavor":"Gruul clanfolk obey few rules, but all feel bound to answer the call of the horn.","number":"194","rulings":[{"date":"2013-01-24","text":"If you don’t reveal three creature cards with different names, you’ll simply shuffle your library (including any cards you revealed)."},{"date":"2013-01-24","text":"All players will see the card you put into your hand, if any."}],"imageName":"signal the clans"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue","Green"],"multiverseid":366463,"name":"Simic Charm","cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros","manaCost":"{G}{U}","text":"Choose one — Target creature gets +3/+3 until end of turn; or permanents you control gain hexproof until end of turn; or return target creature to its owner's hand.","flavor":"\"We measure our progress in heartbeats.\"\r\n\n—Prime Speaker Zegana","number":"195","rulings":[{"date":"2013-01-24","text":"If you choose the second mode, only permanents you control when Simic Charm resolves will gain hexproof. Permanents that come under your control later that turn will not."}],"imageName":"simic charm"},{"layout":"normal","type":"Creature - Merfolk Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":366274,"name":"Simic Fluxmage","subtypes":["Merfolk","Wizard"],"cmc":3,"rarity":"Uncommon","artist":"Karl Kopinski","power":"1","toughness":"2","manaCost":"{2}{U}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)\n\n{1}{U}, {T}: Move a +1/+1 counter from Simic Fluxmage onto target creature.","number":"49","rulings":[{"date":"2013-01-24","text":"To move a counter from one creature to another, the counter is removed from the first creature and placed on the second. Any abilities that care about a counter being placed on the second creature will apply."},{"date":"2013-01-24","text":"If the creature is an illegal target when Simic Fluxmage’s ability tries to resolve, it will be countered and none of its effects will happen. No counters will be removed from Simic Fluxmage."},{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"simic fluxmage"},{"layout":"normal","type":"Land - Gate","types":["Land"],"colors":[],"multiverseid":366383,"name":"Simic Guildgate","subtypes":["Gate"],"rarity":"Common","artist":"Svetlin Velinov","text":"Simic Guildgate enters the battlefield tapped.\n\n{T}: Add {G} or {U} to your mana pool.","flavor":"Enter and comprehend the perfection of orchestrated life.","number":"246","rulings":[{"date":"2013-04-15","text":"The subtype Gate has no special rules significance, but other spells and abilities may refer to it."},{"date":"2013-04-15","text":"Gate is not a basic land type."}],"imageName":"simic guildgate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":366357,"name":"Simic Keyrune","cmc":3,"rarity":"Uncommon","artist":"Daniel Ljunggren","manaCost":"{3}","text":"{T}: Add {G} or {U} to your mana pool.\n\n{G}{U}: Simic Keyrune becomes a 2/3 green and blue Crab artifact creature with hexproof until end of turn. (It can't be the target of spells or abilities your opponents control.)","number":"237","rulings":[{"date":"2013-04-15","text":"Until the ability that turns the Keyrune into a creature resolves, the Keyrune is colorless."},{"date":"2013-04-15","text":"Activating the ability that turns the Keyrune into a creature while it’s already a creature will override any effects that set its power and/or toughness to another number, but effects that modify power and/or toughness without directly setting them will still apply."}],"imageName":"simic keyrune"},{"layout":"normal","type":"Creature - Mutant Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":366343,"name":"Simic Manipulator","subtypes":["Mutant","Wizard"],"cmc":3,"rarity":"Rare","artist":"Maciej Kuciara","power":"0","toughness":"1","manaCost":"{1}{U}{U}","text":"Evolve (Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.)\n\n{T}, Remove one or more +1/+1 counters from Simic Manipulator: Gain control of target creature with power less than or equal to the number of +1/+1 counters removed this way.","number":"50","rulings":[{"date":"2013-01-24","text":"The power of the target creature is checked both as you target it and as the ability resolves. If the power of the target creature when the ability resolves is greater than the number of +1/+1 counters removed from Simic Manipulator, the ability will be countered and none of its effects will happen. You won’t gain control of any creature, but the counters removed as a cost remain removed."},{"date":"2013-04-15","text":"When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."},{"date":"2013-04-15","text":"Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won't trigger at all."},{"date":"2013-04-15","text":"If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."},{"date":"2013-04-15","text":"If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."},{"date":"2013-04-15","text":"If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."},{"date":"2013-04-15","text":"When comparing the stats as the evolve ability resolves, it's possible that the stat that's greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you'll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, it toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You'll put a +1/+1 counter on the creature with evolve."}],"imageName":"simic manipulator"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":366458,"name":"Skarrg Goliath","subtypes":["Beast"],"cmc":8,"rarity":"Rare","artist":"Scott Chou","power":"9","toughness":"9","manaCost":"{6}{G}{G}","text":"Trample\n\nBloodrush — {5}{G}{G}, Discard Skarrg Goliath: Target attacking creature gets +9/+9 and gains trample until end of turn.","flavor":"\"They bind us with their laws. We free ourselves with nature's fist.\"\r\n\n—Nikya of the Old Ways","number":"133","imageName":"skarrg goliath"},{"layout":"normal","type":"Creature - Human Shaman","types":["Creature"],"colors":["Red","Green"],"multiverseid":366350,"name":"Skarrg Guildmage","subtypes":["Human","Shaman"],"cmc":2,"rarity":"Uncommon","artist":"Aleksi Briclot","power":"2","toughness":"2","manaCost":"{R}{G}","text":"{R}{G}: Creatures you control gain trample until end of turn.\n\n{1}{R}{G}: Target land you control becomes a 4/4 Elemental creature until end of turn. It's still a land.","number":"196","rulings":[{"date":"2013-01-24","text":"Only creatures you control when the first ability resolves will gain trample. Creatures that come under your control later in the turn won’t have trample. Lands you control that aren’t creatures also won’t gain trample, even if you use the second ability to turn them into creatures later in the turn."},{"date":"2013-01-24","text":"Skarrg Guildmage’s second ability doesn’t affect the land’s name or any other types, subtypes, or supertypes (such as basic or legendary) the land may have. The land will also keep any abilities it had."}],"imageName":"skarrg guildmage"},{"layout":"normal","type":"Creature - Goblin Warrior","types":["Creature"],"colors":["Red"],"multiverseid":366434,"name":"Skinbrand Goblin","subtypes":["Goblin","Warrior"],"cmc":2,"rarity":"Common","artist":"Marco Nelor","power":"2","toughness":"1","manaCost":"{1}{R}","text":"Bloodrush — {R}, Discard Skinbrand Goblin: Target attacking creature gets +2/+1 until end of turn.","flavor":"\"These Gruul skin-runes—discern whether their patterns evoke streets, leylines, or both. You have four days.\"\r\n\n—Niv-Mizzet, to his assistant","number":"105","imageName":"skinbrand goblin"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":366238,"name":"Skullcrack","cmc":2,"rarity":"Uncommon","artist":"Dave Kendall","manaCost":"{1}{R}","text":"Players can't gain life this turn. Damage can't be prevented this turn. Skullcrack deals 3 damage to target player.","flavor":"The lawmage's argument was clever and well reasoned, but Blunk's response proved irrefutable.","number":"106","rulings":[{"date":"2013-01-24","text":"Skullcrack targets only the player. If that player is an illegal target when Skullcrack tries to resolve, it will be countered and none of its effects will happen."},{"date":"2013-01-24","text":"Spells and abilities that would cause a player to gain life or that would prevent damage still resolve, but the life-gain and damage-prevention parts have no effect."},{"date":"2013-01-24","text":"Effects that would replace gaining life with another effect won’t apply because it’s impossible for players to gain life."},{"date":"2013-01-24","text":"If an effect says to set a player’s life total to a certain number and that number is higher than the player’s current life total, that part of the effect won’t do anything. (If the number is lower than the player’s current life total, the effect will work as normal.)"}],"imageName":"skullcrack"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":366346,"name":"Skyblinder Staff","subtypes":["Equipment"],"cmc":1,"rarity":"Common","artist":"Mark Winters","manaCost":"{1}","text":"Equipped creature gets +1/+0 and can't be blocked by creatures with flying.\n\nEquip {3} ({3}: Attach to target creature you control. Equip only as a sorcery.)","flavor":"\"If bats are the only thing between me and a mountain of Orzhov coins, then I'm about to be a very rich thief.\"","number":"238","rulings":[{"date":"2013-01-24","text":"The equipped creature can still be blocked by a creature with reach."},{"date":"2013-01-24","text":"If the equipped creature is blocked by a creature and then that creature gains flying, the equipped creature will remain blocked."}],"imageName":"skyblinder staff"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":366323,"name":"Skygames","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Sam Burley","manaCost":"{1}{U}","text":"Enchant land\n\nEnchanted land has \"{T}: Target creature gains flying until end of turn. Activate this ability only any time you could cast a sorcery.\"","flavor":"Both Boros and Azorius scout the games in hopes of recruiting the finest athletes.","number":"51","imageName":"skygames"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White","Red"],"multiverseid":366338,"name":"Skyknight Legionnaire","subtypes":["Human","Knight"],"cmc":3,"rarity":"Common","artist":"Anthony Palumbo","power":"2","toughness":"2","manaCost":"{1}{R}{W}","text":"Flying, haste","flavor":"Millennium Platform, once a monument to peace, was quickly seized by the skyknights for its strategic aerial location.","number":"197","imageName":"skyknight legionnaire"},{"layout":"normal","type":"Creature - Human Warrior","types":["Creature"],"colors":["Black"],"multiverseid":366366,"name":"Slate Street Ruffian","subtypes":["Human","Warrior"],"cmc":3,"rarity":"Common","artist":"Jim Murray","power":"2","toughness":"2","manaCost":"{2}{B}","text":"Whenever Slate Street Ruffian becomes blocked, defending player discards a card.","flavor":"\"Merciless to the point of psychosis. Let's give him a job.\"\r\n\n—Zelinas, Orzhov recruiter","number":"78","imageName":"slate street ruffian"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":366281,"name":"Slaughterhorn","subtypes":["Beast"],"cmc":3,"rarity":"Common","artist":"Steve Prescott","power":"3","toughness":"2","manaCost":"{2}{G}","text":"Bloodrush — {G}, Discard Slaughterhorn: Target attacking creature gets +3/+2 until end of turn.","flavor":"The Orzhov clergy would never cross its path, but sending thrull couriers to do so is cheap and entertaining.","number":"134","imageName":"slaughterhorn"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":366456,"name":"Smite","cmc":1,"rarity":"Common","artist":"Zoltan Boros","manaCost":"{W}","text":"Destroy target blocked creature.","flavor":"\"Sure, today of all days, he asked to borrow my boots!\"\r\n\n—Darijo, Ivy Street ruffian","number":"25","rulings":[{"date":"2010-06-15","text":"A \"blocked creature\" is an attacking creature that has been blocked by  a creature this combat, or has become blocked as the result of a spell  or ability this combat. Unless the attacking creature leaves combat, it  continues to be a blocked creature through the end of combat step, even  if the creature or creatures that blocked it are no longer on the  battlefield or have otherwise left combat by then."}],"imageName":"smite"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Black"],"multiverseid":366257,"name":"Smog Elemental","subtypes":["Elemental"],"cmc":6,"rarity":"Uncommon","artist":"Yeong-Hao Han","power":"3","toughness":"3","manaCost":"{4}{B}{B}","text":"Flying\n\nCreatures with flying your opponents control get -1/-1.","flavor":"\"The skies used to be my refuge, a place of peace away from the chaos below. Now, with every flight, death seems to follow me like a shadow.\"\r\n\n—Writings of Cica, Skyjek scout","number":"79","imageName":"smog elemental"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue","Black"],"multiverseid":366351,"name":"Soul Ransom","subtypes":["Aura"],"cmc":4,"rarity":"Rare","artist":"Steve Argyle","manaCost":"{2}{U}{B}","text":"Enchant creature\n\nYou control enchanted creature.\n\nDiscard two cards: Soul Ransom's controller sacrifices it, then draws two cards. Only any opponent may activate this ability.","number":"198","rulings":[{"date":"2013-01-24","text":"Only an opponent of Soul Ransom’s controller can activate its last ability."},{"date":"2013-01-24","text":"In most cases, you’ll enchant a creature controlled by an opponent, which will cause you to gain control of that creature. Any of your opponents can activate the last ability of Soul Ransom by discarding two cards. When that ability resolves, you’ll sacrifice Soul Ransom and draw two cards."}],"imageName":"soul ransom"},{"layout":"normal","type":"Creature - Elemental Soldier","types":["Creature"],"colors":["White","Red"],"multiverseid":366422,"name":"Spark Trooper","subtypes":["Elemental","Soldier"],"cmc":4,"rarity":"Rare","artist":"James Ryman","power":"6","toughness":"1","manaCost":"{1}{R}{R}{W}","text":"Trample, lifelink, haste\n\nAt the beginning of the end step, sacrifice Spark Trooper.","flavor":"Izzet-designed conductors atop Sunhome charge empty sets of armor that give form to the fluctuating elementals.","number":"199","imageName":"spark trooper"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366372,"name":"Spell Rupture","cmc":2,"rarity":"Common","artist":"Kev Walker","manaCost":"{1}{U}","text":"Counter target spell unless its controller pays {X}, where X is the greatest power among creatures you control.","flavor":"\"Like water, mana will drain from an inferior vessel.\"\r\n\n—Jalan Tosk, Simic forcemage","number":"52","rulings":[{"date":"2013-01-24","text":"The value of X is the greatest power among creatures you control when Spell Rupture resolves. If you control no creatures at that time, X will be 0. The target spell’s controller can choose to pay {0} (simply by indicating he or she wishes to do so). That player can also choose to not pay {0} and the spell will be countered."}],"imageName":"spell rupture"},{"layout":"normal","type":"Creature - Elf Scout","types":["Creature"],"colors":["Green"],"multiverseid":366236,"name":"Spire Tracer","subtypes":["Elf","Scout"],"cmc":1,"rarity":"Common","artist":"Christopher Moeller","power":"1","toughness":"1","manaCost":"{G}","text":"Spire Tracer can't be blocked except by creatures with flying or reach.","flavor":"Cartographers on Ravnica chart not just the horizontal, but also the vertical.","number":"135","imageName":"spire tracer"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":366427,"name":"Stolen Identity","cmc":6,"rarity":"Rare","artist":"Clint Cearley","manaCost":"{4}{U}{U}","text":"Put a token onto the battlefield that's a copy of target artifact or creature.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"53","rulings":[{"date":"2013-01-24","text":"If the token you create is a copy of a creature, you can exile Stolen Identity encoded on that token."},{"date":"2013-01-24","text":"The token copies exactly what was printed on the original artifact or creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether it is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."},{"date":"2013-01-24","text":"If the copied permanent has {X} in its mana cost, X is considered to be zero."},{"date":"2013-01-24","text":"If the copied permanent is copying something else (for example, if the copied creature is a Clone), then the token enters the battlefield as whatever that creature copied."},{"date":"2013-01-24","text":"If the copied permanent is a token, the token that’s created copies the original characteristics of that token as stated by the effect that put the token onto the battlefield."},{"date":"2013-01-24","text":"Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."},{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"stolen identity"},{"layout":"normal","type":"Land - Mountain Forest","types":["Land"],"colors":[],"multiverseid":366232,"name":"Stomping Ground","subtypes":["Mountain","Forest"],"rarity":"Rare","artist":"David Palumbo","text":"({T}: Add {R} or {G} to your mana pool.)\n\nAs Stomping Ground enters the battlefield, you may pay 2 life. If you don't, Stomping Ground enters the battlefield tapped.","flavor":"\"Roots, ruins, and room to fight. All the comforts of home.\"\r\n\n—Domri Rade","number":"247","rulings":[{"date":"2005-10-01","text":"Has basic land types, but isn't a basic land.  Things that affect basic lands don't affect it.  For example, you can't find it with Civic Wayfinder."},{"date":"2005-10-01","text":"If another effect (such as Loxodon Gatekeeper's ability) tells you to put lands onto the battlefield tapped, it enters the battlefield tapped whether you pay 2 life or not."},{"date":"2005-10-01","text":"If multiple permanents with \"as enters the battlefield\" effects are entering the battlefield at the same time, process those effects one at a time, then put the permanents onto the battlefield all at once. For example, if you're at 3 life and an effect puts two of these onto the battlefield, you can pay 2 life for only one of them, not both."}],"imageName":"stomping ground"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":366376,"name":"Structural Collapse","cmc":6,"rarity":"Common","artist":"Sam Burley","manaCost":"{5}{R}","text":"Target player sacrifices an artifact and a land. Structural Collapse deals 2 damage to that player.","flavor":"The Gruul holiday of Rauck-Chauv always ends the same way.","number":"107","rulings":[{"date":"2013-01-24","text":"Structural Collapse targets only the player. The player can sacrifice an artifact or land with hexproof, for example."},{"date":"2013-01-24","text":"The target player needn’t control an artifact or a land. Structural Collapse will still deal 2 damage to that player."},{"date":"2013-01-24","text":"If the player controls an artifact land, he or she can’t choose to sacrifice that permanent for both the artifact and the land. If that’s the only artifact the player controls, he or she must sacrifice another land. If it’s the only land the player controls, he or she must sacrifice another artifact. If it’s the only artifact and the only land the player controls, he or she sacrifices just that permanent."}],"imageName":"structural collapse"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["White","Red"],"multiverseid":366429,"name":"Sunhome Guildmage","subtypes":["Human","Wizard"],"cmc":2,"rarity":"Uncommon","artist":"Eric Deschamps","power":"2","toughness":"2","manaCost":"{R}{W}","text":"{1}{R}{W}: Creatures you control get +1/+0 until end of turn.\n\n{2}{R}{W}: Put a 1/1 red and white Soldier creature token with haste onto the battlefield.","number":"200","rulings":[{"date":"2013-01-24","text":"Only creatures you control when Sunhome Guildmage’s first ability resolves will get +1/+0. Creatures that come under your control later in the turn will not."}],"imageName":"sunhome guildmage"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["Green"],"multiverseid":366282,"name":"Sylvan Primordial","subtypes":["Avatar"],"cmc":7,"rarity":"Rare","artist":"Stephan Martiniere","power":"6","toughness":"8","manaCost":"{5}{G}{G}","text":"Reach\n\nWhen Sylvan Primordial enters the battlefield, for each opponent, destroy target noncreature permanent that player controls. For each permanent destroyed this way, search your library for a Forest card and put that card onto the battlefield tapped. Then shuffle your library.","number":"136","rulings":[{"date":"2013-01-24","text":"You can choose a number of targets up to the number of opponents you have, one target per opponent."},{"date":"2013-01-24","text":"If Sylvan Primordial’s enters-the-battlefield ability resolves but one of the target noncreature permanents isn’t destroyed (perhaps because it is indestructible or it regenerated), it won’t count toward the number of Forest cards you can put onto the battlefield."},{"date":"2013-01-24","text":"You search and shuffle your library only once."}],"imageName":"sylvan primordial"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White"],"multiverseid":366387,"name":"Syndic of Tithes","subtypes":["Human","Cleric"],"cmc":2,"rarity":"Common","artist":"Steve Prescott","power":"2","toughness":"2","manaCost":"{1}{W}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"\"Entrance is free. Donations are required.\"\r\n\n—Notice outside Vizkopa Bank","number":"26","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"syndic of tithes"},{"layout":"normal","type":"Creature - Human Rogue","types":["Creature"],"colors":["Black"],"multiverseid":366243,"name":"Syndicate Enforcer","subtypes":["Human","Rogue"],"cmc":4,"rarity":"Common","artist":"Steven Belledin","power":"3","toughness":"2","manaCost":"{3}{B}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)","flavor":"Even the darkest corners of Ravnica still lie in the shadow of the Church.","number":"80","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"syndicate enforcer"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":366353,"name":"Thespian's Stage","rarity":"Rare","artist":"John Avon","text":"{T}: Add {1} to your mana pool.\n\n{2}, {T}: Thespian's Stage becomes a copy of target land and gains this ability.","flavor":"Amid rumors of war, the third act of The Absolution of the Guildpact was quickly rewritten as a tragedy.","number":"248","imageName":"thespian's stage"},{"layout":"normal","type":"Creature - Thrull","types":["Creature"],"colors":["Black"],"multiverseid":366437,"name":"Thrull Parasite","subtypes":["Thrull"],"cmc":1,"rarity":"Uncommon","artist":"Clint Cearley","power":"1","toughness":"1","manaCost":"{B}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n\n{T}, Pay 2 life: Remove a counter from target nonland permanent.","flavor":"The hunger of a vampire and the subtlety of a tax collector.","number":"81","rulings":[{"date":"2013-01-24","text":"The nonland permanent you choose as the target doesn’t have to have any counters on it. If it has more than one kind of counter, you’ll choose one of those counters when the ability resolves."},{"date":"2013-01-24","text":"You can’t activate Thrull Parasite’s last ability to stop a player from paying the cost of a spell or an ability that requires removing a counter from a permanent (such as a planeswalker’s loyalty ability)."},{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"thrull parasite"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red"],"multiverseid":366318,"name":"Tin Street Market","subtypes":["Aura"],"cmc":5,"rarity":"Common","artist":"Noah Bradley","manaCost":"{4}{R}","text":"Enchant land\n\nEnchanted land has \"{T}, Discard a card: Draw a card.\"","flavor":"\"Sometimes I stroll along Tin Street and watch citizens busy with their daily lives. It reminds me why I do my job.\"\r\n\n—Arrester Lavinia, Tenth Precinct","number":"108","imageName":"tin street market"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":366433,"name":"Totally Lost","cmc":5,"rarity":"Common","artist":"David Palumbo","manaCost":"{4}{U}","text":"Put target nonland permanent on top of its owner's library.","flavor":"Fblthp had always hated crowds.","number":"54","imageName":"totally lost"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366404,"name":"Tower Defense","cmc":2,"rarity":"Uncommon","artist":"Seb McKinnon","manaCost":"{1}{G}","text":"Creatures you control get +0/+5 and gain reach until end of turn.","flavor":"\"The drakes are practice. We may one day need to bring down a sky swallower, or maybe even Rakdos himself.\"\r\n\n—Korun Nar, Rubblebelt hunter","number":"137","rulings":[{"date":"2013-01-24","text":"Only creatures you control when Tower Defense resolves will get the bonuses. Creatures that come under your control later that turn will not."}],"imageName":"tower defense"},{"layout":"normal","type":"Creature - Giant Soldier","types":["Creature"],"colors":["Red"],"multiverseid":366355,"name":"Towering Thunderfist","subtypes":["Giant","Soldier"],"cmc":5,"rarity":"Common","artist":"Zoltan Boros","power":"4","toughness":"4","manaCost":"{4}{R}","text":"{W}: Towering Thunderfist gains vigilance until end of turn.","flavor":"\"Nothing ruins a party like one of those big killjoys bursting through the door and setting all the guests free.\"\r\n\n—Ruba, Rakdos cultist","number":"109","rulings":[{"date":"2013-01-24","text":"You must activate Towering Thunderfist’s ability before you declare attackers (at the latest, during the beginning of combat step) in order to have it attack without becoming tapped."}],"imageName":"towering thunderfist"},{"layout":"normal","type":"Creature - Thrull","types":["Creature"],"colors":["White","Black"],"multiverseid":366359,"name":"Treasury Thrull","subtypes":["Thrull"],"cmc":6,"rarity":"Rare","artist":"Mark Zug","power":"4","toughness":"4","manaCost":"{4}{W}{B}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n\nWhenever Treasury Thrull attacks, you may return target artifact, creature, or enchantment card from your graveyard to your hand.","number":"201","rulings":[{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"treasury thrull"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White","Red"],"multiverseid":366322,"name":"Truefire Paladin","subtypes":["Human","Knight"],"cmc":2,"rarity":"Uncommon","artist":"Michael C. Hayes","power":"2","toughness":"2","manaCost":"{R}{W}","text":"Vigilance\n\n{R}{W}: Truefire Paladin gets +2/+0 until end of turn.\n\n{R}{W}: Truefire Paladin gains first strike until end of turn.","number":"202","imageName":"truefire paladin"},{"layout":"normal","type":"Creature - Human Rogue","types":["Creature"],"colors":["Black"],"multiverseid":366271,"name":"Undercity Informer","subtypes":["Human","Rogue"],"cmc":3,"rarity":"Uncommon","artist":"Raymond Swanland","power":"2","toughness":"3","manaCost":"{2}{B}","text":"{1}, Sacrifice a creature: Target player reveals cards from the top of his or her library until he or she reveals a land card, then puts those cards into his or her graveyard.","flavor":"\"Scandal and slander are never welcome news. That's why I'm never the messenger.\"","number":"82","rulings":[{"date":"2013-01-24","text":"If the target player has no land cards in his or her library, all cards from that library will be revealed and put into his or her graveyard."}],"imageName":"undercity informer"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":366231,"name":"Undercity Plague","cmc":6,"rarity":"Rare","artist":"Vincent Proce","manaCost":"{4}{B}{B}","text":"Target player loses 1 life, discards a card, then sacrifices a permanent.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"83","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"undercity plague"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Green"],"multiverseid":366248,"name":"Unexpected Results","cmc":4,"rarity":"Rare","artist":"Mike Bierek","manaCost":"{2}{G}{U}","text":"Shuffle your library, then reveal the top card. If it's a nonland card, you may cast it without paying its mana cost. If it's a land card, you may put it onto the battlefield and return Unexpected Results to its owner's hand.","number":"203","rulings":[{"date":"2013-01-24","text":"If you reveal a nonland card, you may cast it during the resolution of Unexpected Results. Ignore timing restrictions based on the card’s type. Other timing restrictions, such as “Cast [this card] only during combat,” must be followed."},{"date":"2013-01-24","text":"If you can’t cast the card (perhaps because there are no legal targets), or if you choose not to, the card will remain on top of the library."},{"date":"2013-01-24","text":"If you cast a spell “without paying its mana cost,” you can’t pay alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the card has mandatory additional costs, you must pay those."},{"date":"2013-01-24","text":"If the card has {X} in its mana cost, you must choose 0 as its value."},{"date":"2013-01-24","text":"If you reveal a land card, Unexpected Results will be returned to your hand only if you put that land card onto the battlefield. If you don’t, Unexpected Results will be put into its owner’s graveyard."},{"date":"2013-01-24","text":"If you reveal a land card and put that card onto the battlefield, Unexpected Results will be put into its owner’s hand directly from the stack. It won’t be put into any graveyard."}],"imageName":"unexpected results"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Green"],"multiverseid":366419,"name":"Urban Evolution","cmc":5,"rarity":"Uncommon","artist":"Eytan Zana","manaCost":"{3}{G}{U}","text":"Draw three cards. You may play an additional land this turn.","flavor":"As the Simic released more of their krasis experiments, they required new habitats, always at the expense of the locals.","number":"204","rulings":[{"date":"2013-01-24","text":"Urban Evolution’s effect allows you to play an additional land during your main phase. Doing so follows the normal timing rules for playing lands. In particular, you don’t get to play a land as Urban Evolution resolves; Urban Evolution fully resolves (and you’ll draw three cards, perhaps including a land you’ll play later) first."},{"date":"2013-01-24","text":"The effects of multiple Urban Evolutions in the same turn are cumulative. They’re also cumulative with other effects that let you play additional lands, such as the one from Rites of Flourishing."},{"date":"2013-01-24","text":"If you somehow manage to cast Urban Evolution when it’s not your turn, you’ll draw three cards when it resolves, but you won’t be able to play a land that turn."}],"imageName":"urban evolution"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White"],"multiverseid":366415,"name":"Urbis Protector","subtypes":["Human","Cleric"],"cmc":6,"rarity":"Uncommon","artist":"Steve Argyle","power":"1","toughness":"1","manaCost":"{4}{W}{W}","text":"When Urbis Protector enters the battlefield, put a 4/4 white Angel creature token with flying onto the battlefield.","flavor":"\"I hear that Boros is losing its angels to the Gateless Movement. I'm sure this comes as no surprise to you.\"\r\n\n—Teysa, to Lazav","number":"27","imageName":"urbis protector"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":366471,"name":"Verdant Haven","subtypes":["Aura"],"cmc":3,"rarity":"Common","artist":"Daniel Ljunggren","manaCost":"{2}{G}","text":"Enchant land\n\nWhen Verdant Haven enters the battlefield, you gain 2 life.\n\nWhenever enchanted land is tapped for mana, its controller adds one mana of any color to his or her mana pool (in addition to the mana the land produces).","number":"138","imageName":"verdant haven"},{"layout":"normal","type":"Creature - Viashino Warrior","types":["Creature"],"colors":["Red"],"multiverseid":366264,"name":"Viashino Shanktail","subtypes":["Viashino","Warrior"],"cmc":4,"rarity":"Uncommon","artist":"Kev Walker","power":"3","toughness":"1","manaCost":"{3}{R}","text":"First strike\n\nBloodrush — {2}{R}, Discard Viashino Shanktail: Target attacking creature gets +3/+1 and gains first strike until end of turn.","flavor":"The Slizt Clan's battle cry is an impressive display of fury, defiance, and spit.","number":"110","imageName":"viashino shanktail"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White","Black"],"multiverseid":366267,"name":"Vizkopa Confessor","subtypes":["Human","Cleric"],"cmc":5,"rarity":"Uncommon","artist":"Ryan Pancoast","power":"1","toughness":"3","manaCost":"{3}{W}{B}","text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n\nWhen Vizkopa Confessor enters the battlefield, pay any amount of life. Target opponent reveals that many cards from his or her hand. You choose one of them and exile it.","number":"205","rulings":[{"date":"2013-01-24","text":"You may pay 0 life when Vizkopa Confessor’s enters-the-battlefield ability resolves. If you do, no cards are revealed or exiled."},{"date":"2013-01-24","text":"The amount of life you pay is chosen when Vizkopa Confessor’s last ability resolves."},{"date":"2013-01-24","text":"If the target opponent is an illegal target when Vizkopa Confessor’s last ability tries to resolve, it will be countered and none of its effects will happen. You won’t pay life and no player will reveal any cards."},{"date":"2013-04-15","text":"You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."},{"date":"2013-04-15","text":"The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent's life total can't change (perhaps because that player controls Platinum Emperion), you won't gain any life."},{"date":"2013-04-15","text":"The extort ability doesn't target any player."}],"imageName":"vizkopa confessor"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["White","Black"],"multiverseid":366371,"name":"Vizkopa Guildmage","subtypes":["Human","Wizard"],"cmc":2,"rarity":"Uncommon","artist":"Tyler Jacobson","power":"2","toughness":"2","manaCost":"{W}{B}","text":"{1}{W}{B}: Target creature gains lifelink until end of turn.\n\n{1}{W}{B}: Whenever you gain life this turn, each opponent loses that much life.","number":"206","rulings":[{"date":"2013-01-24","text":"Multiple instances of lifelink are redundant. Giving the same creature lifelink more than once won’t cause you to gain additional life."},{"date":"2013-01-24","text":"Each time the second ability resolves, a delayed triggered ability is created. Whenever you gain life that turn, each of those abilities will trigger. For example, if you activate the second ability twice (and let those abilities resolve) and then you gain 2 life, each opponent will lose a total of 4 life. Each instance will cause two abilities to trigger, each causing that player to lose 2 life."}],"imageName":"vizkopa guildmage"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":366474,"name":"Voidwalk","cmc":4,"rarity":"Uncommon","artist":"James Ryman","manaCost":"{3}{U}","text":"Exile target creature. Return it to the battlefield under its owner's control at the beginning of the next end step.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"55","rulings":[{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"voidwalk"},{"layout":"normal","type":"Creature - Elemental Soldier","types":["Creature"],"colors":["Red"],"multiverseid":366272,"name":"Warmind Infantry","subtypes":["Elemental","Soldier"],"cmc":3,"rarity":"Common","artist":"Greg Staples","power":"2","toughness":"3","manaCost":"{2}{R}","text":"Battalion — Whenever Warmind Infantry and at least two other creatures attack, Warmind Infantry gets +2/+0 until end of turn.","flavor":"Before Aurelia denounced Niv-Mizzet, the two guilds had collaborated on the Warmind Initiative in pursuit of the ultimate soldier.","number":"111","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"warmind infantry"},{"layout":"normal","type":"Creature - Snake","types":["Creature"],"colors":["Green"],"multiverseid":366417,"name":"Wasteland Viper","subtypes":["Snake"],"cmc":1,"rarity":"Uncommon","artist":"Lucas Graciano","power":"1","toughness":"2","manaCost":"{G}","text":"Deathtouch\n\nBloodrush — {G}, Discard Wasteland Viper: Target attacking creature gets +1/+2 and gains deathtouch until end of turn.","flavor":"\"The Gruul embrace all things poisonous and living in the cracks of society.\"\r\n\n—Teysa Karlov, Grand Envoy of Orzhov","number":"139","imageName":"wasteland viper"},{"layout":"normal","type":"Land - Island Swamp","types":["Land"],"colors":[],"multiverseid":366335,"name":"Watery Grave","subtypes":["Island","Swamp"],"rarity":"Rare","artist":"Raymond Swanland","text":"({T}: Add {U} or {B} to your mana pool.)\n\nAs Watery Grave enters the battlefield, you may pay 2 life. If you don't, Watery Grave enters the battlefield tapped.","flavor":"\"I fear that as we scurry after phantoms, the Dimir pull nine puppet strings.\"\r\n\n—Ral Zarek","number":"249","rulings":[{"date":"2005-10-01","text":"Has basic land types, but isn't a basic land.  Things that affect basic lands don't affect it.  For example, you can't find it with Civic Wayfinder."},{"date":"2005-10-01","text":"If another effect (such as Loxodon Gatekeeper's ability) tells you to put lands onto the battlefield tapped, it enters the battlefield tapped whether you pay 2 life or not."},{"date":"2005-10-01","text":"If multiple permanents with \"as enters the battlefield\" effects are entering the battlefield at the same time, process those effects one at a time, then put the permanents onto the battlefield all at once. For example, if you're at 3 life and an effect puts two of these onto the battlefield, you can pay 2 life for only one of them, not both."}],"imageName":"watery grave"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":366333,"name":"Way of the Thief","subtypes":["Aura"],"cmc":4,"rarity":"Common","artist":"Igor Kieryluk","manaCost":"{3}{U}","text":"Enchant creature\n\nEnchanted creature gets +2/+2.\n\nEnchanted creature is unblockable as long as you control a Gate.","flavor":"A true shortcut isn't a way other people don't know; it's a way other people can't go.","number":"56","imageName":"way of the thief"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue","Black"],"multiverseid":366263,"name":"Whispering Madness","cmc":4,"rarity":"Rare","artist":"Clint Cearley","manaCost":"{2}{U}{B}","text":"Each player discards his or her hand, then draws cards equal to the greatest number of cards a player discarded this way.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)","number":"207","rulings":[{"date":"2013-01-24","text":"Each player draws cards simultaneously. If this causes a player to draw more cards than are left in his or her library, that player will lose the game. If this causes all players to do so, the game is a draw. (In multiplayer games, multiple players drawing from an empty library will cause those players to lose although the game may continue.)"},{"date":"2013-01-24","text":"You’ll draw cards before deciding which creature (if any) Whispering Madness will be encoded on."},{"date":"2013-04-15","text":"The spell with cipher is encoded on the creature as part of that spell's resolution, just after the spell's other effects. That card goes directly from the stack to exile. It never goes to the graveyard."},{"date":"2013-04-15","text":"You choose the creature as the spell resolves. The cipher ability doesn't target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."},{"date":"2013-04-15","text":"If the spell with cipher is countered, none of its effects will happen, including cipher. The card will go to its owner's graveyard and won't be encoded on a creature."},{"date":"2013-04-15","text":"If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."},{"date":"2013-04-15","text":"If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."},{"date":"2013-04-15","text":"The copy of the card with cipher is created in and cast from exile."},{"date":"2013-04-15","text":"You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card's type."},{"date":"2013-04-15","text":"If you choose not to cast the copy, or you can't cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won't get a chance to cast the copy at a later time."},{"date":"2013-04-15","text":"The exiled card with cipher grants a triggered ability to the creature it's encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won't trigger. However, the exiled card will continue to be encoded on that creature."},{"date":"2013-04-15","text":"If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."},{"date":"2013-04-15","text":"If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}],"imageName":"whispering madness"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":366239,"name":"Wight of Precinct Six","subtypes":["Zombie"],"cmc":2,"rarity":"Uncommon","artist":"Ryan Barger","power":"1","toughness":"1","manaCost":"{1}{B}","text":"Wight of Precinct Six gets +1/+1 for each creature card in your opponents' graveyards.","flavor":"Even the lost and undead need a protector.","number":"84","rulings":[{"date":"2013-01-24","text":"Wight of Precinct Six’s ability applies only if Wight of Precinct Six is on the battlefield."}],"imageName":"wight of precinct six"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":366425,"name":"Wildwood Rebirth","cmc":2,"rarity":"Common","artist":"Dan Scott","manaCost":"{1}{G}","text":"Return target creature card from your graveyard to your hand.","flavor":"In Ravnica, there are maladies far more difficult to treat than death.","number":"140","imageName":"wildwood rebirth"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White","Red"],"multiverseid":366265,"name":"Wojek Halberdiers","subtypes":["Human","Soldier"],"cmc":2,"rarity":"Common","artist":"Nic Klein","power":"3","toughness":"2","manaCost":"{R}{W}","text":"Battalion — Whenever Wojek Halberdiers and at least two other creatures attack, Wojek Halberdiers gains first strike until end of turn.","flavor":"Tired of Boros interference, the Rakdos unleashed hellraiser goblins, hoping their corpses would weigh down the halberds.","number":"208","rulings":[{"date":"2013-04-15","text":"The three attacking creatures don't have to be attacking the same player or planeswalker."},{"date":"2013-04-15","text":"Once a battalion ability has triggered, it doesn't matter how many creatures are still attacking when that ability resolves."},{"date":"2013-04-15","text":"The effects of battalion abilities vary from card to card. Read each card carefully."}],"imageName":"wojek halberdiers"},{"layout":"normal","type":"Creature - Ogre Warrior","types":["Creature"],"colors":["Red"],"multiverseid":366446,"name":"Wrecking Ogre","subtypes":["Ogre","Warrior"],"cmc":5,"rarity":"Rare","artist":"Nils Hamm","power":"3","toughness":"3","manaCost":"{4}{R}","text":"Double strike\n\nBloodrush — {3}{R}{R}, Discard Wrecking Ogre: Target attacking creature gets +3/+3 and gains double strike until end of turn.","flavor":"If no opponent can be found, ogres of the Bolrac Clan will often pick fights with buildings.","number":"112","imageName":"wrecking ogre"},{"layout":"normal","type":"Creature - Elf Wizard","types":["Creature"],"colors":["Blue","Green"],"multiverseid":366454,"name":"Zameck Guildmage","subtypes":["Elf","Wizard"],"cmc":2,"rarity":"Uncommon","artist":"Chase Stone","power":"2","toughness":"2","manaCost":"{G}{U}","text":"{G}{U}: This turn, each creature you control enters the battlefield with an additional +1/+1 counter on it.\n\n{G}{U}, Remove a +1/+1 counter from a creature you control: Draw a card.","number":"209","rulings":[{"date":"2013-01-24","text":"Zameck Guildmage’s first ability is cumulative. For example, if it resolves twice in a turn, each creature that enters the battlefield under your control that turn will do so with two +1/+1 additional counters on it."},{"date":"2013-01-24","text":"Zameck Guildmage’s first ability has no effect on creatures already on the battlefield when it resolves."}],"imageName":"zameck guildmage"},{"layout":"normal","type":"Creature - Cat","types":["Creature"],"colors":["White"],"multiverseid":366249,"name":"Zarichi Tiger","subtypes":["Cat"],"cmc":4,"rarity":"Common","artist":"Nic Klein","power":"2","toughness":"3","manaCost":"{3}{W}","text":"{1}{W}, {T}: You gain 2 life.","flavor":"\"The taming and consecration of these creatures is evidence of our faith.\"\r\n\n—Resimir, Zarichi Temple priest","number":"28","imageName":"zarichi tiger"},{"layout":"normal","type":"Creature - Boar","types":["Creature"],"colors":["Red","Green"],"multiverseid":366252,"name":"Zhur-Taa Swine","subtypes":["Boar"],"cmc":5,"rarity":"Common","artist":"Yeong-Hao Han","power":"5","toughness":"4","manaCost":"{3}{R}{G}","text":"Bloodrush — {1}{R}{G}, Discard Zhur-Taa Swine: Target attacking creature gets +5/+4 until end of turn.","flavor":"Gurley was the first to domesticate one, though his widow didn't take much solace in that accomplishment.","number":"210","imageName":"zhur-taa swine"}]}