{"name":"Magic 2011","code":"M11","releaseDate":"2010-07-16","border":"black","cards":[{"layout":"normal","type":"Creature - Ooze","types":["Creature"],"colors":["Green"],"multiverseid":207333,"name":"Acidic Slime","subtypes":["Ooze"],"cmc":5,"rarity":"Uncommon","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{3}{G}{G}","text":"Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\n\nWhen Acidic Slime enters the battlefield, destroy target artifact, enchantment, or land.","number":"161","imageName":"acidic slime"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":205072,"name":"Act of Treason","cmc":3,"rarity":"Common","artist":"Eric Deschamps","manaCost":"{2}{R}","text":"Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn.","flavor":"\"Rage courses in every heart, yearning to betray its rational prison.\"\n\n—Sarkhan Vol","number":"121","rulings":[{"date":"2009-10-01","text":"Act of Treason can target any creature, even one that's untapped or one you already control."},{"date":"2010-08-15","text":"Gaining control of a creature doesn't cause you to gain control of any Auras or Equipment attached to it."}],"imageName":"act of treason"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":205020,"name":"Æther Adept","subtypes":["Human","Wizard"],"cmc":3,"rarity":"Common","artist":"Eric Deschamps","power":"2","toughness":"2","manaCost":"{1}{U}{U}","text":"When Æther Adept enters the battlefield, return target creature to its owner's hand.","flavor":"Some mages do their best work in solitude. Others do their best work creating it.","number":"41","rulings":[{"date":"2010-08-15","text":"If there are no other creatures on the battlefield when Æther Adept enters the battlefield, it must target itself."}],"imageName":"aether adept"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Blue"],"multiverseid":205070,"name":"Air Servant","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Lars Grant-West","power":"4","toughness":"3","manaCost":"{4}{U}","text":"Flying\n\n{2}{U}: Tap target creature with flying.","flavor":"\"Wind is forceful, yet ephemeral. It can knock a dragon out of the sky, yet pass through the smallest crack unhindered.\"\n\n—Jestus Dreya, Of Elements and Eternity","number":"42","imageName":"air servant"},{"layout":"normal","type":"Planeswalker - Ajani","types":["Planeswalker"],"colors":["White"],"multiverseid":205957,"name":"Ajani Goldmane","subtypes":["Ajani"],"cmc":4,"rarity":"Mythic Rare","artist":"Aleksi Briclot","loyalty":4,"manaCost":"{2}{W}{W}","text":"+1: You gain 2 life.\n\n-1: Put a +1/+1 counter on each creature you control. Those creatures gain vigilance until end of turn.\n\n-6: Put a white Avatar creature token onto the battlefield. It has \"This creature's power and toughness are each equal to your life total.\"","number":"1","rulings":[{"date":"2007-10-01","text":"The vigilance granted to a creature by the second ability remains until the end of the turn even if the +1/+1 counter is removed."},{"date":"2007-10-01","text":"The power and toughness of the Avatar created by the third ability will change as your life total changes."}],"imageName":"ajani goldmane"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":204987,"name":"Ajani's Mantra","cmc":2,"rarity":"Common","artist":"James Paick","manaCost":"{1}{W}","text":"At the beginning of your upkeep, you may gain 1 life.","flavor":"\"He hasn't returned to the Cloud Forest. But I can still sense his calming presence.\"\n\n—Zaliki of Naya","number":"2","imageName":"ajani's mantra"},{"layout":"normal","type":"Creature - Cat Soldier","types":["Creature"],"colors":["White"],"multiverseid":205065,"name":"Ajani's Pridemate","subtypes":["Cat","Soldier"],"cmc":2,"rarity":"Uncommon","artist":"Svetlin Velinov","power":"2","toughness":"2","manaCost":"{1}{W}","text":"Whenever you gain life, you may put a +1/+1 counter on Ajani's Pridemate. (For example, if an effect causes you to gain 3 life, you may put one +1/+1 counter on this creature.)","flavor":"\"When one of us prospers, the pride prospers.\"\n\n—Jazal Goldmane","number":"3","rulings":[{"date":"2010-08-15","text":"The ability triggers just once for each life-gaining event, whether it's 1 life from Angel's Feather or 4 life from Brindle Boar."},{"date":"2010-08-15","text":"If multiple creatures with lifelink you control deal combat damage at the same time, the damage dealt by each of those creatures is a separate life-gaining event and Ajani's Pridemate's ability will trigger that many times."},{"date":"2010-08-15","text":"If a creature with lifelink you control deals damage to multiple creatures and/or players at the same time, the ability will trigger just once. The damage dealt by that creature is a single life-gaining event."}],"imageName":"ajani's pridemate"},{"layout":"normal","type":"Creature - Siren","types":["Creature"],"colors":["Blue"],"multiverseid":205073,"name":"Alluring Siren","subtypes":["Siren"],"cmc":2,"rarity":"Uncommon","artist":"Chippy","power":"1","toughness":"1","manaCost":"{1}{U}","text":"{T}: Target creature an opponent controls attacks you this turn if able.","flavor":"\"The ground polluted floats with human gore,\n\nAnd human carnage taints the dreadful shore\n\nFly swift the dangerous coast: let every ear\n\nBe stopp'd against the song! 'tis death to hear!\"\n\n—Homer, The Odyssey, trans. Pope","number":"43","rulings":[{"date":"2009-10-01","text":"After the ability resolves, the targeted creature attacks you only if it's able to do so as that turn's declare attackers step begins. If, at that time, the creature is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" it can't attack. If there's a cost associated with having that creature attack, its controller isn't forced to pay that cost, so the creature doesn't have to attack in that case either."},{"date":"2009-10-01","text":"If the targeted creature would be able to attack either you or a planeswalker you control, it must attack you, not the planeswalker."},{"date":"2009-10-01","text":"Activating the ability during your opponent's turn after attackers have been declared will have no effect. The same is true if you activate the ability during your own turn."},{"date":"2011-09-22","text":"If there are multiple combat phases in a turn, the creature must attack only in the first one in which it's able to."}],"imageName":"alluring siren"},{"layout":"normal","type":"Creature - Dragon","types":["Creature"],"colors":["Red"],"multiverseid":204980,"name":"Ancient Hellkite","subtypes":["Dragon"],"cmc":7,"rarity":"Rare","artist":"Jason Chan","power":"6","toughness":"6","manaCost":"{4}{R}{R}{R}","text":"Flying\n\n{R}: Ancient Hellkite deals 1 damage to target creature defending player controls. Activate this ability only if Ancient Hellkite is attacking.","flavor":"When a dragon attacks, there are no bystanders.","number":"122","rulings":[{"date":"2010-08-15","text":"After Ancient Hellkite is declared as an attacker, or is put onto the battlefield attacking, its second ability may be activated. Unless Ancient Hellkite leaves combat, it continues to be attacking (so its ability may still be activated) through the end of combat step."}],"imageName":"ancient hellkite"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206325,"name":"Angel's Feather","cmc":2,"rarity":"Uncommon","artist":"Alan Pollack","manaCost":"{2}","text":"Whenever a player casts a white spell, you may gain 1 life.","flavor":"If taken, it cuts the hand that clutches it. If given, it heals the hand that holds it.","number":"201","rulings":[{"date":"2009-10-01","text":"The ability triggers whenever any player, not just you, casts a white spell."},{"date":"2009-10-01","text":"If a player casts a white spell, Angel's Feather's ability triggers and is put on the stack on top of that spell. Angel's Feather's ability will resolve (causing you to gain 1 life) before the spell does."}],"imageName":"angel's feather"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":204975,"name":"Angelic Arbiter","subtypes":["Angel"],"cmc":7,"rarity":"Rare","artist":"Steve Argyle","power":"5","toughness":"6","manaCost":"{5}{W}{W}","text":"Flying\n\nEach opponent who cast a spell this turn can't attack with creatures.\n\nEach opponent who attacked with a creature this turn can't cast spells.","number":"4","rulings":[{"date":"2010-08-15","text":"During your turn, Angelic Arbiter's abilities have no effect on the game."},{"date":"2010-08-15","text":"During an opponent's turn, that opponent may either cast spells or attack with creatures, but not both (assuming that Angelic Arbiter is on the battlefield for the entirety of that turn). The player may perform other actions, such as activating abilities and playing lands."},{"date":"2010-08-15","text":"If Angelic Arbiter leaves the battlefield during an opponent's turn, its abilities cease to affect the game. For example, if an opponent casts Doom Blade to destroy Angelic Arbiter, that player may then attack with creatures."},{"date":"2010-08-15","text":"If Angelic Arbiter enters the battlefield during an opponent's turn, its abilities take actions that player performed earlier in the turn into account, even though it wasn't on the battlefield at the time. For example, if an opponent casts a spell, then you use Leyline of Anticipation's ability to cast Angelic Arbiter as though it had flash, that player won't be able to attack with creatures that turn."},{"date":"2010-08-15","text":"Angelic Arbiter's last ability applies if an opponent attacked with at least one creature during the current turn."}],"imageName":"angelic arbiter"},{"layout":"normal","type":"Creature - Elemental Ox","types":["Creature"],"colors":["Red"],"multiverseid":204991,"name":"Arc Runner","subtypes":["Elemental","Ox"],"cmc":3,"rarity":"Common","artist":"Nils Hamm","power":"5","toughness":"1","manaCost":"{2}{R}","text":"Haste (This creature can attack and {T} as soon as it comes under your control.)\n\nAt the beginning of the end step, sacrifice Arc Runner.","flavor":"The storms of the wastelands form quickly and hit hard. Few have anything to do with rain.","number":"123","imageName":"arc runner"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":204997,"name":"Armored Ascension","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Jesper Ejsing","manaCost":"{3}{W}","text":"Enchant creature\n\nEnchanted creature gets +1/+1 for each Plains you control and has flying.","flavor":"With skill and strength honed upon the prairie, Naxtil won his battles high above it.","number":"5","rulings":[{"date":"2009-10-01","text":"This ability counts the number of Plains controlled by Armored Ascension's controller, not the enchanted creature's controller (in case they're different players)."},{"date":"2009-10-01","text":"This bonus is not fixed; it changes as the number of Plains you control changes."},{"date":"2010-08-15","text":"The ability cares about lands with the land type Plains, not necessarily lands named Plains."}],"imageName":"armored ascension"},{"layout":"normal","type":"Creature - Crab","types":["Creature"],"colors":["Blue"],"multiverseid":205083,"name":"Armored Cancrix","subtypes":["Crab"],"cmc":5,"rarity":"Common","artist":"Tomasz Jedruszek","power":"2","toughness":"5","manaCost":"{4}{U}","flavor":"Creatures displaced from time still turn up every year, stranded by the temporal disaster that once swept across Dominaria.","number":"44","imageName":"armored cancrix"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205217,"name":"Assassinate","cmc":3,"rarity":"Common","artist":"Kev Walker","manaCost":"{2}{B}","text":"Destroy target tapped creature.","flavor":"\"This is how wars are won—not with armies of soldiers but with a single knife blade, artfully placed.\"\n\n—Yurin, royal assassin","number":"81","imageName":"assassinate"},{"layout":"normal","type":"Creature - Griffin","types":["Creature"],"colors":["White"],"multiverseid":208296,"name":"Assault Griffin","subtypes":["Griffin"],"cmc":4,"rarity":"Common","artist":"Jesper Ejsing","power":"3","toughness":"2","manaCost":"{3}{W}","text":"Flying","flavor":"\"Fine soldiers guarded the northern front. They waited for two-legged foes and left the skies unheeded.\"\n\n—General Avitora","number":"6","imageName":"assault griffin"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["Blue"],"multiverseid":208225,"name":"Augury Owl","subtypes":["Bird"],"cmc":2,"rarity":"Common","artist":"Jim Nelson","power":"1","toughness":"1","manaCost":"{1}{U}","text":"Flying\n\nWhen Augury Owl enters the battlefield, scry 3. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)","number":"45","imageName":"augury owl"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":205051,"name":"Autumn's Veil","cmc":1,"rarity":"Uncommon","artist":"Kekai Kotaki","manaCost":"{G}","text":"Spells you control can't be countered by blue or black spells this turn, and creatures you control can't be the targets of blue or black spells this turn.","flavor":"The rustling of leaves and a passing shadow are a dryad's only trace.","number":"162","rulings":[{"date":"2010-08-15","text":"Autumn's Veil itself may be countered by blue or black spells. Its effect doesn't apply until after it resolves."},{"date":"2010-08-15","text":"After Autumn's Veil resolves, any spell you control that turn can still be targeted by spells that try to counter it (such as Cancel), regardless of their color. If those spells are blue or black at the time they would resolve, they will resolve, but the part of their effect that would counter the spell you control simply won't do anything. Any other effects those spells have will work as normal."},{"date":"2010-08-15","text":"If a creature you control is being targeted by a spell when Autumn's Veil resolves, nothing happens right away. When that spell would resolve, its color is checked. If it's blue or black, that creature will be an illegal target for that spell, and will be unable to be affected by it. If all that spell's targets have become illegal by the time it would resolve, it's countered."},{"date":"2010-08-15","text":"After Autumn's Veil resolves, no new blue or black spell may be cast that turn targeting a creature you control."},{"date":"2010-08-15","text":"Keep in mind that an Aura spell targets the permanent it will enchant (but an Aura on the battlefield doesn't target the permanent it's attached to)."},{"date":"2010-08-15","text":"Autumn's Veil affects any spells and creatures you happen to control at any point during the rest of the turn, not just spells and creatures you control as it resolves. That's because it doesn't grant an ability to those spells or creatures; rather, it affects the game rules and states something that's now true about those spells and creatures."},{"date":"2010-08-15","text":"Autumn's Veil has no effect on abilities. After it resolves, spells you control may be countered by abilities from blue or black sources, and creatures you control may be targeted by abilities from blue or black sources."}],"imageName":"autumn's veil"},{"layout":"normal","type":"Creature - Human Druid","types":["Creature"],"colors":["Green"],"multiverseid":205076,"name":"Awakener Druid","subtypes":["Human","Druid"],"cmc":3,"rarity":"Uncommon","artist":"Jason Chan","power":"1","toughness":"1","manaCost":"{2}{G}","text":"When Awakener Druid enters the battlefield, target Forest becomes a 4/5 green Treefolk creature for as long as Awakener Druid remains on the battlefield. It's still a land.","flavor":"The druids of Mazar treat each seedcone with respect for the warrior it will become.","number":"163","rulings":[{"date":"2009-10-01","text":"Awakener Druid's ability affects a land with the land type Forest, not necessarily a land with the name Forest."},{"date":"2009-10-01","text":"Awakener Druid's ability is mandatory. When it enters the battlefield, you must target a Forest (if there is one), even if you don't control that Forest."},{"date":"2009-10-01","text":"If Awakener Druid leaves the battlefield before its enters-the-battlefield ability resolves, nothing happens to the targeted Forest when that ability resolves. It won't become a creature."},{"date":"2009-10-01","text":"If the targeted Forest entered the battlefield this turn, it will be affected by \"summoning sickness\" once it becomes a Treefolk. You won't be able to attack with it or use its activated abilities that have {T} in the cost (including its mana ability)."},{"date":"2009-10-01","text":"If Awakener Druid and the Treefolk are dealt lethal damage at the same time, both will be destroyed. However, if Awakener Druid leaves the battlefield before the Treefolk is dealt damage, it will immediately revert to being just a land and thus can't be dealt damage."}],"imageName":"awakener druid"},{"layout":"normal","type":"Creature - Drake","types":["Creature"],"colors":["Blue"],"multiverseid":204984,"name":"Azure Drake","subtypes":["Drake"],"cmc":4,"rarity":"Common","artist":"Janine Johnston","power":"2","toughness":"4","manaCost":"{3}{U}","text":"Flying","flavor":"More so than \"storm\" or \"pirate,\" \"drake\" is the word a sailor least wants to hear.","number":"46","imageName":"azure drake"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":208284,"name":"Back to Nature","cmc":2,"rarity":"Uncommon","artist":"Howard Lyon","manaCost":"{1}{G}","text":"Destroy all enchantments.","flavor":"\"Nature is a mutable cloud which is always and never the same.\"\n\n—Ralph Waldo Emerson, Essays","number":"164","imageName":"back to nature"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":205077,"name":"Baneslayer Angel","subtypes":["Angel"],"cmc":5,"rarity":"Mythic Rare","artist":"Greg Staples","power":"5","toughness":"5","manaCost":"{3}{W}{W}","text":"Flying, first strike, lifelink, protection from Demons and from Dragons","flavor":"Some angels protect the meek and innocent. Others seek out and smite evil wherever it lurks.","number":"7","rulings":[{"date":"2009-10-01","text":"\"Protection from Demons and from Dragons\" means the following:\r\n-- Baneslayer Angel can't be blocked by creatures with the creature type Demon or the creature type Dragon.\r\n-- Baneslayer Angel can't be targeted abilities from sources with the creature type Demon or the creature type Dragon, or by spells with either of those types.\r\n-- All damage that would be dealt to Baneslayer Angel by sources with the creature type Demon or the creature type Dragon is prevented.\r\n-- Baneslayer Angel can't be enchanted by Auras or equipped by artifacts that have somehow gotten the creature type Demon or the creature type Dragon."}],"imageName":"baneslayer angel"},{"layout":"normal","type":"Creature - Vampire","types":["Creature"],"colors":["Black"],"multiverseid":205001,"name":"Barony Vampire","subtypes":["Vampire"],"cmc":3,"rarity":"Common","artist":"Daarken","power":"3","toughness":"2","manaCost":"{2}{B}","flavor":"\"Poor little sun-dweller out past curfew. And to think, you might have survived if it wasn't so close to suppertime.\"","number":"82","imageName":"barony vampire"},{"layout":"normal","type":"Creature - Human Berserker","types":["Creature"],"colors":["Red"],"multiverseid":205053,"name":"Berserkers of Blood Ridge","subtypes":["Human","Berserker"],"cmc":5,"rarity":"Common","artist":"Karl Kopinski","power":"4","toughness":"4","manaCost":"{4}{R}","text":"Berserkers of Blood Ridge attacks each turn if able.","flavor":"They take a blood oath to die in battle. So far none have failed to fulfill the promise.","number":"124","rulings":[{"date":"2010-08-15","text":"If, during your declare attackers step, Berserkers of Blood Ridge is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" then it doesn't attack. If there's a cost associated with having Berserkers of Blood Ridge attack, you aren't forced to pay that cost, so it doesn't have to attack in that case either."},{"date":"2010-08-15","text":"If there are multiple combat phases in a turn, Berserkers of Blood Ridge must attack only in the first one in which it's able to."}],"imageName":"berserkers of blood ridge"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["Green"],"multiverseid":207334,"name":"Birds of Paradise","subtypes":["Bird"],"cmc":1,"rarity":"Rare","artist":"Marcelo Vignali","power":"0","toughness":"1","manaCost":"{G}","text":"Flying\n\n{T}: Add one mana of any color to your mana pool.","flavor":"\"The gods used their feathers to paint all the colors of the world.\"\n\n—Yare-Tiva, warden of Gramur forest","number":"165","imageName":"birds of paradise"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["Black"],"multiverseid":205218,"name":"Black Knight","subtypes":["Human","Knight"],"cmc":2,"rarity":"Uncommon","artist":"Christopher Moeller","power":"2","toughness":"2","manaCost":"{B}{B}","text":"First strike (This creature deals combat damage before creatures without first strike.)\n\nProtection from white (This creature can't be blocked, targeted, dealt damage, or enchanted by anything white.)","number":"83","imageName":"black knight"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["White"],"multiverseid":205219,"name":"Blinding Mage","subtypes":["Human","Wizard"],"cmc":2,"rarity":"Common","artist":"Eric Deschamps","power":"1","toughness":"2","manaCost":"{1}{W}","text":"{W}, {T}: Tap target creature.","flavor":"\"I carry the light of truth. Do not pity those it blinds, for they never had eyes to see.\"","number":"8","imageName":"blinding mage"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205054,"name":"Blood Tithe","cmc":4,"rarity":"Common","artist":"Robh Ruppel","manaCost":"{3}{B}","text":"Each opponent loses 3 life. You gain life equal to the life lost this way.","flavor":"The Crimson Throne may be empty, but its coffers are full.","number":"84","imageName":"blood tithe"},{"layout":"normal","type":"Creature - Goblin Berserker","types":["Creature"],"colors":["Red"],"multiverseid":205007,"name":"Bloodcrazed Goblin","subtypes":["Goblin","Berserker"],"cmc":1,"rarity":"Common","artist":"Steve Prescott","power":"2","toughness":"2","manaCost":"{R}","text":"Bloodcrazed Goblin can't attack unless an opponent has been dealt damage this turn.","flavor":"\"A single drop of blood draws their attention, then they strip your bones clean before you have time to die.\"\n\n—Jamias, hermit of Telfer Peak","number":"125","rulings":[{"date":"2010-08-15","text":"For Bloodcrazed Goblin to be able to attack, an opponent must have been dealt damage that turn before the declare attackers step begins. The damage must have been noncombat damage of some sort, or it was combat damage and an additional combat phase has been created."},{"date":"2010-08-15","text":"It doesn't matter how an opponent was dealt damage, or even who controlled the source of the damage."},{"date":"2010-08-15","text":"If damage would have been dealt to an opponent but it was all prevented, redirected, or otherwise replaced, Bloodcrazed Goblin won't be able to attack."},{"date":"2010-08-15","text":"Bloodcrazed Goblin's ability checks only whether damage was dealt to an opponent. It doesn't care whether that opponent also gained life. For example, if an opponent was dealt 4 damage and gained 6 life during the turn, that player will have a higher life total than he or she started the turn with -- but Goblin Berserker will still be able to attack."},{"date":"2010-08-15","text":"If Bloodcrazed Goblin attacks, it doesn't have to attack the opponent who was dealt damage. It can attack a planeswalker. In a multiplayer game, it can attack a different opponent."}],"imageName":"bloodcrazed goblin"},{"layout":"normal","type":"Creature - Vampire","types":["Creature"],"colors":["Black"],"multiverseid":205238,"name":"Bloodthrone Vampire","subtypes":["Vampire"],"cmc":2,"rarity":"Common","artist":"Steve Argyle","power":"1","toughness":"1","manaCost":"{1}{B}","text":"Sacrifice a creature: Bloodthrone Vampire gets +2/+2 until end of turn.","flavor":"\"The underclass often forget that they are not tenants, or servants, but property.\"","number":"85","rulings":[{"date":"2010-06-15","text":"You can sacrifice Bloodthrone Vampire to activate its own ability, but  it won't be on the battlefield to get the bonus."},{"date":"2010-06-15","text":"If you sacrifice an attacking or blocking creature during the declare  blockers step, it won't deal combat damage. If you wait until the combat  damage step, but the creature you wish to sacrifice is dealt lethal damage, it'll be destroyed before you get a chance to sacrifice it."}],"imageName":"bloodthrone vampire"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":207105,"name":"Bog Raiders","subtypes":["Zombie"],"cmc":3,"rarity":"Common","artist":"Carl Critchlow","power":"2","toughness":"2","manaCost":"{2}{B}","text":"Swampwalk (This creature is unblockable as long as defending player controls a Swamp.)","flavor":"Zombies are the perfect marshland fighters—they don't need to breathe and they don't care what they step in.","number":"86","imageName":"bog raiders"},{"layout":"normal","type":"Creature - Boar","types":["Creature"],"colors":["Green"],"multiverseid":205039,"name":"Brindle Boar","subtypes":["Boar"],"cmc":3,"rarity":"Common","artist":"Dave Allsop","power":"2","toughness":"2","manaCost":"{2}{G}","text":"Sacrifice Brindle Boar: You gain 4 life.","flavor":"The war lasted for generations. The boars didn't need to hunt for food anymore. They fed on the fallen corpses, and the living fed off of them.","number":"166","rulings":[{"date":"2010-08-15","text":"If you sacrifice an attacking or blocking Brindle Boar during the declare blockers step, it won't deal combat damage. If you wait until the combat damage step, but Brindle Boar is dealt lethal damage, it'll be destroyed before you get a chance to sacrifice it."}],"imageName":"brindle boar"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":205002,"name":"Brittle Effigy","cmc":1,"rarity":"Rare","artist":"John Avon","manaCost":"{1}","text":"{4}, {T}, Exile Brittle Effigy: Exile target creature.","flavor":"\"In my early experiments in phylactery, I found that fragile forms have their uses.\" \n\n—Rocati, Duke of Martyne","number":"202","rulings":[{"date":"2010-08-15","text":"Brittle Effigy is exiled as a cost to activate its ability, not as part of its effect. If the targeted creature is an illegal target by the time the ability would resolve, the ability is countered, but Brittle Effigy remains exiled."}],"imageName":"brittle effigy"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":208218,"name":"Call to Mind","cmc":3,"rarity":"Uncommon","artist":"Terese Nielsen","manaCost":"{2}{U}","text":"Return target instant or sorcery card from your graveyard to your hand.","flavor":"\"It's hard to say which is more satisfying: the search for that missing piece or fitting that piece into place.\"\n\n—Evo Ragus","number":"47","imageName":"call to mind"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208217,"name":"Cancel","cmc":3,"rarity":"Common","artist":"David Palumbo","manaCost":"{1}{U}{U}","text":"Counter target spell.","number":"48","imageName":"cancel"},{"layout":"normal","type":"Creature - Minotaur Warrior","types":["Creature"],"colors":["Red"],"multiverseid":208000,"name":"Canyon Minotaur","subtypes":["Minotaur","Warrior"],"cmc":4,"rarity":"Common","artist":"Steve Prescott","power":"3","toughness":"3","manaCost":"{3}{R}","flavor":"\"We'll scale these cliffs, traverse Brittle Bridge, and then fight our way down the volcanic slopes on the other side.\"\n\n\"Isn't the shortest route through the canyon?\"\n\n\"Yes.\"\n\n\"So shouldn't we—\"\n\n\"No.\"","number":"126","imageName":"canyon minotaur"},{"layout":"normal","type":"Creature - Vampire","types":["Creature"],"colors":["Black"],"multiverseid":205041,"name":"Captivating Vampire","subtypes":["Vampire"],"cmc":3,"rarity":"Rare","artist":"Eric Deschamps","power":"2","toughness":"2","manaCost":"{1}{B}{B}","text":"Other Vampire creatures you control get +1/+1.\n\nTap five untapped Vampires you control: Gain control of target creature. It becomes a Vampire in addition to its other types.","number":"87","rulings":[{"date":"2010-08-15","text":"Since Captivating Vampire's activated ability doesn't have a tap symbol in its cost, you can tap a Vampire (including Captivating Vampire itself) that hasn't been under your control since your most recent turn began to pay the cost."},{"date":"2010-08-15","text":"The effect of Captivating Vampire's activated ability has no duration. You retain control of the affected creature until the game ends, the creature leaves the battlefield, or a later effect causes someone else to gain control of it. It doesn't matter whether Captivating Vampire remains on the battlefield. Similarly, the affected creature remains a Vampire in addition to its other types until the game ends, the creature leaves the battlefield, or a later effect changes its types or subtypes."},{"date":"2010-08-15","text":"Gaining control of a creature doesn't cause you gain control of any Auras or Equipment attached to it."}],"imageName":"captivating vampire"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":208290,"name":"Celestial Purge","cmc":2,"rarity":"Uncommon","artist":"David Palumbo","manaCost":"{1}{W}","text":"Exile target black or red permanent.","flavor":"\"They say only the good die young. Obviously, you are one of the exceptions.\"\n\n—Delrobah, cleric of Ivora Gate","number":"9","rulings":[{"date":"2009-10-01","text":"Lands are colorless (even if their frames have some colored elements to them). You can't target a Swamp, a Mountain, or any other land with Celestial Purge (unless some other effect has turned that land black or red)."}],"imageName":"celestial purge"},{"layout":"normal","type":"Planeswalker - Chandra","types":["Planeswalker"],"colors":["Red"],"multiverseid":205958,"name":"Chandra Nalaar","subtypes":["Chandra"],"cmc":5,"rarity":"Mythic Rare","artist":"Aleksi Briclot","loyalty":6,"manaCost":"{3}{R}{R}","text":"+1: Chandra Nalaar deals 1 damage to target player.\n\n-X: Chandra Nalaar deals X damage to target creature.\n\n-8: Chandra Nalaar deals 10 damage to target player and each creature he or she controls.","number":"127","rulings":[{"date":"2007-10-01","text":"To activate the second ability, you choose a value of X equal to or less than the number of loyalty counters on Chandra Nalaar. You may choose 0. You can't choose a negative number."}],"imageName":"chandra nalaar"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205071,"name":"Chandra's Outrage","cmc":4,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{2}{R}{R}","text":"Chandra's Outrage deals 4 damage to target creature and 2 damage to that creature's controller.","flavor":"\"Her mind is an incredible mix of emotion and power. Even if I could grasp it, I couldn't hold it for long.\"\n\n—Jace Beleren, on Chandra Nalaar","number":"128","rulings":[{"date":"2010-08-15","text":"The player who's dealt damage is the player who controls the targeted creature at the time Chandra's Outrage resolves."},{"date":"2010-08-15","text":"If the targeted creature is an illegal target by the time Chandra's Outrage resolves, the entire spell is countered. No player is dealt damage."}],"imageName":"chandra's outrage"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":205026,"name":"Chandra's Spitfire","subtypes":["Elemental"],"cmc":3,"rarity":"Uncommon","artist":"Justin Sweet","power":"1","toughness":"3","manaCost":"{2}{R}","text":"Flying\n\nWhenever an opponent is dealt noncombat damage, Chandra's Spitfire gets +3/+0 until end of turn.","flavor":"\"I've lit most everything on fire—trees, rocks, even the water. Now it's time to burn the clouds.\"","number":"129","rulings":[{"date":"2010-08-15","text":"Combat damage is the damage that's dealt automatically by attacking and blocking creatures, even if it's redirected (by Harm's Way, perhaps). Noncombat damage is any other damage (generally, it's damage dealt as the result of a spell or ability)."},{"date":"2010-08-15","text":"The ability triggers just once for each event in which an opponent is dealt noncombat damage, regardless of how much damage that player is dealt. For example, if Lava Axe deals 5 damage to an opponent, Chandra's Spitfire gets just +3/+0."},{"date":"2010-08-15","text":"In a multiplayer game, if a source such as Earthquake deals damage to multiple opponents at the same time, the ability will trigger that many times."}],"imageName":"chandra's spitfire"},{"layout":"normal","type":"Creature - Vampire","types":["Creature"],"colors":["Black"],"multiverseid":205122,"name":"Child of Night","subtypes":["Vampire"],"cmc":2,"rarity":"Common","artist":"Ash Wood","power":"2","toughness":"1","manaCost":"{1}{B}","text":"Lifelink (Damage dealt by this creature also causes you to gain that much life.)","flavor":"A vampire enacts vengeance on the entire world, claiming her debt two tiny pinpricks at a time.","number":"88","imageName":"child of night"},{"layout":"normal","type":"Creature - Shapeshifter","types":["Creature"],"colors":["Blue"],"multiverseid":205220,"name":"Clone","subtypes":["Shapeshifter"],"cmc":4,"rarity":"Rare","artist":"Kev Walker","power":"0","toughness":"0","manaCost":"{3}{U}","text":"You may have Clone enter the battlefield as a copy of any creature on the battlefield.","flavor":"The shapeshifter mimics with a twin's esteem and a mirror's cruelty.","number":"49","rulings":[{"date":"2007-07-15","text":"If the chosen creature is copying something else (for example, if the chosen creature is another Clone), then your Clone enters the battlefield as whatever the chosen creature copied."},{"date":"2007-07-15","text":"If the chosen creature is a token, Clone copies the original characteristics of that token as stated by the effect that put it onto the battlefield. Clone is not a token."},{"date":"2007-07-15","text":"Any enters-the-battlefield abilities of the copied creature will trigger when Clone enters the battlefield. Any \"as [this creature] enters the battlefield\" or \"[this creature] enters the battlefield with\" abilities of the chosen creature will also work."},{"date":"2009-10-01","text":"If the chosen creature has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."},{"date":"2012-07-01","text":"Clone copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."},{"date":"2012-07-01","text":"If Clone somehow enters the battlefield at the same time as another creature, Clone can't become a copy of that creature. You may only choose a creature that's already on the battlefield."},{"date":"2012-07-01","text":"You can choose not to copy anything. In that case, Clone enters the battlefield as a 0/0 Shapeshifter creature, and is probably put into the graveyard immediately."}],"imageName":"clone"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White"],"multiverseid":208287,"name":"Cloud Crusader","subtypes":["Human","Knight"],"cmc":4,"rarity":"Common","artist":"Aleksi Briclot","power":"2","toughness":"3","manaCost":"{2}{W}{W}","text":"Flying\n\nFirst strike (This creature deals combat damage before creatures without first strike.)","flavor":"Each crusader bonds with a griffin fledgling while still a child, and the two grow up as siblings.","number":"10","imageName":"cloud crusader"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Blue"],"multiverseid":208224,"name":"Cloud Elemental","subtypes":["Elemental"],"cmc":3,"rarity":"Common","artist":"Michael Sutfin","power":"2","toughness":"3","manaCost":"{2}{U}","text":"Flying\n\nCloud Elemental can block only creatures with flying.","flavor":"\"The sky teems with just as much life as the forest or the deep seas.\"\n\n—Hadi Kasten, Calla Dale naturalist","number":"50","imageName":"cloud elemental"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205011,"name":"Combust","cmc":2,"rarity":"Uncommon","artist":"Jaime Jones","manaCost":"{1}{R}","text":"Combust can't be countered by spells or abilities.\n\nCombust deals 5 damage to target white or blue creature. The damage can't be prevented.","number":"130","rulings":[{"date":"2010-08-15","text":"Combust can be targeted by spells and abilities that try to counter it (such as Cancel). Those spells and abilities will resolve, but the part of their effect that would counter Combust won't do anything. Any other effects those spells and abilities have will work as normal."},{"date":"2010-08-15","text":"If the targeted creature is an illegal target by the time Combust would resolve, Combust will be countered by the game rules."},{"date":"2010-08-15","text":"Spells that create prevention effects affecting the targeted creature can still be cast, and abilities that create prevention effects affecting the targeted creature can still be activated. However, damage prevention shields (including those created before Combust was cast) don't have any effect on the damage dealt by Combust. If such a prevention effect has an additional effect, the additional effect will still work (if possible)."},{"date":"2010-08-15","text":"If a static ability would prevent damage from being dealt to the targeted creature, it fails to prevent the damage dealt by Combust. If that ability has an additional effect that doesn't depend on the amount of damage prevented, that additional effect will still work. It's applied just once as Combust resolves."},{"date":"2010-08-15","text":"Effects that replace or redirect damage without using the word \"prevent\" aren't affected by Combust; they'll work as normal."},{"date":"2010-08-15","text":"If a creature is dealt lethal damage by Combust, it can still regenerate. If it does, the damage marked on it will be removed from it."}],"imageName":"combust"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":205098,"name":"Condemn","cmc":1,"rarity":"Uncommon","artist":"Daren Bader","manaCost":"{W}","text":"Put target attacking creature on the bottom of its owner's library. Its controller gains life equal to its toughness.","flavor":"\"No doubt the arbiters would put you away, after all the documents are signed. But I will have justice now.\"\n\n—Alovnek, Boros guildmage","number":"11","rulings":[{"date":"2010-08-15","text":"The affected creature's last known existence on the battlefield is checked to determine its toughness."}],"imageName":"condemn"},{"layout":"normal","type":"Creature - Sphinx","types":["Creature"],"colors":["Blue"],"multiverseid":204982,"name":"Conundrum Sphinx","subtypes":["Sphinx"],"cmc":4,"rarity":"Rare","artist":"Michael Komarck","power":"4","toughness":"4","manaCost":"{2}{U}{U}","text":"Flying\n\nWhenever Conundrum Sphinx attacks, each player names a card. Then each player reveals the top card of his or her library. If the card a player revealed is the card he or she named, that player puts it into his or her hand. If it's not, that player puts it on the bottom of his or her library.","number":"51","rulings":[{"date":"2010-08-15","text":"First the player whose turn it is names a card, then each other player in turn order does the same. Then each player reveals the top card of his or her library at the same time."},{"date":"2010-08-15","text":"If a card a player reveals this way is the card that particular player named, he or she must put it into his or her hand. Otherwise, he or she must put it on the bottom of his or her library, even if it's the card a different player named. In no cases can a player leave the revealed card on top of his or her library."}],"imageName":"conundrum sphinx"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":207106,"name":"Corrupt","cmc":6,"rarity":"Uncommon","artist":"Dave Allsop","manaCost":"{5}{B}","text":"Corrupt deals damage equal to the number of Swamps you control to target creature or player. You gain life equal to the damage dealt this way.","flavor":"The power of the fens sleeps lightly, and always awakens hungry.","number":"89","rulings":[{"date":"2004-10-04","text":"The swamps are counted on resolution."},{"date":"2010-08-15","text":"The life you gain is equal to the damage dealt by Corrupt, not necessarily to the number of Swamps you control (if some or all of the damage is prevented, for example)."},{"date":"2010-08-15","text":"The amount of damage dealt to a creature is not bounded by its toughness, and the amount of damage dealt to a player is not bounded by that player's life total. For example, if Corrupt deals 6 damage to a 2/2 creature, you'll gain 6 life."}],"imageName":"corrupt"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":205049,"name":"Crystal Ball","cmc":3,"rarity":"Uncommon","artist":"Ron Spencer","manaCost":"{3}","text":"{1}, {T}: Scry 2. (To scry 2, look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)","flavor":"It glints with arcane truths to those who know how to glimpse them.","number":"203","imageName":"crystal ball"},{"layout":"normal","type":"Creature - Troll","types":["Creature"],"colors":["Green"],"multiverseid":205084,"name":"Cudgel Troll","subtypes":["Troll"],"cmc":4,"rarity":"Uncommon","artist":"Jesper Ejsing","power":"4","toughness":"3","manaCost":"{2}{G}{G}","text":"{G}: Regenerate Cudgel Troll. (The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)","number":"167","rulings":[{"date":"2010-08-15","text":"Activating Cudgel Troll's ability causes a \"regeneration shield\" to be created for it. The next time Cudgel Troll would be destroyed that turn, the regeneration shield is used up instead. This works only if Cudgel Troll is dealt lethal damage, dealt damage from a source with deathtouch, or affected by a spell or ability that says to \"destroy\" it. Other effects that cause Cudgel Troll to be put into the graveyard (such as reducing its toughness to 0 or sacrificing it) don't destroy it, so regeneration won't save it. If it hasn't been used, the regeneration shield goes away as the turn ends."},{"date":"2010-08-15","text":"To work, the regeneration shield must be created before Cudgel Troll is destroyed. This usually means activating its ability during the declare blockers step, or in response to a spell or ability that would destroy it."},{"date":"2010-08-15","text":"If Cudgel Troll is dealt lethal damage and is dealt damage by a source with deathtouch during the same combat damage step, a single regeneration shield will save it."}],"imageName":"cudgel troll"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":204996,"name":"Cultivate","cmc":3,"rarity":"Common","artist":"Anthony Palumbo","manaCost":"{2}{G}","text":"Search your library for up to two basic land cards, reveal those cards, and put one onto the battlefield tapped and the other into your hand. Then shuffle your library.","flavor":"All seeds share a common bond, calling to each other across infinity.","number":"168","rulings":[{"date":"2010-08-15","text":"If you choose to find only one basic land card, you put it onto the battlefield tapped."}],"imageName":"cultivate"},{"layout":"normal","type":"Creature - Cyclops Warrior","types":["Creature"],"colors":["Red"],"multiverseid":205107,"name":"Cyclops Gladiator","subtypes":["Cyclops","Warrior"],"cmc":4,"rarity":"Rare","artist":"Kev Walker","power":"4","toughness":"4","manaCost":"{1}{R}{R}{R}","text":"Whenever Cyclops Gladiator attacks, you may have it deal damage equal to its power to target creature defending player controls. If you do, that creature deals damage equal to its power to Cyclops Gladiator.","number":"131","rulings":[{"date":"2010-08-15","text":"Cyclops Gladiator's ability triggers and resolves during the declare attackers step, before blockers are declared. If it survives, it continues to attack (presumably with some damage marked on it) and may be blocked."},{"date":"2010-08-15","text":"If the targeted creature leaves the battlefield (or otherwise becomes an illegal target) before the ability resolves, the ability is countered. Cyclops Gladiator isn't dealt damage."},{"date":"2010-08-15","text":"On the other hand, if Cyclops Gladiator leaves the battlefield before the ability resolves, the ability continues to resolve. Cyclops Gladiator deals damage to the targeted creature equal to the power it had as it last existed on the battlefield."}],"imageName":"cyclops gladiator"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":204979,"name":"Dark Tutelage","cmc":3,"rarity":"Rare","artist":"James Ryman","manaCost":"{2}{B}","text":"At the beginning of your upkeep, reveal the top card of your library and put that card into your hand. You lose life equal to its converted mana cost.","flavor":"\"It is a rough road that leads to the heights of greatness.\"\n\n—Seneca, Epistles, trans. Gummere","number":"90","rulings":[{"date":"2010-08-15","text":"The converted mana cost of the revealed card is determined solely by the mana symbols printed in its upper right corner. The converted mana cost is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {3}{U}{U} has converted mana cost 5."},{"date":"2010-08-15","text":"If the mana cost of the revealed card includes {X}, X is considered to be 0."},{"date":"2010-08-15","text":"If the revealed card has no mana symbols in its upper right corner (because it's a land card, for example), its converted mana cost is 0."}],"imageName":"dark tutelage"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":208297,"name":"Day of Judgment","cmc":4,"rarity":"Rare","artist":"Vincent Proce","manaCost":"{2}{W}{W}","text":"Destroy all creatures.","number":"12","imageName":"day of judgment"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":207100,"name":"Deathmark","cmc":1,"rarity":"Uncommon","artist":"Steven Belledin","manaCost":"{B}","text":"Destroy target green or white creature.","flavor":"There are few ways to escape the deathmark: bargaining with a demon, washing in the fabled waters of youth, and of course, death.","number":"91","imageName":"deathmark"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":208005,"name":"Demolish","cmc":4,"rarity":"Common","artist":"John Avon","manaCost":"{3}{R}","text":"Destroy target artifact or land.","number":"132","imageName":"demolish"},{"layout":"normal","type":"Creature - Demon","types":["Creature"],"colors":["Black"],"multiverseid":205131,"name":"Demon of Death's Gate","subtypes":["Demon"],"cmc":9,"rarity":"Mythic Rare","artist":"Vance Kovacs","power":"9","toughness":"9","manaCost":"{6}{B}{B}{B}","text":"You may pay 6 life and sacrifice three black creatures rather than pay Demon of Death's Gate's mana cost.\n\nFlying, trample","flavor":"The locks on the cages of the damned are opened with keys of marrow, sinew, and blood.","number":"92","rulings":[{"date":"2010-08-15","text":"Casting Demon of Death's Gate by paying its alternative cost doesn't change when you can cast it. You can cast it only at the normal time you could cast a creature spell."},{"date":"2010-08-15","text":"Casting Demon of Death's Gate by paying its alternative cost doesn't change its mana cost or converted mana cost."},{"date":"2010-08-15","text":"Effects that increase or reduce the cost to cast Demon of Death's Gate will apply to it even if you choose to pay its alternative cost."}],"imageName":"demon of death's gate"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206326,"name":"Demon's Horn","cmc":2,"rarity":"Uncommon","artist":"Alan Pollack","manaCost":"{2}","text":"Whenever a player casts a black spell, you may gain 1 life.","flavor":"Its curve mimics the twists of life and death.","number":"204","rulings":[{"date":"2009-10-01","text":"The ability triggers whenever any player, not just you, casts a black spell."},{"date":"2009-10-01","text":"If a player casts a black spell, Demon's Horn's ability triggers and is put on the stack on top of that spell. Demon's Horn's ability will resolve (causing you to gain 1 life) before the spell does."}],"imageName":"demon's horn"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":205046,"name":"Destructive Force","cmc":7,"rarity":"Rare","artist":"Jung Park","manaCost":"{5}{R}{R}","text":"Each player sacrifices five lands. Destructive Force deals 5 damage to each creature.","flavor":"The end of the world rarely comes quietly.","number":"133","rulings":[{"date":"2010-08-15","text":"First the player whose turn it is chooses five lands to sacrifice, then each other player in turn order does the same, then all chosen lands are sacrificed at the same time. After that, Destructive Force deals 5 damage to each creature."}],"imageName":"destructive force"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205222,"name":"Diabolic Tutor","cmc":4,"rarity":"Uncommon","artist":"Greg Staples","manaCost":"{2}{B}{B}","text":"Search your library for a card and put that card into your hand. Then shuffle your library.","flavor":"The wise always keep an ear open to the whispers of power.","number":"93","imageName":"diabolic tutor"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208226,"name":"Diminish","cmc":1,"rarity":"Common","artist":"Eric Deschamps","manaCost":"{U}","text":"Target creature becomes 1/1 until end of turn.","flavor":"\"‘That was a narrow escape!' said Alice, a good deal frightened at the sudden change, but very glad to find herself still in existence.\"\n\n—Lewis Carroll, Alice's Adventures in Wonderland","number":"52","rulings":[{"date":"2010-08-15","text":"Diminish overwrites all previous effects that set the targeted creature's power and toughness to specific values. Other effects that set its power or toughness to specific values that start to apply after Diminish resolves will overwrite this effect."},{"date":"2010-08-15","text":"Effects that modify the targeted creature's power or toughness, such as the effects of Giant Growth or Honor of the Pure, will apply to it no matter when they started to take effect. The same is true for counters that change the creature's power or toughness (such as +1/+1 counters) and effects that switch its power and toughness."}],"imageName":"diminish"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":207101,"name":"Disentomb","cmc":1,"rarity":"Common","artist":"Alex Horley-Orlandelli","manaCost":"{B}","text":"Return target creature card from your graveyard to your hand.","flavor":"The armies of the dead always report well rested.","number":"94","rulings":[{"date":"2009-10-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"disentomb"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":205088,"name":"Doom Blade","cmc":2,"rarity":"Common","artist":"Chippy","manaCost":"{1}{B}","text":"Destroy target nonblack creature.","flavor":"The void is without substance but cuts like steel.","number":"95","imageName":"doom blade"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206327,"name":"Dragon's Claw","cmc":2,"rarity":"Uncommon","artist":"Alan Pollack","manaCost":"{2}","text":"Whenever a player casts a red spell, you may gain 1 life.","flavor":"\"If there is a fire that never ceases to burn, it surely lies in the maw of a dragon.\"\n\n—Sarkhan Vol","number":"205","rulings":[{"date":"2009-10-01","text":"The ability triggers whenever any player, not just you, casts a red spell."},{"date":"2009-10-01","text":"If a player casts a red spell, Dragon's Claw's ability triggers and is put on the stack on top of that spell. Dragon's Claw's ability will resolve (causing you to gain 1 life) before the spell does."}],"imageName":"dragon's claw"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205089,"name":"Dragonskull Summit","rarity":"Rare","artist":"Jon Foster","text":"Dragonskull Summit enters the battlefield tapped unless you control a Swamp or a Mountain.\n\n{T}: Add {B} or {R} to your mana pool.","number":"223","rulings":[{"date":"2009-10-01","text":"This checks for lands you control with the land type Swamp or Mountain, not for lands named Swamp or Mountain. The lands it checks for don't have to be basic lands. For example, if you control Stomping Ground (a nonbasic land with the land types Mountain and Forest), Dragonskull Summit will enter the battlefield untapped."},{"date":"2009-10-01","text":"As This is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."}],"imageName":"dragonskull summit"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205090,"name":"Drowned Catacomb","rarity":"Rare","artist":"Dave Kendall","text":"Drowned Catacomb enters the battlefield tapped unless you control an Island or a Swamp.\n\n{T}: Add {U} or {B} to your mana pool.","number":"224","rulings":[{"date":"2009-10-01","text":"This checks for lands you control with the land type Island or Swamp, not for lands named Island or Swamp. The lands it checks for don't have to be basic lands. For example, if you control Blood Crypt (a nonbasic land with the land types Swamp and Mountain), Drowned Catacomb will enter the battlefield untapped."},{"date":"2009-10-01","text":"As This is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."}],"imageName":"drowned catacomb"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":205109,"name":"Dryad's Favor","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Jesper Ejsing","manaCost":"{G}","text":"Enchant creature\n\nEnchanted creature has forestwalk. (It's unblockable as long as defending player controls a Forest.)","flavor":"She grants knowledge of the ways to traverse the forest's invisible connections.","number":"169","rulings":[{"date":"2010-08-15","text":"Forestwalk cares about lands with the land type Forest, not necessarily lands named Forest."}],"imageName":"dryad's favor"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205024,"name":"Duress","cmc":1,"rarity":"Common","artist":"Steven Belledin","manaCost":"{B}","text":"Target opponent reveals his or her hand. You choose a noncreature, nonland card from it. That player discards that card.","flavor":"\"Don't worry. I'm not going to deprive you of all your secrets. Just your most precious one.\"\n\n—Liliana Vess","number":"96","imageName":"duress"},{"layout":"normal","type":"Creature - Wurm","types":["Creature"],"colors":["Green"],"multiverseid":207335,"name":"Duskdale Wurm","subtypes":["Wurm"],"cmc":7,"rarity":"Uncommon","artist":"Dan Dos Santos","power":"7","toughness":"7","manaCost":"{5}{G}{G}","text":"Trample (If this creature would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.)","number":"170","imageName":"duskdale wurm"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":204986,"name":"Earth Servant","subtypes":["Elemental"],"cmc":6,"rarity":"Uncommon","artist":"Lucas Graciano","power":"4","toughness":"4","manaCost":"{5}{R}","text":"Earth Servant gets +0/+1 for each Mountain you control.","flavor":"\"Fire. Air. Water. These elements spread, filling in the spaces they are not. But earth is implacable like a sullen child.\"\n\n—Jestus Dreya, Of Elements and Eternity","number":"134","rulings":[{"date":"2010-08-15","text":"The ability cares about lands with the land type Mountain, not necessarily lands named Mountain."}],"imageName":"earth servant"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":208291,"name":"Elite Vanguard","subtypes":["Human","Soldier"],"cmc":1,"rarity":"Uncommon","artist":"Mark Tedin","power":"2","toughness":"1","manaCost":"{W}","flavor":"The vanguard is skilled at waging war alone. The enemy is often defeated before its reinforcements reach the front.","number":"13","imageName":"elite vanguard"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":205061,"name":"Elixir of Immortality","cmc":1,"rarity":"Uncommon","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{1}","text":"{2}, {T}: You gain 5 life. Shuffle Elixir of Immortality and your graveyard into their owner's library.","flavor":"\"Bottled life. Not as tasty as I'm used to, rather stale, but it has the same effect.\"\n\n—Baron Sengir","number":"206","rulings":[{"date":"2010-08-15","text":"Paying the activation cost of Elixir of Immortality's ability doesn't cause it to leave the battlefield. If you have a way to untap it, you can activate the ability multiple times in response to itself."},{"date":"2011-09-22","text":"As the ability resolves, you'll shuffle Elixir of Immortality into its owner's library directly from the battlefield, if it's still there."},{"date":"2011-09-22","text":"If Elixir of Immortality is in your graveyard at the time the ability resolves, you'll still wind up shuffling it into your library because you shuffle your entire graveyard into your library. If it's anywhere else by that time, including in another player's graveyard, it remains where it is and you shuffle just your graveyard into your library."},{"date":"2011-09-22","text":"If you gain control of another player's Elixir of Immortality and activate it, the Elixir of Immortality will be shuffled into its owner's library and the cards in your graveyard will be shuffled into your library. You are considered to have shuffled each affected library (even if, as a shortcut, each player physically shuffles his or her own library)."}],"imageName":"elixir of immortality"},{"layout":"normal","type":"Creature - Elf Druid","types":["Creature"],"colors":["Green"],"multiverseid":205091,"name":"Elvish Archdruid","subtypes":["Elf","Druid"],"cmc":3,"rarity":"Rare","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{1}{G}{G}","text":"Other Elf creatures you control get +1/+1.\n\n{T}: Add {G} to your mana pool for each Elf you control.","flavor":"He knows the name of every elf born in the last four centuries. More importantly, they all know his.","number":"171","rulings":[{"date":"2009-10-01","text":"Elvish Archdruid's first ability affects only other Elves you control. However, Elvish Archdruid's second ability counts all Elves you control -- including itself."},{"date":"2011-09-22","text":"Elvish Archdruid's activated ability is a mana ability. It doesn't use the stack and players can't respond to it."}],"imageName":"elvish archdruid"},{"layout":"normal","type":"Creature - Goblin","types":["Creature"],"colors":["Red"],"multiverseid":208008,"name":"Ember Hauler","subtypes":["Goblin"],"cmc":2,"rarity":"Uncommon","artist":"Steve Prescott","power":"2","toughness":"2","manaCost":"{R}{R}","text":"{1}, Sacrifice Ember Hauler: Ember Hauler deals 2 damage to target creature or player.","flavor":"Flurk's crude goblin language didn't differentiate between \"I bring the flame\" and \"I am the flame.\"","number":"135","imageName":"ember hauler"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":208273,"name":"Excommunicate","cmc":3,"rarity":"Common","artist":"Matt Stewart","manaCost":"{2}{W}","text":"Put target creature on top of its owner's library.","flavor":"\"Our law prohibits capital punishment. We believe even the gravest offenders have the chance to redeem themselves.\"\n\n—Torian Sha, soul warden","number":"14","imageName":"excommunicate"},{"layout":"normal","type":"Creature - Elf Shaman","types":["Creature"],"colors":["Green"],"multiverseid":205059,"name":"Fauna Shaman","subtypes":["Elf","Shaman"],"cmc":2,"rarity":"Rare","artist":"Steve Prescott","power":"2","toughness":"2","manaCost":"{1}{G}","text":"{G}, {T}, Discard a creature card: Search your library for a creature card, reveal it, and put it into your hand. Then shuffle your library.","flavor":"She wears the talismans of every creature she can evoke.","number":"172","imageName":"fauna shaman"},{"layout":"normal","type":"Creature - Elemental Hound","types":["Creature"],"colors":["Red"],"multiverseid":205093,"name":"Fiery Hellhound","subtypes":["Elemental","Hound"],"cmc":3,"rarity":"Common","artist":"Ted Galaday","power":"2","toughness":"2","manaCost":"{1}{R}{R}","text":"{R}: Fiery Hellhound gets +1/+0 until end of turn.","flavor":"\"I had hoped to instill in it the loyalty of a guard dog, but with fire's power comes its unpredictability.\"\n\n—Maggath, Sardian elementalist","number":"136","imageName":"fiery hellhound"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":204992,"name":"Fire Servant","subtypes":["Elemental"],"cmc":5,"rarity":"Uncommon","artist":"Ryan Yee","power":"4","toughness":"3","manaCost":"{3}{R}{R}","text":"If a red instant or sorcery spell you control would deal damage, it deals double that damage instead.","flavor":"\"Elemental fire shimmers with rose hues and, unlike terrestrial blazes, smolders long after it's extinguished.\"\n\n—Jestus Dreya, Of Elements and Eternity","number":"137","rulings":[{"date":"2010-08-15","text":"Fire Servant's ability applies no matter who or what the damage would be dealt to: a creature, a player, or a planeswalker."},{"date":"2010-08-15","text":"If a red instant or sorcery spell you control causes damage to be dealt, that spell will always identify the source of the damage. In most cases, the source is the spell itself. For example, Lightning Bolt says \"Lightning Bolt deals 3 damage to target creature or player.\" Such a spell is affected by Fire Servant's ability. If the source of the damage is something else (for example, if the spell is Soul's Fire, which says \"Target creature you control on the battlefield deals damage equal to its power to target creature or player\"), it isn't affected by Fire Servant's ability."},{"date":"2010-08-15","text":"If multiple effects modify how damage will be dealt, the player who would be dealt damage or the controller of the permanent that would be dealt damage chooses the order to apply the effects. For example, Mending Hands says, \"Prevent the next 4 damage that would be dealt to target creature or player this turn\" and Lava Axe is a red sorcery that says \"Lava Axe deals 5 damage to target player.\" Suppose a Lava Axe controlled by a player who controls Fire Servant would deal 5 damage to a player who has cast Mending Hands targeting him or herself. The player who would be dealt damage can either (a) prevent 4 damage first and then let Fire Servant's effect double the remaining 1 damage, taking 2 damage, or (b) double the damage to 10 and then prevent 4 damage, taking 6 damage."},{"date":"2010-08-15","text":"If a red instant or sorcery spell you control divides damage among multiple recipients (such as Fireball does), the damage is divided before Fire Servant's effect doubles it."},{"date":"2010-08-15","text":"If you control more than one Fire Servant, the effects are cumulative. Two such effects will cause damage from red instant or sorcery spells you control to be multiplied by four; three such effects will cause damage from red instant or sorcery spells you control to be multiplied by eight."}],"imageName":"fire servant"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":205223,"name":"Fireball","cmc":1,"rarity":"Uncommon","artist":"Dave Dorman","manaCost":"{X}{R}","text":"Fireball deals X damage divided evenly, rounded down, among any number of target creatures and/or players.\n\nFireball costs {1} more to cast for each target beyond the first.","number":"138","rulings":[{"date":"2004-12-01","text":"The additional cost is paid when you pay the rest of Fireball's costs, even though that text appears second on the card (to make the card easier to read). The additional cost doesn't count toward Fireball's converted mana cost."},{"date":"2004-12-01","text":"If, for example, X is 5 and you choose three target creatures, Fireball has a total cost of {7}{R} (even though its mana cost is just {5}{R}). If those creatures are all still legal targets as Fireball resolves, it deals 1 damage to each of them."},{"date":"2009-05-01","text":"You may cast Fireball with zero targets, regardless of the value chosen for X. If you do so, it will not be a targeted spell, and no damage will actually be dealt when it resolves."},{"date":"2009-10-01","text":"Fireball's damage is divided as Fireball resolves, not as it's cast, because there are no choices involved. The division involves only targets that are still legal at that time."},{"date":"2009-10-01","text":"You can target more than X creatures. However, if the number of legal targets at the time Fireball resolves is greater than X, none of them will be dealt any damage."}],"imageName":"fireball"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208219,"name":"Flashfreeze","cmc":2,"rarity":"Uncommon","artist":"Brian Despain","manaCost":"{1}{U}","text":"Counter target red or green spell.","flavor":"\"Your downfall was not your ignorance, your weakness, or your hubris, but your warm blood.\"\n\n—Heidar, Rimewind master","number":"53","imageName":"flashfreeze"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":208001,"name":"Fling","cmc":2,"rarity":"Common","artist":"Parente","manaCost":"{1}{R}","text":"As an additional cost to cast Fling, sacrifice a creature.\n\nFling deals damage equal to the sacrificed creature's power to target creature or player.","flavor":"Sometimes the cannoneer must become the cannonball.","number":"139","rulings":[{"date":"2010-08-15","text":"The sacrificed creature's last known existence on the battlefield is checked to determine its power."},{"date":"2010-08-15","text":"If you sacrifice an attacking or blocking creature during the declare blockers step, it won't deal combat damage. If you wait until the combat damage step, but that creature is dealt lethal damage, it'll be destroyed before you get a chance to sacrifice it."},{"date":"2013-04-15","text":"You must sacrifice exactly one creature to cast this spell; you cannot cast it without sacrificing a creature, and you cannot sacrifice additional creatures."},{"date":"2013-04-15","text":"Players can only respond once this spell has been cast and all its costs have been paid. No one can try to destroy the creature you sacrificed to prevent you from casting this spell."}],"imageName":"fling"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":205064,"name":"Fog","cmc":1,"rarity":"Common","artist":"John Avon","manaCost":"{G}","text":"Prevent all combat damage that would be dealt this turn.","flavor":"\"I fear no army or beast, but only the morning fog. Our assault can survive everything else.\"\n\n—Lord Hilneth","number":"173","rulings":[{"date":"2009-10-01","text":"Fog has no effect on damage that's already been dealt."}],"imageName":"fog"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":205068,"name":"Foresee","cmc":4,"rarity":"Common","artist":"Ron Spears","manaCost":"{3}{U}","text":"Scry 4, then draw two cards. (To scry 4, look at the top four cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)","flavor":"Two eyes to see what could be, two eyes to see what will.","number":"54","imageName":"foresee"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":213628,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Rob Alexander","text":"G","number":"246","variations":[213630,213631,213629],"imageName":"forest1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":213629,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"John Avon","text":"G","number":"247","variations":[213630,213631,213628],"imageName":"forest2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":213630,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Steven Belledin","text":"G","number":"248","variations":[213631,213628,213629],"imageName":"forest3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":213631,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Jim Nelson","text":"G","number":"249","variations":[213630,213628,213629],"imageName":"forest4"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["Blue"],"multiverseid":204999,"name":"Frost Titan","subtypes":["Giant"],"cmc":6,"rarity":"Mythic Rare","artist":"Mike Bierek","power":"6","toughness":"6","manaCost":"{4}{U}{U}","text":"Whenever Frost Titan becomes the target of a spell or ability an opponent controls, counter that spell or ability unless its controller pays {2}.\n\nWhenever Frost Titan enters the battlefield or attacks, tap target permanent. It doesn't untap during its controller's next untap step.","number":"55","rulings":[{"date":"2010-08-15","text":"Frost Titan's first ability affects each spell (including Aura spells), activated ability, and triggered ability that's controlled by an opponent and that Frost Titan becomes a target of."},{"date":"2010-08-15","text":"You may target any permanent with Frost Titan's second ability. It's okay if that permanent is already tapped."},{"date":"2010-08-15","text":"If the permanent affected by Frost Titan's second ability is untapped at the time that permanent's controller's next untap step begins, the last part of Frost Titan's second ability has no effect."},{"date":"2010-08-15","text":"If the permanent affected by Frost Titan's second ability changes controllers before its old controller's next untap step, Frost Titan's second ability will prevent it from being untapped during its new controller's next untap step."}],"imageName":"frost titan"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Green"],"multiverseid":205033,"name":"Gaea's Revenge","subtypes":["Elemental"],"cmc":7,"rarity":"Mythic Rare","artist":"Kekai Kotaki","power":"8","toughness":"5","manaCost":"{5}{G}{G}","text":"Gaea's Revenge can't be countered.\n\nHaste\n\nGaea's Revenge can't be the target of nongreen spells or abilities from nongreen sources.","number":"174","rulings":[{"date":"2010-08-15","text":"Gaea's Revenge's first ability works only while it's a spell on the stack. Gaea's Revenge's last ability works only while it's on the battlefield."},{"date":"2010-08-15","text":"A Gaea's Revenge spell can be targeted by spells and abilities that try to counter it (such as Cancel). Those spells and abilities will resolve, but the part of their effect that would counter Gaea's Revenge won't do anything. Any other effects those spells and abilities have will work as normal."},{"date":"2010-08-15","text":"Gaea's Revenge's last ability applies to all nongreen spells and abilities from nongreen sources, including ones you control. For example, you can't target it with the equip ability of an Equipment you control (unless the Equipment is somehow green)."}],"imageName":"gaea's revenge"},{"layout":"normal","type":"Artifact Creature - Gargoyle","types":["Artifact","Creature"],"colors":[],"multiverseid":204985,"name":"Gargoyle Sentinel","subtypes":["Gargoyle"],"cmc":3,"rarity":"Uncommon","artist":"Drew Baker","power":"3","toughness":"3","manaCost":"{3}","text":"Defender (This creature can't attack.)\n\n{3}: Until end of turn, Gargoyle Sentinel loses defender and gains flying.","flavor":"\"Do not mistake a quiet rampart for one that is unguarded. Some things stir only when they need to.\"\n\n—Bonovar, siege commander","number":"207","imageName":"gargoyle sentinel"},{"layout":"normal","type":"Planeswalker - Garruk","types":["Planeswalker"],"colors":["Green"],"multiverseid":205959,"name":"Garruk Wildspeaker","subtypes":["Garruk"],"cmc":4,"rarity":"Mythic Rare","artist":"Aleksi Briclot","loyalty":3,"manaCost":"{2}{G}{G}","text":"+1: Untap two target lands.\n\n-1: Put a 3/3 green Beast creature token onto the battlefield.\n\n-4: Creatures you control get +3/+3 and gain trample until end of turn.","number":"175","rulings":[{"date":"2009-10-01","text":"The first ability can target any two lands. They don't have to be tapped."},{"date":"2009-10-01","text":"The third ability affects only creatures you control at the time it resolves. It won't affect creatures that come under your control later in the turn."}],"imageName":"garruk wildspeaker"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":205025,"name":"Garruk's Companion","subtypes":["Beast"],"cmc":2,"rarity":"Common","artist":"Efrem Palacios","power":"3","toughness":"2","manaCost":"{G}{G}","text":"Trample (If this creature would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.)","number":"176","imageName":"garruk's companion"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":205060,"name":"Garruk's Packleader","subtypes":["Beast"],"cmc":5,"rarity":"Uncommon","artist":"Nils Hamm","power":"4","toughness":"4","manaCost":"{4}{G}","text":"Whenever another creature with power 3 or greater enters the battlefield under your control, you may draw a card.","flavor":"\"He has learned much in his long years. And unlike selfish humans, he's willing to share.\"\n\n—Garruk Wildspeaker","number":"177","rulings":[{"date":"2010-08-15","text":"If Garruk's Packleader and another creature with power 3 or greater enter the battlefield under your control at the same time, the ability will trigger."},{"date":"2012-07-01","text":"The ability checks the power of each creature as it enters the battlefield. It will take into account counters the permanent enters the battlefield with and static abilities that affect its power (such as Flinthoof Boar's ability). After the creature is on the battlefield, raising its power with a spell (such as Titanic Growth), an activated ability, or a triggered ability won't cause this ability to retroactively trigger."},{"date":"2012-07-01","text":"The creature's power is checked only to see if the ability triggers. It doesn't matter what the creature's power is when the ability resolves."}],"imageName":"garruk's packleader"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":205224,"name":"Giant Growth","cmc":1,"rarity":"Common","artist":"Matt Cavotta","manaCost":"{G}","text":"Target creature gets +3/+3 until end of turn.","number":"178","imageName":"giant growth"},{"layout":"normal","type":"Creature - Spider","types":["Creature"],"colors":["Green"],"multiverseid":205225,"name":"Giant Spider","subtypes":["Spider"],"cmc":4,"rarity":"Common","artist":"Randy Gallegos","power":"2","toughness":"4","manaCost":"{3}{G}","text":"Reach (This creature can block creatures with flying.)","flavor":"The giant spider's silk naturally resists gravity, almost weaving itself as it blankets the forest canopy.","number":"179","rulings":[{"date":"2008-04-01","text":"This card now uses the Reach keyword ability to enable the blocking of flying creatures. This works because a creature with flying can only be blocked by creatures with flying or reach."}],"imageName":"giant spider"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205094,"name":"Glacial Fortress","rarity":"Rare","artist":"Franz Vohwinkel","text":"Glacial Fortress enters the battlefield tapped unless you control a Plains or an Island.\n\n{T}: Add {W} or {U} to your mana pool.","number":"225","rulings":[{"date":"2009-10-01","text":"This checks for lands you control with the land type Plains or Island, not for lands named Plains or Island. The lands it checks for don't have to be basic lands. For example, if you control Watery Grave (a nonbasic land with the land types Island and Swamp), Glacial Fortress will enter the battlefield untapped."},{"date":"2009-10-01","text":"As This is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."}],"imageName":"glacial fortress"},{"layout":"normal","type":"Creature - Goblin Warrior","types":["Creature"],"colors":["Red"],"multiverseid":208010,"name":"Goblin Balloon Brigade","subtypes":["Goblin","Warrior"],"cmc":1,"rarity":"Common","artist":"Lars Grant-West","power":"1","toughness":"1","manaCost":"{R}","text":"{R}: Goblin Balloon Brigade gains flying until end of turn.","flavor":"\"The enemy is getting too close! Quick! Inflate the toad!\"","number":"140","rulings":[{"date":"2008-08-01","text":"You can activate the ability repeatedly during a turn. This generally has no additional effect, unless some other effect (like that from Adarkar Windform has caused it to lose flying since the last time the ability resolved."},{"date":"2010-08-15","text":"For flying to work as an evasion ability, an attacking Goblin Balloon Brigade's ability must be activated before the declare blockers step begins. Once Goblin Balloon Brigade has become blocked, giving it flying won't change that."}],"imageName":"goblin balloon brigade"},{"layout":"normal","type":"Creature - Goblin","types":["Creature"],"colors":["Red"],"multiverseid":205096,"name":"Goblin Chieftain","subtypes":["Goblin"],"cmc":3,"rarity":"Rare","artist":"Sam Wood","power":"2","toughness":"2","manaCost":"{1}{R}{R}","text":"Haste (This creature can attack and {T} as soon as it comes under your control.)\n\nOther Goblin creatures you control get +1/+1 and have haste.","flavor":"\"We are goblinkind, heirs to the mountain empires of chieftains past. Rest is death to us, and arson is our call to war.\"","number":"141","imageName":"goblin chieftain"},{"layout":"normal","type":"Creature - Goblin Warrior","types":["Creature"],"colors":["Red"],"multiverseid":205052,"name":"Goblin Piker","subtypes":["Goblin","Warrior"],"cmc":2,"rarity":"Common","artist":"DiTerlizzi","power":"2","toughness":"1","manaCost":"{1}{R}","flavor":"Once he'd worked out which end of the thing was sharp, he was promoted to guard duty.","number":"142","imageName":"goblin piker"},{"layout":"normal","type":"Creature - Goblin Rogue","types":["Creature"],"colors":["Red"],"multiverseid":207999,"name":"Goblin Tunneler","subtypes":["Goblin","Rogue"],"cmc":2,"rarity":"Common","artist":"Jesper Ejsing","power":"1","toughness":"1","manaCost":"{1}{R}","text":"{T}: Target creature with power 2 or less is unblockable this turn.","flavor":"\"You never know what's going to be in goblin tunnels. Even in the best case, there will still be goblins.\"\n\n—Sachir, Akoum Expeditionary House","number":"143","rulings":[{"date":"2010-06-15","text":"The power of the targeted creature is checked both as you target it  and as the ability resolves. After the ability resolves, the creature  will remain unblockable even if its power becomes greater than 2."},{"date":"2010-06-15","text":"The ability doesn't grant an ability to the targeted creature. Rather,  it affects the game rules and states something that's now true about  that creature. After the ability resolves, the creature will remain  unblockable for the rest of the turn even if it loses all abilities."}],"imageName":"goblin tunneler"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["White"],"multiverseid":208295,"name":"Goldenglow Moth","subtypes":["Insect"],"cmc":1,"rarity":"Common","artist":"Howard Lyon","power":"0","toughness":"1","manaCost":"{W}","text":"Flying\n\nWhenever Goldenglow Moth blocks, you may gain 4 life.","flavor":"\"Little moth, fluttering bright,\n\nWhat luck will you bring tonight?\"\n\n—Benalish children's rhyme","number":"15","imageName":"goldenglow moth"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["Black"],"multiverseid":205012,"name":"Grave Titan","subtypes":["Giant"],"cmc":6,"rarity":"Mythic Rare","artist":"Nils Hamm","power":"6","toughness":"6","manaCost":"{4}{B}{B}","text":"Deathtouch\n\nWhenever Grave Titan enters the battlefield or attacks, put two 2/2 black Zombie creature tokens onto the battlefield.","flavor":"Death in form and function.","number":"97","imageName":"grave titan"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":207102,"name":"Gravedigger","subtypes":["Zombie"],"cmc":4,"rarity":"Common","artist":"Dermot Power","power":"2","toughness":"2","manaCost":"{3}{B}","text":"When Gravedigger enters the battlefield, you may return target creature card from your graveyard to your hand.","flavor":"Only a thin layer of dirt separates civilization from an undead apocalypse.","number":"98","rulings":[{"date":"2009-10-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"gravedigger"},{"layout":"normal","type":"Creature - Basilisk","types":["Creature"],"colors":["Green"],"multiverseid":205016,"name":"Greater Basilisk","subtypes":["Basilisk"],"cmc":5,"rarity":"Common","artist":"James Ryman","power":"3","toughness":"5","manaCost":"{3}{G}{G}","text":"Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)","flavor":"Bone, stone . . . both taste the same to a hungry basilisk.","number":"180","imageName":"greater basilisk"},{"layout":"normal","type":"Creature - Serpent","types":["Creature"],"colors":["Blue"],"multiverseid":204974,"name":"Harbor Serpent","subtypes":["Serpent"],"cmc":6,"rarity":"Common","artist":"Daarken","power":"5","toughness":"5","manaCost":"{4}{U}{U}","text":"Islandwalk (This creature is unblockable as long as defending player controls an Island.)\n\nHarbor Serpent can't attack unless there are five or more Islands on the battlefield.","flavor":"Like most giant monsters villagers worship as gods, it proves a fickle master.","number":"56","rulings":[{"date":"2010-08-15","text":"Harbor Serpent's abilities care about lands with the land type Island, not necessarily lands named Island."},{"date":"2010-08-15","text":"The second ability checks how many Islands are on the battlefield (regardless of who controls them) only as attackers are declared. Once Harbor Serpent is declared as an attacker, it will continue to attack even if the number of Islands on the battlefield falls below five."}],"imageName":"harbor serpent"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205005,"name":"Haunting Echoes","cmc":5,"rarity":"Rare","artist":"Nils Hamm","manaCost":"{3}{B}{B}","text":"Exile all cards from target player's graveyard other than basic land cards. For each card exiled this way, search that player's library for all cards with the same name as that card and exile them. Then that player shuffles his or her library.","number":"99","rulings":[{"date":"2009-10-01","text":"While you're searching the player's library, you don't have to find all the cards with the same name as an exiled card if you don't want to. You can leave any number of them in that player's library"}],"imageName":"haunting echoes"},{"layout":"normal","type":"Creature - Dragon","types":["Creature"],"colors":["Red"],"multiverseid":205235,"name":"Hoarding Dragon","subtypes":["Dragon"],"cmc":5,"rarity":"Rare","artist":"Matt Cavotta","power":"4","toughness":"4","manaCost":"{3}{R}{R}","text":"Flying\n\nWhen Hoarding Dragon enters the battlefield, you may search your library for an artifact card, exile it, then shuffle your library.\n\nWhen Hoarding Dragon dies, you may put the exiled card into its owner's hand.","number":"144","rulings":[{"date":"2010-08-15","text":"The artifact card you find is exiled face up. All players can see what it is."},{"date":"2010-08-15","text":"If Hoarding Dragon is put into a graveyard before its first ability has resolved, its second ability will trigger and do nothing. Then its first ability will resolve. If you choose to find an artifact card from your library, it will be exiled for the rest of the game."}],"imageName":"hoarding dragon"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":205226,"name":"Holy Strength","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Terese Nielsen","manaCost":"{W}","text":"Enchant creature\n\nEnchanted creature gets +1/+2.","flavor":"\"Born under the sun, the first child will seek the foundation of honor and be fortified by its righteousness.\"\n\n—Codex of the Constellari","number":"16","imageName":"holy strength"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":205099,"name":"Honor of the Pure","cmc":2,"rarity":"Rare","artist":"Greg Staples","manaCost":"{1}{W}","text":"White creatures you control get +1/+1.","flavor":"Together the soldiers were like a golden blade, cutting down their enemies and scarring the darkness.","number":"17","imageName":"honor of the pure"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":205050,"name":"Hornet Sting","cmc":1,"rarity":"Common","artist":"Matt Stewart","manaCost":"{G}","text":"Hornet Sting deals 1 damage to target creature or player.","flavor":"It was only then—to his infinite sorrow—that Gork realized hornets don't make honey.","number":"181","imageName":"hornet sting"},{"layout":"normal","type":"Creature - Spirit","types":["Creature"],"colors":["Black"],"multiverseid":205100,"name":"Howling Banshee","subtypes":["Spirit"],"cmc":4,"rarity":"Uncommon","artist":"Andrew Robinson","power":"3","toughness":"3","manaCost":"{2}{B}{B}","text":"Flying\n\nWhen Howling Banshee enters the battlefield, each player loses 3 life.","flavor":"Villagers cloaked the town in magical silence, but their ears still bled.","number":"100","imageName":"howling banshee"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":205037,"name":"Hunters' Feast","cmc":4,"rarity":"Common","artist":"Matt Stewart","manaCost":"{3}{G}","text":"Any number of target players each gain 6 life.","flavor":"Those who kill a jawspur rhino must prepare spells to lift the carcass—even a dozen hunters can't lift its bulk.","number":"182","imageName":"hunters' feast"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":205101,"name":"Ice Cage","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Mike Bierek","manaCost":"{1}{U}","text":"Enchant creature\n\nEnchanted creature can't attack or block, and its activated abilities can't be activated.\n\nWhen enchanted creature becomes the target of a spell or ability, destroy Ice Cage.","number":"57","rulings":[{"date":"2009-10-01","text":"If the enchanted creature becomes the target of a spell or ability, Ice Cage's ability triggers and is put on the stack on top of that spell or ability. Ice Cage's ability will resolve (causing Ice Cage to be destroyed) first."}],"imageName":"ice cage"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205045,"name":"Incite","cmc":1,"rarity":"Common","artist":"Scott Chou","manaCost":"{R}","text":"Target creature becomes red until end of turn and attacks this turn if able.","flavor":"The veneer of rationality peeled from the mage, revealing the spite and rage beneath.","number":"145","rulings":[{"date":"2010-08-15","text":"Incite overwrites all of the targeted creature's old colors, leaving it just red. It doesn't matter what colors it used to be (even if, for example, it used to be red and green)."},{"date":"2010-08-15","text":"You may target any creature with Incite. It's okay if that creature is already red. It's also okay if it would be unable to attack that turn."},{"date":"2010-08-15","text":"If, during its controller's declare attackers step, a creature affected by Incite is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" then that creature doesn't attack. If there's a cost associated with having that creature attack, its controller isn't forced to pay that cost, so the creature doesn't have to attack in that case either."},{"date":"2010-08-15","text":"If there are multiple combat phases in a turn, a creature affected by Incite must attack only in the first one in which it's able to."}],"imageName":"incite"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":208278,"name":"Infantry Veteran","subtypes":["Human","Soldier"],"cmc":1,"rarity":"Common","artist":"Christopher Rush","power":"1","toughness":"1","manaCost":"{W}","text":"{T}: Target attacking creature gets +1/+1 until end of turn.","flavor":"\"Any fool can pick up a sword and charge into battle. To emerge alive at the end, that is a gift that comes from leadership and experience.\"","number":"18","rulings":[{"date":"2010-08-15","text":"An \"attacking creature\" is one that has been declared as an attacker this combat, or one that was put onto the battlefield attacking this combat. Unless that creature leaves combat, it continues to be an attacking creature through the end of combat step, even if the player it was attacking has left the game, or the planeswalker it was attacking has left combat."}],"imageName":"infantry veteran"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["Red"],"multiverseid":205042,"name":"Inferno Titan","subtypes":["Giant"],"cmc":6,"rarity":"Mythic Rare","artist":"Kev Walker","power":"6","toughness":"6","manaCost":"{4}{R}{R}","text":"{R}: Inferno Titan gets +1/+0 until end of turn.\n\nWhenever Inferno Titan enters the battlefield or attacks, it deals 3 damage divided as you choose among one, two, or three target creatures and/or players.","number":"146","rulings":[{"date":"2010-08-15","text":"You divide the damage as you put Inferno Titan's triggered ability on the stack, not as it resolves. Each target must be assigned at least 1 damage. (In other words, as you put the ability on the stack, you choose whether to have it deal 3 damage to a single target, 2 damage to one target and 1 damage to another target, or 1 damage to each of three targets.)"}],"imageName":"inferno titan"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":205074,"name":"Inspired Charge","cmc":4,"rarity":"Common","artist":"Wayne Reynolds","manaCost":"{2}{W}{W}","text":"Creatures you control get +2/+1 until end of turn.","flavor":"\"Impossible! How could they overwhelm us? We had barricades, war elephants, . . . and they were barely a tenth of our number!\"\n\n—General Avitora","number":"19","rulings":[{"date":"2010-08-15","text":"Only creatures you control as Inspired Charge resolves are affected."}],"imageName":"inspired charge"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":213619,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Rob Alexander","text":"U","number":"234","variations":[213618,213616,213617],"imageName":"island1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":213617,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"John Avon","text":"U","number":"235","variations":[213619,213618,213616],"imageName":"island2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":213618,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Fred Fields","text":"U","number":"236","variations":[213619,213616,213617],"imageName":"island3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":213616,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Eric Peterson","text":"U","number":"237","variations":[213619,213618,213617],"imageName":"island4"},{"layout":"normal","type":"Planeswalker - Jace","types":["Planeswalker"],"colors":["Blue"],"multiverseid":205960,"name":"Jace Beleren","subtypes":["Jace"],"cmc":3,"rarity":"Mythic Rare","artist":"Aleksi Briclot","loyalty":3,"manaCost":"{1}{U}{U}","text":"+2: Each player draws a card.\n\n-1: Target player draws a card.\n\n-10: Target player puts the top twenty cards of his or her library into his or her graveyard.","number":"58","rulings":[{"date":"2009-10-01","text":"If there are fewer than twenty cards in the targeted player's library, that player puts all the cards from his or her library into his or her graveyard."}],"imageName":"jace beleren"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Blue"],"multiverseid":205043,"name":"Jace's Erasure","cmc":2,"rarity":"Common","artist":"Jason Chan","manaCost":"{1}{U}","text":"Whenever you draw a card, you may have target player put the top card of his or her library into his or her graveyard.","flavor":"\"You should try to clear your mind of idle thoughts. And if you can't, I will.\"","number":"59","rulings":[{"date":"2010-08-15","text":"If a spell or ability causes you to draw multiple cards, Jace's Erasure's ability triggers that many times. (The spell or ability finishes resolving before you put Jace's Erasure's abilities on the stack.)"},{"date":"2010-08-15","text":"If a spell or ability causes you to put cards in your hand without specifically using the word \"draw,\" Jace's Erasure's ability won't trigger."}],"imageName":"jace's erasure"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":205015,"name":"Jace's Ingenuity","cmc":5,"rarity":"Uncommon","artist":"Igor Kieryluk","manaCost":"{3}{U}{U}","text":"Draw three cards.","flavor":"\"Brute force can sometimes kick down a locked door, but knowledge is a skeleton key.\"","number":"60","imageName":"jace's ingenuity"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":208006,"name":"Jinxed Idol","cmc":2,"rarity":"Rare","artist":"jD","manaCost":"{2}","text":"At the beginning of your upkeep, Jinxed Idol deals 2 damage to you.\n\nSacrifice a creature: Target opponent gains control of Jinxed Idol.","flavor":"\"Please, honored friend, take it with my compliments. I insist.\"","number":"208","rulings":[{"date":"2004-10-04","text":"Your opponent can use the ability to give this card back to you."},{"date":"2010-08-15","text":"The control-change effect has no duration. The targeted player retains control of Jinxed Idol until the game ends, Jinxed Idol leaves the battlefield, or an effect causes someone else to gain control of it (perhaps because Jinxed Idol's ability is activated again)."},{"date":"2010-08-15","text":"If you sacrifice an attacking or blocking creature during the declare blockers step, it won't deal combat damage. If you wait until the combat damage step, but that creature is dealt lethal damage, it'll be destroyed before you get a chance to sacrifice it."}],"imageName":"jinxed idol"},{"layout":"normal","type":"Artifact Creature - Juggernaut","types":["Artifact","Creature"],"colors":[],"multiverseid":205230,"name":"Juggernaut","subtypes":["Juggernaut"],"cmc":4,"rarity":"Uncommon","artist":"Mark Hyzer","power":"5","toughness":"3","manaCost":"{4}","text":"Juggernaut attacks each turn if able.\n\nJuggernaut can't be blocked by Walls.","flavor":"The mighty city of An Karras, with its rich history, built over thousands of years, fell in three hours.","number":"209","rulings":[{"date":"2004-10-04","text":"An effect that states \"Enchanted creature can only be blocked by Walls\" will make the Juggernaut unblockable. The \"can only be blocked by walls\" effect doesn't override the text on the Juggernaut's ability."},{"date":"2004-10-04","text":"There is no penalty if for some reason the Juggernaut can't attack, but if it can attack you must do so."},{"date":"2010-08-15","text":"If, during your declare attackers step, Juggernaut is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" then it doesn't attack. If there's a cost associated with having Juggernaut attack, you aren't forced to pay that cost, so it doesn't have to attack in that case either."},{"date":"2010-08-15","text":"If there are multiple combat phases in a turn, Juggernaut must attack only in the first one in which it's able to."}],"imageName":"juggernaut"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White"],"multiverseid":204988,"name":"Knight Exemplar","subtypes":["Human","Knight"],"cmc":3,"rarity":"Rare","artist":"Jason Chan","power":"2","toughness":"2","manaCost":"{1}{W}{W}","text":"First strike (This creature deals combat damage before creatures without first strike.)\n\nOther Knight creatures you control get +1/+1 and are indestructible. (Lethal damage and effects that say \"destroy\" don't destroy them.)","number":"20","rulings":[{"date":"2010-08-15","text":"Lethal damage, damage from a source with deathtouch, and effects that say \"destroy\" won't cause an indestructible creature to be put into the graveyard. However, an indestructible creature can be put into the graveyard for a number of reasons. The most likely reasons are if it's sacrificed, if it's legendary and another legendary creature with the same name is on the battlefield, or if its toughness is 0 or less."},{"date":"2010-08-15","text":"If an effect would simultaneously destroy Knight Exemplar and another Knight creature you control, only Knight Exemplar is destroyed."},{"date":"2010-08-15","text":"If another Knight creature you control is dealt lethal damage, the creature isn't destroyed, but the damage remains marked on it. If, at some point later in that turn, you no longer control Knight Exemplar or it loses its abilities, the other Knight creature will stop being indestructible and will be destroyed."},{"date":"2010-08-15","text":"If you control two Knight Exemplars, each one causes the other to get +1/+1 and be indestructible."}],"imageName":"knight exemplar"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206328,"name":"Kraken's Eye","cmc":2,"rarity":"Uncommon","artist":"Alan Pollack","manaCost":"{2}","text":"Whenever a player casts a blue spell, you may gain 1 life.","flavor":"It's seen the wonders of entire worlds trapped in the depths of a bottomless ocean.","number":"210","rulings":[{"date":"2009-10-01","text":"The ability triggers whenever any player, not just you, casts a blue spell."},{"date":"2009-10-01","text":"If a player casts a blue spell, Kraken's Eye's ability triggers and is put on the stack on top of that spell. Kraken's Eye's ability will resolve (causing you to gain 1 life) before the spell does."}],"imageName":"kraken's eye"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":205117,"name":"Lava Axe","cmc":5,"rarity":"Common","artist":"Brian Snoddy","manaCost":"{4}{R}","text":"Lava Axe deals 5 damage to target player.","flavor":"From the heart of the mountain into the heart of the mage.","number":"147","imageName":"lava axe"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Blue"],"multiverseid":205008,"name":"Leyline of Anticipation","cmc":4,"rarity":"Rare","artist":"Charles Urbach","manaCost":"{2}{U}{U}","text":"If Leyline of Anticipation is in your opening hand, you may begin the game with it on the battlefield.\n\nYou may cast nonland cards as though they had flash. (You may cast them any time you could cast an instant.)","number":"61","rulings":[{"date":"2010-08-15","text":"Your \"opening hand\" is the hand of cards you decide to start the game with after taking any mulligans."},{"date":"2010-08-15","text":"After all players have decided not to take any more mulligans, if the starting player has any Leylines in his or her hand, he or she may put any or all of them onto the battlefield. Then each other player in turn order may do the same."},{"date":"2010-08-15","text":"Leylines that start the game on the battlefield aren't cast as spells. They can't be countered."},{"date":"2010-08-15","text":"After each player has exercised his or her option to put Leylines onto the battlefield, the first turn of the game begins."}],"imageName":"leyline of anticipation"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":205018,"name":"Leyline of Punishment","cmc":4,"rarity":"Rare","artist":"Charles Urbach","manaCost":"{2}{R}{R}","text":"If Leyline of Punishment is in your opening hand, you may begin the game with it on the battlefield.\n\nPlayers can't gain life.\n\nDamage can't be prevented.","number":"148","rulings":[{"date":"2010-08-15","text":"Your \"opening hand\" is the hand of cards you decide to start the game with after taking any mulligans."},{"date":"2010-08-15","text":"After all players have decided not to take any more mulligans, if the starting player has any Leylines in his or her hand, he or she may put any or all of them onto the battlefield. Then each other player in turn order may do the same."},{"date":"2010-08-15","text":"Leylines that start the game on the battlefield aren't cast as spells. They can't be countered."},{"date":"2010-08-15","text":"After each player has exercised his or her option to put Leylines onto the battlefield, the first turn of the game begins."},{"date":"2010-08-15","text":"Spells and abilities that would normally cause a player to gain life still resolve, but the life-gain part simply has no effect."},{"date":"2010-08-15","text":"If a cost includes life gain (like Invigorate's alternative cost does), that cost can't be paid."},{"date":"2010-08-15","text":"Effects that would replace gaining life with some other effect won't be able to do anything because it's impossible for players to gain life."},{"date":"2010-08-15","text":"Effects that replace an event with gaining life (like Words of Worship's effect does) will end up replacing the event with nothing."},{"date":"2010-08-15","text":"If an effect says to set a player's life total to a certain number, and that number is higher than the player's current life total, that part of the effect won't do anything. (If the number is lower than the player's current life total, the effect will work as normal.)"},{"date":"2010-08-15","text":"Damage prevention shields don't have any effect. If a prevention effect has an additional effect, the additional effect will still work (if possible). Spells that create prevention effects can still be cast, and abilities that create prevention effects can still be activated."},{"date":"2010-08-15","text":"Static abilities that prevent damage (including protection abilities) don't do so. If they have additional effects that don't depend on the amount of damage prevented, those additional effects will still work. Such effects are applied only once per source of damage."},{"date":"2010-08-15","text":"Effects that replace or redirect damage without using the word \"prevent\" are not affected by Leyline of Punishment."},{"date":"2010-08-15","text":"If a creature is dealt lethal damage, it can still regenerate. If it does, the damage marked on it will be removed from it."}],"imageName":"leyline of punishment"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":204993,"name":"Leyline of Sanctity","cmc":4,"rarity":"Rare","artist":"Ryan Pancoast","manaCost":"{2}{W}{W}","text":"If Leyline of Sanctity is in your opening hand, you may begin the game with it on the battlefield.\n\nYou have hexproof. (You can't be the target of spells or abilities your opponents control.)","number":"21","rulings":[{"date":"2010-08-15","text":"Your \"opening hand\" is the hand of cards you decide to start the game with after taking any mulligans."},{"date":"2010-08-15","text":"After all players have decided not to take any more mulligans, if the starting player has any Leylines in his or her hand, he or she may put any or all of them onto the battlefield. Then each other player in turn order may do the same."},{"date":"2010-08-15","text":"Leylines that start the game on the battlefield aren't cast as spells. They can't be countered."},{"date":"2010-08-15","text":"After each player has exercised his or her option to put Leylines onto the battlefield, the first turn of the game begins."}],"imageName":"leyline of sanctity"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":205013,"name":"Leyline of the Void","cmc":4,"rarity":"Rare","artist":"Rob Alexander","manaCost":"{2}{B}{B}","text":"If Leyline of the Void is in your opening hand, you may begin the game with it on the battlefield.\n\nIf a card would be put into an opponent's graveyard from anywhere, exile it instead.","number":"101","rulings":[{"date":"2006-02-01","text":"Leyline of the Void affects cards that would be put into opponents' graveyards from anywhere, not just from the battlefield."},{"date":"2010-08-15","text":"Your \"opening hand\" is the hand of cards you decide to start the game with after taking any mulligans."},{"date":"2010-08-15","text":"After all players have decided not to take any more mulligans, if the starting player has any Leylines in his or her hand, he or she may put any or all of them onto the battlefield. Then each other player in turn order may do the same."},{"date":"2010-08-15","text":"Leylines that start the game on the battlefield aren't cast as spells. They can't be countered."},{"date":"2010-08-15","text":"After each player has exercised his or her option to put Leylines onto the battlefield, the first turn of the game begins."},{"date":"2010-08-15","text":"Leyline of the Void's second ability prevents cards from ever reaching your opponents' graveyards. Abilities that would trigger when those cards are put into an opponent's graveyard (such as Hoarding Dragon's last ability) won't trigger."},{"date":"2010-08-15","text":"Leyline of the Void's second ability doesn't affect token permanents that would be put into an opponent's graveyard from the battlefield. They'll be put into that graveyard as normal (causing any applicable triggered abilities to trigger), then they'll cease to exist."},{"date":"2010-08-15","text":"If your opponent discards a card while you control Leyline of the Void, abilities that function when that card is discarded (such as Liliana's Caress's ability, or a madness ability of the discarded card) still work, even though that card never reaches that player's graveyard. In addition, spells or abilities that check the characteristics of the discarded card (such as Chandra Ablaze's first ability) can find that card in exile."}],"imageName":"leyline of the void"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Green"],"multiverseid":205031,"name":"Leyline of Vitality","cmc":4,"rarity":"Rare","artist":"Jim Nelson","manaCost":"{2}{G}{G}","text":"If Leyline of Vitality is in your opening hand, you may begin the game with it on the battlefield.\n\nCreatures you control get +0/+1.\n\nWhenever a creature enters the battlefield under your control, you may gain 1 life.","number":"183","rulings":[{"date":"2010-08-15","text":"Your \"opening hand\" is the hand of cards you decide to start the game with after taking any mulligans."},{"date":"2010-08-15","text":"After all players have decided not to take any more mulligans, if the starting player has any Leylines in his or her hand, he or she may put any or all of them onto the battlefield. Then each other player in turn order may do the same."},{"date":"2010-08-15","text":"Leylines that start the game on the battlefield aren't cast as spells. They can't be countered."},{"date":"2010-08-15","text":"After each player has exercised his or her option to put Leylines onto the battlefield, the first turn of the game begins."},{"date":"2010-08-15","text":"If Leyline of Vitality and a creature enter the battlefield under your control at the same time, Leyline of Vitality's third ability will trigger."}],"imageName":"leyline of vitality"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205227,"name":"Lightning Bolt","cmc":1,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{R}","text":"Lightning Bolt deals 3 damage to target creature or player.","number":"149","imageName":"lightning bolt"},{"layout":"normal","type":"Planeswalker - Liliana","types":["Planeswalker"],"colors":["Black"],"multiverseid":205961,"name":"Liliana Vess","subtypes":["Liliana"],"cmc":5,"rarity":"Mythic Rare","artist":"Aleksi Briclot","loyalty":5,"manaCost":"{3}{B}{B}","text":"+1: Target player discards a card.\n\n-2: Search your library for a card, then shuffle your library and put that card on top of it.\n\n-8: Put all creature cards from all graveyards onto the battlefield under your control.","number":"102","rulings":[{"date":"2009-10-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"liliana vess"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":205035,"name":"Liliana's Caress","cmc":2,"rarity":"Uncommon","artist":"Steve Argyle","manaCost":"{1}{B}","text":"Whenever an opponent discards a card, that player loses 2 life.","flavor":"\"This might hurt less if you don't fight so hard. But I doubt it.\"","number":"103","rulings":[{"date":"2010-08-15","text":"If an opponent discards multiple cards (due to a spell, an ability, or the action of discarding down to the maximum hand size during his or her cleanup step), Liliana's Caress's ability triggers that many times."}],"imageName":"liliana's caress"},{"layout":"normal","type":"Creature - Specter","types":["Creature"],"colors":["Black"],"multiverseid":204998,"name":"Liliana's Specter","subtypes":["Specter"],"cmc":3,"rarity":"Common","artist":"Vance Kovacs","power":"2","toughness":"1","manaCost":"{1}{B}{B}","text":"Flying\n\nWhen Liliana's Specter enters the battlefield, each opponent discards a card.","flavor":"\"The finest minions know what I need without me ever saying a thing.\"\n\n—Liliana Vess","number":"104","imageName":"liliana's specter"},{"layout":"normal","type":"Creature - Elf Druid","types":["Creature"],"colors":["Green"],"multiverseid":205228,"name":"Llanowar Elves","subtypes":["Elf","Druid"],"cmc":1,"rarity":"Common","artist":"Kev Walker","power":"1","toughness":"1","manaCost":"{G}","text":"{T}: Add {G} to your mana pool.","flavor":"One bone broken for every twig snapped underfoot.\n\n—Llanowar penalty for trespassing","number":"184","imageName":"llanowar elves"},{"layout":"normal","type":"Creature - Phoenix","types":["Creature"],"colors":["Red"],"multiverseid":208003,"name":"Magma Phoenix","subtypes":["Phoenix"],"cmc":5,"rarity":"Rare","artist":"Raymond Swanland","power":"3","toughness":"3","manaCost":"{3}{R}{R}","text":"Flying\n\nWhen Magma Phoenix dies, it deals 3 damage to each creature and each player.\n\n{3}{R}{R}: Return Magma Phoenix from your graveyard to your hand.","number":"150","imageName":"magma phoenix"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":204981,"name":"Mana Leak","cmc":2,"rarity":"Common","artist":"Howard Lyon","manaCost":"{1}{U}","text":"Counter target spell unless its controller pays {3}.","flavor":"The fatal flaw in every plan is the assumption that you know more than your enemy.","number":"62","imageName":"mana leak"},{"layout":"normal","type":"Creature - Human Warrior","types":["Creature"],"colors":["Red"],"multiverseid":208007,"name":"Manic Vandal","subtypes":["Human","Warrior"],"cmc":3,"rarity":"Common","artist":"Christopher Moeller","power":"2","toughness":"2","manaCost":"{2}{R}","text":"When Manic Vandal enters the battlefield, destroy target artifact.","flavor":"It's fun. He doesn't need another reason.","number":"151","rulings":[{"date":"2010-08-15","text":"Manic Vandal's ability is mandatory. If you're the only player who controls an artifact, you must target one of them."}],"imageName":"manic vandal"},{"layout":"normal","type":"Creature - Merfolk Soldier","types":["Creature"],"colors":["Blue"],"multiverseid":205040,"name":"Maritime Guard","subtypes":["Merfolk","Soldier"],"cmc":2,"rarity":"Common","artist":"Allen Williams","power":"1","toughness":"3","manaCost":"{1}{U}","flavor":"Once common in the Kapsho Seas, merfolk were hunted almost to extinction. They survived those dark days and emerged calculating and determined to endure.","number":"63","imageName":"maritime guard"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":204977,"name":"Mass Polymorph","cmc":6,"rarity":"Rare","artist":"Christopher Moeller","manaCost":"{5}{U}","text":"Exile all creatures you control, then reveal cards from the top of your library until you reveal that many creature cards. Put all creature cards revealed this way onto the battlefield, then shuffle the rest of the revealed cards into your library.","number":"64","rulings":[{"date":"2010-08-15","text":"The creatures you exile with Mass Polymorph remain exiled for the rest of the game."},{"date":"2010-08-15","text":"If the number of creatures you exile is greater than the number of creature cards remaining in your library, you'll wind up revealing your entire library, putting all creature cards revealed that way onto the battlefield, then shuffling your library."},{"date":"2010-08-15","text":"All creatures you put onto the battlefield with Mass Polymorph enter the battlefield at the same time."},{"date":"2010-08-15","text":"Any abilities that trigger during the resolution of Mass Polymorph (such as a creature's enters-the-battlefield ability) will wait to be put onto the stack until Mass Polymorph finishes resolving. The player whose turn it is will put all of his or her triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)"}],"imageName":"mass polymorph"},{"layout":"normal","type":"Creature - Merfolk","types":["Creature"],"colors":["Blue"],"multiverseid":205108,"name":"Merfolk Sovereign","subtypes":["Merfolk"],"cmc":3,"rarity":"Rare","artist":"Jesper Ejsing","power":"2","toughness":"2","manaCost":"{1}{U}{U}","text":"Other Merfolk creatures you control get +1/+1.\n\n{T}: Target Merfolk creature is unblockable this turn.","flavor":"\"Be like the sea: flow around that which is unmovable; for everything else, crash into it unrelentingly.\"","number":"65","rulings":[{"date":"2009-10-01","text":"To have any effect, Merfolk Sovereign's activated ability must be activated before the declare blockers step begins. Once a creature has become blocked, making it unblockable won't change that."}],"imageName":"merfolk sovereign"},{"layout":"normal","type":"Creature - Merfolk Rogue","types":["Creature"],"colors":["Blue"],"multiverseid":205009,"name":"Merfolk Spy","subtypes":["Merfolk","Rogue"],"cmc":1,"rarity":"Common","artist":"Matt Cavotta & Richard Whitters","power":"1","toughness":"1","manaCost":"{U}","text":"Islandwalk (This creature is unblockable as long as defending player controls an Island.)\n\nWhenever Merfolk Spy deals combat damage to a player, that player reveals a card at random from his or her hand.","number":"66","rulings":[{"date":"2010-08-15","text":"Islandwalk cares about lands with the land type Island, not necessarily lands named Island."},{"date":"2010-08-15","text":"The second ability triggers just once each time Merfolk Spy deals combat damage to a player, regardless of how much damage it deals."},{"date":"2010-08-15","text":"After the second ability resolves, the revealed card stops being revealed in its owner's hand."},{"date":"2010-08-15","text":"The next time Merfolk Spy deals combat damage to the same player, the card that's revealed at random may be the same card or may be a different card."}],"imageName":"merfolk spy"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":208280,"name":"Mighty Leap","cmc":2,"rarity":"Common","artist":"rk post","manaCost":"{1}{W}","text":"Target creature gets +2/+2 and gains flying until end of turn.","flavor":"\"The southern fortress taken by invaders? Heh, sure . . . when elephants fly.\"\n\n—Brezard Skeinbow, captain of the guard","number":"22","rulings":[{"date":"2010-08-15","text":"You may target any creature with Mighty Leap. It's okay if that creature already has flying."},{"date":"2010-08-15","text":"For flying to work as an evasion ability, Mighty Leap must be cast before the declare blockers step begins. Once a creature has become blocked, giving it flying won't change that."}],"imageName":"mighty leap"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":208220,"name":"Mind Control","subtypes":["Aura"],"cmc":5,"rarity":"Uncommon","artist":"Ryan Pancoast","manaCost":"{3}{U}{U}","text":"Enchant creature\n\nYou control enchanted creature.","flavor":"\"The mind: a great weapon and an even greater weakness.\"\n\n—Jace Beleren","number":"67","rulings":[{"date":"2010-08-15","text":"Gaining control of a creature doesn't cause you gain control of any Auras or Equipment attached to it."}],"imageName":"mind control"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205010,"name":"Mind Rot","cmc":3,"rarity":"Common","artist":"Steve Luke","manaCost":"{2}{B}","text":"Target player discards two cards.","flavor":"Not every thought is a good one.","number":"105","imageName":"mind rot"},{"layout":"normal","type":"Creature - Ooze","types":["Creature"],"colors":["Green"],"multiverseid":205032,"name":"Mitotic Slime","subtypes":["Ooze"],"cmc":5,"rarity":"Rare","artist":"Raymond Swanland","power":"4","toughness":"4","manaCost":"{4}{G}","text":"When Mitotic Slime dies, put two 2/2 green Ooze creature tokens onto the battlefield. They have \"When this creature dies, put two 1/1 green Ooze creature tokens onto the battlefield.\"","number":"185","imageName":"mitotic slime"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":213624,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Rob Alexander","number":"242","variations":[213625,213627,213626],"imageName":"mountain1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":213625,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"John Avon","number":"243","variations":[213627,213624,213626],"imageName":"mountain2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":213626,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Nils Hamm","number":"244","variations":[213625,213627,213624],"imageName":"mountain3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":213627,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Karl Kopinski","number":"245","variations":[213625,213624,213626],"imageName":"mountain4"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":204978,"name":"Mystifying Maze","rarity":"Rare","artist":"Robh Ruppel","text":"{T}: Add {1} to your mana pool.\n\n{4}, {T}: Exile target attacking creature an opponent controls. At the beginning of the next end step, return it to the battlefield tapped under its owner's control.","number":"226","rulings":[{"date":"2010-08-15","text":"An \"attacking creature\" is one that has been declared as an attacker this combat, or one that was put onto the battlefield attacking this combat. Unless that creature leaves combat, it continues to be an attacking creature through the end of combat step, even if the player it was attacking has left the game, or the planeswalker it was attacking has left combat."},{"date":"2010-08-15","text":"The targeted creature doesn't have to be attacking you. It can be attacking a planeswalker, or (in a multiplayer game) it can be attacking another player."},{"date":"2010-08-15","text":"At the beginning of the next end step, the affected creature is returned to the battlefield even if Mystifying Maze is no longer on the battlefield by then."}],"imageName":"mystifying maze"},{"layout":"normal","type":"Creature - Insect Shade","types":["Creature"],"colors":["Black"],"multiverseid":205229,"name":"Nantuko Shade","subtypes":["Insect","Shade"],"cmc":2,"rarity":"Rare","artist":"Brian Snoddy","power":"2","toughness":"1","manaCost":"{B}{B}","text":"{B}: Nantuko Shade gets +1/+1 until end of turn.","flavor":"In life, the nantuko study nature by revering it. In death, they study nature by disemboweling it.","number":"106","imageName":"nantuko shade"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":207336,"name":"Naturalize","cmc":2,"rarity":"Common","artist":"Tim Hildebrandt","manaCost":"{1}{G}","text":"Destroy target artifact or enchantment.","flavor":"\"Nature does not need adornment.\"\n\n—Garruk Wildspeaker","number":"186","imageName":"naturalize"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":207338,"name":"Nature's Spiral","cmc":2,"rarity":"Uncommon","artist":"Terese Nielsen","manaCost":"{1}{G}","text":"Return target permanent card from your graveyard to your hand. (A permanent card is an artifact, creature, enchantment, land, or planeswalker card.)","flavor":"Snail shell, fern, tornado—the world connects all things in form.","number":"187","imageName":"nature's spiral"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":207104,"name":"Necrotic Plague","subtypes":["Aura"],"cmc":4,"rarity":"Rare","artist":"Jaime Jones","manaCost":"{2}{B}{B}","text":"Enchant creature\n\nEnchanted creature has \"At the beginning of your upkeep, sacrifice this creature.\"\n\nWhen enchanted creature dies, its controller chooses target creature one of his or her opponents controls. Return Necrotic Plague from its owner's graveyard to the battlefield attached to that creature.","number":"107","rulings":[{"date":"2010-08-15","text":"Necrotic Plague grants the sacrifice ability to the creature it's enchanting. That means it triggers at the beginning of the upkeep of the creature's controller (not necessarily Necrotic Plague's controller)."},{"date":"2010-08-15","text":"Necrotic Plague's last ability triggers when the enchanted creature is put into a graveyard for any reason, not just when it's sacrificed due to the ability it grants to that creature. It triggers if it and the creature it's enchanting are both put into the graveyard at the same time, or if the creature it's enchanting is put into the graveyard but Necrotic Plague isn't. (In the second case, Necrotic Plague is then put into the graveyard as a state-based action.)"},{"date":"2010-08-15","text":"The player that controls Necrotic Plague at the time the enchanted creature is put into a graveyard is the player who controls the last ability (even though that creature's controller is the one who chooses its target). The first player returns Necrotic Plague to the battlefield under his or her control, regardless of whose graveyard it was put into. Note that the ability is mandatory; a target must be chosen if able, and Necrotic Plague must be returned to the battlefield if able."},{"date":"2010-08-15","text":"If no legal target can be chosen for Necrotic Plague's last ability, it just remains in its owner's graveyard. Similarly, if the targeted creature becomes an illegal target by the time the ability resolves, the ability is countered and Necrotic Plague remains in its owner's graveyard."}],"imageName":"necrotic plague"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208222,"name":"Negate","cmc":2,"rarity":"Common","artist":"Jeremy Jarvis","manaCost":"{1}{U}","text":"Counter target noncreature spell.","flavor":"Masters of the arcane savor a delicious irony. Their study of deep and complex arcana leads to such a simple end: the ability to say merely yes or no.","number":"68","rulings":[{"date":"2009-10-01","text":"A \"creature spell\" is any spell with the type Creature, even if it has other types such as Artifact or Enchantment. Older cards of type Summon are also Creature spells."}],"imageName":"negate"},{"layout":"normal","type":"Creature - Horror","types":["Creature"],"colors":["Black"],"multiverseid":204994,"name":"Nether Horror","subtypes":["Horror"],"cmc":4,"rarity":"Common","artist":"Allen Williams","power":"4","toughness":"2","manaCost":"{3}{B}","flavor":"\"My dreams darkened and seeped into my waking hours. Spellcraft and nightmare merged to create this monstrosity.\"\n\n—Sunniva, witch of Holm Hollow","number":"108","imageName":"nether horror"},{"layout":"normal","type":"Creature - Shade","types":["Creature"],"colors":["Black"],"multiverseid":207103,"name":"Nightwing Shade","subtypes":["Shade"],"cmc":5,"rarity":"Common","artist":"Lucas Graciano","power":"2","toughness":"2","manaCost":"{4}{B}","text":"Flying\n\n{1}{B}: Nightwing Shade gets +1/+1 until end of turn.","flavor":"\"There is one hour of the night even we do not watch.\"\n\n—Sedva, captain of the watch","number":"109","imageName":"nightwing shade"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":205075,"name":"Obstinate Baloth","subtypes":["Beast"],"cmc":4,"rarity":"Rare","artist":"Chris Rahn","power":"4","toughness":"4","manaCost":"{2}{G}{G}","text":"When Obstinate Baloth enters the battlefield, you gain 4 life.\n\nIf a spell or ability an opponent controls causes you to discard Obstinate Baloth, put it onto the battlefield instead of putting it into your graveyard.","number":"188","rulings":[{"date":"2010-08-15","text":"If a spell or ability an opponent controls causes you to discard Obstinate Baloth, and both Obstinate Baloth's ability and another ability (such as the one from an opponent's Leyline of the Void) instruct you to put Obstinate Baloth somewhere else instead of putting it into your graveyard, you choose which one to apply."},{"date":"2010-08-15","text":"If you discard Obstinate Baloth and wind up putting it onto the battlefield, you've still discarded it. Abilities that trigger when you discard a card (such as the one from Liliana's Caress) will still trigger."}],"imageName":"obstinate baloth"},{"layout":"normal","type":"Artifact Creature - Thopter","types":["Artifact","Creature"],"colors":[],"multiverseid":206331,"name":"Ornithopter","subtypes":["Thopter"],"cmc":0,"rarity":"Uncommon","artist":"Franz Vohwinkel","power":"0","toughness":"2","manaCost":"{0}","text":"Flying","flavor":"Regardless of the century, plane, or species, developing artificers never fail to invent the ornithopter.","number":"211","imageName":"ornithopter"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":205003,"name":"Overwhelming Stampede","cmc":5,"rarity":"Rare","artist":"Steven Belledin","manaCost":"{3}{G}{G}","text":"Until end of turn, creatures you control gain trample and get +X/+X, where X is the greatest power among creatures you control. (If a creature you control would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.)","number":"189","rulings":[{"date":"2010-08-15","text":"You check the power of your creatures as Overwhelming Stampede resolves. For example, if you control a 2/1 creature, a 2/2 creature, a 2/4 creature, a 4/1 creature, a 5/5 creature, and a 5/6 creature at that time, each of your creatures gets +5/+5 and gains trample until end of turn."}],"imageName":"overwhelming stampede"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":208292,"name":"Pacifism","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Robert Bliss","manaCost":"{1}{W}","text":"Enchant creature\n\nEnchanted creature can't attack or block.","flavor":"For the first time in his life, Grakk felt a little warm and fuzzy inside.","number":"23","imageName":"pacifism"},{"layout":"normal","type":"Creature - Human Soldier","types":["Creature"],"colors":["White"],"multiverseid":205110,"name":"Palace Guard","subtypes":["Human","Soldier"],"cmc":3,"rarity":"Common","artist":"Volkan Baga","power":"1","toughness":"4","manaCost":"{2}{W}","text":"Palace Guard can block any number of creatures.","flavor":"\"I'm not nearly as bothered by being outnumbered as I am by their foul stench.\"","number":"24","imageName":"palace guard"},{"layout":"normal","type":"Creature - Illusion Beast","types":["Creature"],"colors":["Blue"],"multiverseid":205017,"name":"Phantom Beast","subtypes":["Illusion","Beast"],"cmc":4,"rarity":"Common","artist":"Ryan Yee","power":"4","toughness":"5","manaCost":"{3}{U}","text":"When Phantom Beast becomes the target of a spell or ability, sacrifice it.","flavor":"As insubstantial as fear, and as dangerous.","number":"69","rulings":[{"date":"2010-08-15","text":"If Phantom Beast becomes the target of a spell or ability, Phantom Beast's ability triggers and goes on the stack on top of that spell or ability. Phantom Beast's ability will resolve (causing it to be sacrificed) first. Unless the spell or ability has another target, it will then be countered when it tries to resolve for having no legal targets."}],"imageName":"phantom beast"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":205034,"name":"Phylactery Lich","subtypes":["Zombie"],"cmc":3,"rarity":"Rare","artist":"Michael Komarck","power":"5","toughness":"5","manaCost":"{B}{B}{B}","text":"As Phylactery Lich enters the battlefield, put a phylactery counter on an artifact you control.\n\nPhylactery Lich is indestructible.\n\nWhen you control no permanents with phylactery counters on them, sacrifice Phylactery Lich.","number":"110","rulings":[{"date":"2010-08-15","text":"Lethal damage, damage from a source with deathtouch, and effects that say \"destroy\" won't cause an indestructible creature to be put into the graveyard. However, an indestructible creature can be put into the graveyard for a number of reasons. The most likely reasons Phylactery Lich would be put into a graveyard are if it's sacrificed (perhaps due to its last ability), or if its toughness is 0 or less."},{"date":"2010-08-15","text":"Phylactery Lich's first ability doesn't target the artifact. You can choose an artifact that has shroud, for example."},{"date":"2010-08-15","text":"If you control no artifacts as Phylactery Lich enters the battlefield, its first ability won't do anything. As soon as it enters the battlefield, its last ability will trigger (unless you control some other permanent with a phylactery counter on it) and you'll have to sacrifice it."},{"date":"2010-08-15","text":"If Phylactery Lich and an artifact are entering the battlefield under your control at the same time, you can't put a phylactery counter on that artifact. You must choose an artifact you control that's already on the battlefield."},{"date":"2010-08-15","text":"Phylactery Lich's last ability is a \"state trigger.\" Once a state trigger triggers, it won't trigger again as long as the ability is on the stack. If the ability is countered and the trigger condition is still true, it will immediately trigger again."},{"date":"2010-08-15","text":"Phylactery Lich's last ability checks whether you control any permanents with phylactery counters on them, not whether you control any artifacts with phylactery counters on them. If an artifact with a phylactery counter on it somehow ceases to be an artifact, Phylactery Lich doesn't care."},{"date":"2010-08-15","text":"Phylactery Lich's last ability checks your permanents for any phylactery counters, not just the specific one that it caused you to put on an artifact. For example, say you put a phylactery counter on a Demon's Horn as Phylactery Lich enters the battlefield. Then you put a phylactery counter on a Crystal Ball as another Phylactery Lich enters the battlefield. Then Crystal Ball is destroyed. Since you still control the Demon's Horn, the last ability of neither Phylactery Lich triggers."},{"date":"2010-08-15","text":"The game continually checks whether you control a permanent with a phylactery counter on it. The moment you don't, Phylactery Lich's last ability triggers. The ability doesn't check again, so you'll have to sacrifice Phylactery Lich when it resolves even if you wind up controlling a permanent with a phylactery counter on it by then."}],"imageName":"phylactery lich"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":213614,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"John Avon","text":"W","number":"230","variations":[213615,213612,213613],"imageName":"plains1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":213612,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"John Avon","text":"W","number":"231","variations":[213615,213614,213613],"imageName":"plains2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":213613,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"D. J. Cleland-Hura","text":"W","number":"232","variations":[213615,213614,213612],"imageName":"plains3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":213615,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Ryan Pancoast","text":"W","number":"233","variations":[213614,213612,213613],"imageName":"plains4"},{"layout":"normal","type":"Artifact Creature - Angel","types":["Artifact","Creature"],"colors":[],"multiverseid":206329,"name":"Platinum Angel","subtypes":["Angel"],"cmc":7,"rarity":"Mythic Rare","artist":"Brom","power":"4","toughness":"4","manaCost":"{7}","text":"Flying\n\nYou can't lose the game and your opponents can't win the game.","flavor":"She is the apex of the artificer's craft, the spirit of the divine called out of base metal.","number":"212","rulings":[{"date":"2004-12-01","text":"Effects that say the game is a draw, such as the _Legends_(TM) card Divine Intervention, are not affected by Platinum Angel. They'll still work."},{"date":"2004-12-01","text":"You can concede a game while Platinum Angel on the battlefield. A concession causes you to leave the game, which then causes you to lose the game (Once you concede, you no longer control a Platinum Angel, so its ability can't prevent you from losing the game)."},{"date":"2009-10-01","text":"No game effect can cause you to lose the game or cause any opponent to win the game while you control Platinum Angel. It doesn't matter whether you have 0 or less life, you're forced to draw a card while your library is empty, you have ten or more poison counters, you're dealt combat damage by Phage the Untouchable, your opponent has Mortal Combat with twenty or more creature cards in his or her graveyard, or so on. You keep playing."},{"date":"2009-10-01","text":"Other circumstances can still cause you to lose the game, however. You will lose a game if you concede, if you're penalized with a Game Loss or a Match Loss during a sanctioned tournament due to a DCI rules infraction, or if your _Magic Online_(R) game clock runs out of time."},{"date":"2009-10-01","text":"If you control Platinum Angel in a Two-Headed Giant game, your team can't lose the game and the opposing team can't win the game."}],"imageName":"platinum angel"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":205062,"name":"Plummet","cmc":2,"rarity":"Common","artist":"Pete Venters","manaCost":"{1}{G}","text":"Destroy target creature with flying.","flavor":"\"You are the grandest of all,\" said the archdruid to the trees. They became so proud of bark and branch that they suffered no creature to fly overhead or perch upon a bough.","number":"190","imageName":"plummet"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":205019,"name":"Preordain","cmc":1,"rarity":"Common","artist":"Svetlin Velinov","manaCost":"{U}","text":"Scry 2, then draw a card. (To scry 2, look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)","number":"70","imageName":"preordain"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":204995,"name":"Primal Cocoon","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Daniel Ljunggren","manaCost":"{G}","text":"Enchant creature\n\nAt the beginning of your upkeep, put a +1/+1 counter on enchanted creature.\n\nWhen enchanted creature attacks or blocks, sacrifice Primal Cocoon.","number":"191","rulings":[{"date":"2010-08-15","text":"Primal Cocoon's first triggered ability triggers at the beginning of the upkeep of Primal Cocoon's controller (who is not necessarily the enchanted creature's controller)."},{"date":"2010-08-15","text":"The counters are put on the creature, not on Primal Cocoon. They'll stay on the creature even after Primal Cocoon is sacrificed or otherwise stops enchanting that creature."}],"imageName":"primal cocoon"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["Green"],"multiverseid":205027,"name":"Primeval Titan","subtypes":["Giant"],"cmc":6,"rarity":"Mythic Rare","artist":"Aleksi Briclot","power":"6","toughness":"6","manaCost":"{4}{G}{G}","text":"Trample\n\nWhenever Primeval Titan enters the battlefield or attacks, you may search your library for up to two land cards, put them onto the battlefield tapped, then shuffle your library.","flavor":"When nature calls, run.","number":"192","rulings":[{"date":"2010-08-15","text":"You may find any land cards, not just basic land cards."}],"imageName":"primeval titan"},{"layout":"normal","type":"Creature - Unicorn","types":["Creature"],"colors":["Green"],"multiverseid":205111,"name":"Prized Unicorn","subtypes":["Unicorn"],"cmc":4,"rarity":"Uncommon","artist":"Sam Wood","power":"2","toughness":"2","manaCost":"{3}{G}","text":"All creatures able to block Prized Unicorn do so.","flavor":"\"The desire for its magic horn inspires such bloodthirsty greed that all who see the unicorn will kill to possess it.\"\n\n—Dionus, elvish archdruid","number":"193","rulings":[{"date":"2009-10-01","text":"Prized Unicorn doesn't give a creature the ability to block it. It just forces those creatures that are already able to block it to do so. For example, it can't force a creature that's tapped or affected by a spell or ability that says it can't block to block it. If there's a cost associated with having a creature block, its controller isn't forced to pay that cost, so the creature doesn't have to block Prized Unicorn in that case either."},{"date":"2009-10-01","text":"If a creature the defending player controls can't block Prized Unicorn, it can block any attacking creature, or not block at all."},{"date":"2009-10-01","text":"If two Prized Unicorns are attacking, each creature the defending player controls can block either one of them. (The defending player chooses.) A creature that can block multiple creatures, like Palace Guard, must block both of them."}],"imageName":"prized unicorn"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Red"],"multiverseid":205231,"name":"Prodigal Pyromancer","subtypes":["Human","Wizard"],"cmc":3,"rarity":"Uncommon","artist":"Jeremy Jarvis","power":"1","toughness":"1","manaCost":"{2}{R}","text":"{T}: Prodigal Pyromancer deals 1 damage to target creature or player.","flavor":"\"What am I looking at? Ashes, dead man.\"","number":"152","rulings":[{"date":"2007-02-01","text":"This is the timeshifted version of Prodigal Sorcerer."}],"imageName":"prodigal pyromancer"},{"layout":"normal","type":"Creature - Hydra","types":["Creature"],"colors":["Green"],"multiverseid":205112,"name":"Protean Hydra","subtypes":["Hydra"],"cmc":1,"rarity":"Rare","artist":"Jim Murray","power":"0","toughness":"0","manaCost":"{X}{G}","text":"Protean Hydra enters the battlefield with X +1/+1 counters on it.\n\nIf damage would be dealt to Protean Hydra, prevent that damage and remove that many +1/+1 counters from it.\n\nWhenever a +1/+1 counter is removed from Protean Hydra, put two +1/+1 counters on it at the beginning of the next end step.","number":"194","rulings":[{"date":"2009-10-01","text":"All damage that would be dealt to Protean Hydra is prevented, even if it doesn't have that many +1/+1 counters on it. This is true even if Protean Hydra has no +1/+1 counters on it at all (and is able to remain on the battlefield because some other effect is boosting its toughness). If the amount of damage that would be dealt to Protean Hydra is greater than the number of +1/+1 counters on it, all the +1/+1 counters on Protean Hydra are removed from it."},{"date":"2009-10-01","text":"If unpreventable damage is dealt to Protean Hydra, the Hydra's second ability will try to prevent it and fail (meaning that damage has its normal results), and it will also remove that many +1/+1 counters from Protean Hydra."},{"date":"2009-10-01","text":"Protean Hydra's last ability triggers whenever a +1/+1 counter is removed from it for any reason, not just when a +1/+1 counter is removed by its second ability."},{"date":"2009-10-01","text":"If multiple +1/+1 counters are removed from Protean Hydra at once, its last ability will trigger that many times."},{"date":"2009-10-01","text":"If a -1/-1 counter is put on Protean Hydra while it has +1/+1 counters on it, that -1/-1 counter and a +1/+1 counter will be removed from it as a state-based action. This will cause Protean Hydra's last ability to trigger."},{"date":"2009-10-01","text":"If any +1/+1 counters are removed from Protean Hydra during the end step, its last ability will trigger and set up a delayed triggered ability that will trigger at the beginning of the next end step (which is near the end of the following turn)."}],"imageName":"protean hydra"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205067,"name":"Pyretic Ritual","cmc":2,"rarity":"Common","artist":"James Paick","manaCost":"{1}{R}","text":"Add {R}{R}{R} to your mana pool.","flavor":"The Multiverse is filled with limitless power just waiting for someone to reach out and seize it.","number":"153","rulings":[{"date":"2010-08-15","text":"Pyretic Ritual is not a mana ability and doesn't behave like one. You cast it as a spell. It uses the stack. It can be responded to, and it can be countered."},{"date":"2010-08-15","text":"In the same vein, you can cast Pyretic Ritual only at a time when you could cast any other instant, not at a time when you could activate a mana ability. For example, you can't cast Pyretic Ritual in the midst of casting another spell; you'd need to cast Pyretic Ritual first."}],"imageName":"pyretic ritual"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":208009,"name":"Pyroclasm","cmc":2,"rarity":"Uncommon","artist":"John Avon","manaCost":"{1}{R}","text":"Pyroclasm deals 2 damage to each creature.","flavor":"\"Who'd want to ignite things one at a time?\"\n\n—Chandra Nalaar","number":"154","imageName":"pyroclasm"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":205028,"name":"Quag Sickness","subtypes":["Aura"],"cmc":3,"rarity":"Common","artist":"Martina Pilcerova","manaCost":"{2}{B}","text":"Enchant creature\n\nEnchanted creature gets -1/-1 for each Swamp you control.","flavor":"The dread gases didn't kill Farbid. But as he lay in the muck, miserable and helpless, watching ghouls and rats advance on him, he wished they had.","number":"111","rulings":[{"date":"2010-08-15","text":"This ability counts the number of Swamps controlled by Quag Sickness's controller, not the enchanted creature's controller (in case they're different players)."},{"date":"2010-08-15","text":"This bonus is not fixed; it changes as the number of Swamps you control changes."},{"date":"2010-08-15","text":"The ability cares about lands with the land type Swamp, not necessarily lands named Swamp."}],"imageName":"quag sickness"},{"layout":"normal","type":"Creature - Skeleton Warrior","types":["Creature"],"colors":["Black"],"multiverseid":205066,"name":"Reassembling Skeleton","subtypes":["Skeleton","Warrior"],"cmc":2,"rarity":"Uncommon","artist":"Austin Hsu","power":"1","toughness":"1","manaCost":"{1}{B}","text":"{1}{B}: Return Reassembling Skeleton from your graveyard to the battlefield tapped.","flavor":"Though you may see the same bones, you'll never see the same skeleton twice.","number":"112","imageName":"reassembling skeleton"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208227,"name":"Redirect","cmc":2,"rarity":"Rare","artist":"Izzy","manaCost":"{U}{U}","text":"You may choose new targets for target spell.","flavor":"\"Your strategy is marvelous. I've just made a few minor adjustments.\"\n\n—Veris, watcher of Indi Keep","number":"71","rulings":[{"date":"2010-08-15","text":"You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."},{"date":"2010-08-15","text":"If the targeted spell is modal (that is, it says \"Choose one --\" or the like), you can't choose a different mode."},{"date":"2010-08-15","text":"If you cast Redirect targeting a spell that targets a spell on the stack (like Cancel does, for example), you can't change that spell's target to itself. You can, however, change that spell's target to Redirect. If you do, that spell will be countered when it tries to resolve because Redirect will have left the stack by then."},{"date":"2010-08-15","text":"Redirect can target any spell, not just an instant or sorcery spell. For example, you could use it to change the target of an Aura spell. However, if the targeted spell has no targets (for example, if it's an instant or sorcery spell that doesn't specifically use the word \"target,\" or if it's a creature spell), Redirect won't have any effect on it."}],"imageName":"redirect"},{"layout":"normal","type":"Creature - Rat","types":["Creature"],"colors":["Black"],"multiverseid":205082,"name":"Relentless Rats","subtypes":["Rat"],"cmc":3,"rarity":"Uncommon","artist":"Thomas M. Baxa","power":"2","toughness":"2","manaCost":"{1}{B}{B}","text":"Relentless Rats gets +1/+1 for each other creature on the battlefield named Relentless Rats.\n\nA deck can have any number of cards named Relentless Rats.","number":"113","rulings":[{"date":"2004-12-01","text":"Yes, you're allowed to have a deck consisting of sixty Relentless Rats and nothing else."},{"date":"2004-12-01","text":"Relentless Rats's last ability overrides the normal limit of four of an individual card in a Constructed deck."}],"imageName":"relentless rats"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":205038,"name":"Reverberate","cmc":2,"rarity":"Rare","artist":"jD","manaCost":"{R}{R}","text":"Copy target instant or sorcery spell. You may choose new targets for the copy.","flavor":"\"I'm not indecisive. I just don't like to limit my options.\"\n\n—Maxti, pyromancer","number":"155","rulings":[{"date":"2010-08-15","text":"Reverberate can target (and copy) any instant or sorcery spell, not just one with targets. It doesn't matter who controls it."},{"date":"2010-08-15","text":"When Reverberate resolves, it creates a copy of a spell. You control the copy. That copy is created on the stack, so it's not \"cast.\" Abilities that trigger when a player casts a spell won't trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."},{"date":"2010-08-15","text":"The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."},{"date":"2010-08-15","text":"If the spell Reverberate copies is modal (that is, it says \"Choose one --\" or the like), the copy will have the same mode. You can't choose a different one."},{"date":"2010-08-15","text":"If the spell Reverberate copies has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."},{"date":"2010-08-15","text":"You can't choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it with Reverberate, the copy of Fling will also deal 3 damage to its target."},{"date":"2010-08-15","text":"If the copy says that it affects \"you,\" it affects the controller of the copy, not the controller of the original spell. Similarly, if the copy says that it affects an \"opponent,\" it affects an opponent of the copy's controller, not an opponent of the original spell's controller."}],"imageName":"reverberate"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205113,"name":"Rise from the Grave","cmc":5,"rarity":"Uncommon","artist":"Vance Kovacs","manaCost":"{4}{B}","text":"Put target creature card from a graveyard onto the battlefield under your control. That creature is a black Zombie in addition to its other colors and types.","flavor":"\"Death is no excuse for disobedience.\"\n\n—Liliana Vess","number":"114","rulings":[{"date":"2009-10-01","text":"Rise from the Grave doesn't overwrite any previous colors or types. Rather, it adds another color and another subtype."},{"date":"2009-10-01","text":"If the targeted creature is normally colorless, it will simply become black. It won't be both black and colorless."},{"date":"2009-10-01","text":"A later effect that changes the affected creature's colors will overwrite that part of Rise from the Grave effect; the creature will be just the new color. The same is true about an effect that changes the affected creature's types or subtypes."},{"date":"2009-10-01","text":"A \"creature card\" is any card with the type Creature, even if it has other types such as Artifact, Enchantment, or Land. Older cards of type Summon are also Creature cards."}],"imageName":"rise from the grave"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["White"],"multiverseid":205055,"name":"Roc Egg","subtypes":["Bird"],"cmc":3,"rarity":"Uncommon","artist":"Paul Bonner","power":"0","toughness":"3","manaCost":"{2}{W}","text":"Defender (This creature can't attack.)\n\nWhen Roc Egg dies, put a 3/3 white Bird creature token with flying onto the battlefield.","number":"25","imageName":"roc egg"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205114,"name":"Rootbound Crag","rarity":"Rare","artist":"Matt Stewart","text":"Rootbound Crag enters the battlefield tapped unless you control a Mountain or a Forest.\n\n{T}: Add {R} or {G} to your mana pool.","number":"227","rulings":[{"date":"2009-10-01","text":"This checks for lands you control with the land type Mountain or Forest, not for lands named Mountain or Forest. The lands it checks for don't have to be basic lands. For example, if you control Temple Garden (a nonbasic land with the land types Forest and Plains), Rootbound Crag will enter the battlefield untapped."},{"date":"2009-10-01","text":"As This is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."}],"imageName":"rootbound crag"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":205047,"name":"Rotting Legion","subtypes":["Zombie"],"cmc":5,"rarity":"Common","artist":"Carl Critchlow","power":"4","toughness":"5","manaCost":"{4}{B}","text":"Rotting Legion enters the battlefield tapped.","flavor":"Zombies have one speed: shamble.","number":"115","imageName":"rotting legion"},{"layout":"normal","type":"Creature - Human Assassin","types":["Creature"],"colors":["Black"],"multiverseid":205233,"name":"Royal Assassin","subtypes":["Human","Assassin"],"cmc":3,"rarity":"Rare","artist":"Mark Zug","power":"1","toughness":"1","manaCost":"{1}{B}{B}","text":"{T}: Destroy target tapped creature.","flavor":"An assassin is a king's most trusted courier, ensuring his messages are heard by even the most unwilling recipients.","number":"116","rulings":[{"date":"2004-10-04","text":"Can't target itself because you choose the target before you tap him. At that time he is not yet a legal target."},{"date":"2004-10-04","text":"If the creature is no longer tapped when the Assassin's ability resolves, then the ability is countered."}],"imageName":"royal assassin"},{"layout":"normal","type":"Creature - Bear","types":["Creature"],"colors":["Green"],"multiverseid":207337,"name":"Runeclaw Bear","subtypes":["Bear"],"cmc":2,"rarity":"Common","artist":"Jesper Ejsing","power":"2","toughness":"2","manaCost":"{1}{G}","flavor":"\"Nature has grown tired of the impositions of men and will begin to outfit its creations with tools for bloody instruction.\"\n\n—Hadi Kasten, Calla Dale naturalist","number":"195","imageName":"runeclaw bear"},{"layout":"normal","type":"Creature - Wolf","types":["Creature"],"colors":["Green"],"multiverseid":205023,"name":"Sacred Wolf","subtypes":["Wolf"],"cmc":3,"rarity":"Common","artist":"Matt Stewart","power":"3","toughness":"1","manaCost":"{2}{G}","text":"Hexproof (This creature can't be the target of spells or abilities your opponents control.)","flavor":"\"I raised my bow, and the wolf stared at me. Under its gaze, my finger would not release the string.\"\n\n—Aref the Hunter","number":"196","imageName":"sacred wolf"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":205115,"name":"Safe Passage","cmc":3,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{2}{W}","text":"Prevent all damage that would be dealt to you and creatures you control this turn.","flavor":"With one flap of her wings, the angel beat back the fires of war.","number":"26","rulings":[{"date":"2009-10-01","text":"Safe Passage prevents all damage, not just combat damage, that would be dealt to you and creatures you control this turn."},{"date":"2009-10-01","text":"Safe Passage will prevent damage dealt to creatures that weren't on the battlefield at the time it resolved."},{"date":"2009-10-01","text":"Safe Passage doesn't prevent damage that would be dealt to planeswalkers you control. Although it can't prevent combat damage that would be dealt to your planeswalkers, it can still prevent noncombat damage that your opponent would want to redirect from you to one of your planeswalkers. Just apply Safe Passage's prevention effect to that damage first, and there won't be any damage to redirect."},{"date":"2009-10-01","text":"Safe Passage has no effect on damage that's already been dealt."}],"imageName":"safe passage"},{"layout":"normal","type":"Creature - Merfolk Rogue","types":["Creature"],"colors":["Blue"],"multiverseid":205004,"name":"Scroll Thief","subtypes":["Merfolk","Rogue"],"cmc":3,"rarity":"Common","artist":"Alex Horley-Orlandelli","power":"1","toughness":"3","manaCost":"{2}{U}","text":"Whenever Scroll Thief deals combat damage to a player, draw a card.","flavor":"I've learned how to disable wards, pick locks, and decode the Agaran language—all before even reading the scroll!","number":"72","rulings":[{"date":"2010-08-15","text":"The ability triggers just once each time Scroll Thief deals combat damage to a player, regardless of how much damage it deals."},{"date":"2010-08-15","text":"The ability is mandatory. You must draw a card when it resolves."}],"imageName":"scroll thief"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":205234,"name":"Serra Angel","subtypes":["Angel"],"cmc":5,"rarity":"Uncommon","artist":"Greg Staples","power":"4","toughness":"4","manaCost":"{3}{W}{W}","text":"Flying\n\nVigilance (Attacking doesn't cause this creature to tap.)","flavor":"Perfect justice in service of a perfect will.","number":"27","imageName":"serra angel"},{"layout":"normal","type":"Creature - Human Monk","types":["Creature"],"colors":["White"],"multiverseid":204989,"name":"Serra Ascendant","subtypes":["Human","Monk"],"cmc":1,"rarity":"Rare","artist":"Anthony Palumbo","power":"1","toughness":"1","manaCost":"{W}","text":"Lifelink (Damage dealt by this creature also causes you to gain that much life.)\n\nAs long as you have 30 or more life, Serra Ascendant gets +5/+5 and has flying.","number":"28","rulings":[{"date":"2010-08-15","text":"In a Two-Headed Giant game, anything that cares about your life total checks your team's life total. (This is a change from previous rules.) Serra Ascendant gets +5/+5 and has flying as long as your team has 30 or more life."}],"imageName":"serra ascendant"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red"],"multiverseid":208002,"name":"Shiv's Embrace","subtypes":["Aura"],"cmc":4,"rarity":"Uncommon","artist":"Dave Kendall","manaCost":"{2}{R}{R}","text":"Enchant creature\n\nEnchanted creature gets +2/+2 and has flying.\n\n{R}: Enchanted creature gets +1/+0 until end of turn.","number":"156","rulings":[{"date":"2010-08-15","text":"Only Shiv's Embrace's controller (who is not necessarily the enchanted creature's controller) can activate its activated ability."},{"date":"2010-08-15","text":"When Shiv's Embrace's activated ability resolves, the creature Shiv's Embrace is enchanting at that time will get +1/+0 (regardless of what creature Shiv's Embrace was enchanting when the ability was activated). If Shiv's Embrace has left the battlefield by then, the creature it was enchanting at the time it left the battlefield will get +1/+0."}],"imageName":"shiv's embrace"},{"layout":"normal","type":"Creature - Elephant","types":["Creature"],"colors":["White"],"multiverseid":208293,"name":"Siege Mastodon","subtypes":["Elephant"],"cmc":5,"rarity":"Common","artist":"Matt Cavotta","power":"3","toughness":"5","manaCost":"{4}{W}","flavor":"\"The walls of the wicked will fall before us. Ready the siege engines. We proceed to war!\"\n\n—General Avitora","number":"29","imageName":"siege mastodon"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":205118,"name":"Sign in Blood","cmc":2,"rarity":"Common","artist":"Howard Lyon","manaCost":"{B}{B}","text":"Target player draws two cards and loses 2 life.","flavor":"Little agonies pave the way to greater power.","number":"117","imageName":"sign in blood"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":205119,"name":"Silence","cmc":1,"rarity":"Rare","artist":"Wayne Reynolds","manaCost":"{W}","text":"Your opponents can't cast spells this turn. (Spells cast before this resolves are unaffected.)","flavor":"\"Take a quiet moment to reflect on your sins.\"\n\n—Cleph, Order of Redeemed Souls","number":"30","rulings":[{"date":"2009-10-01","text":"Silence won't affect spells that your opponents cast before you cast Silence. (In other words, it can't be used as a retroactive Cancel.) Silence also won't stop your opponents from casting spells after you cast Silence but before Silence resolves."},{"date":"2009-10-01","text":"The only thing Silence does is prevent your opponents from casting spells. They can still activate abilities, including abilities of cards in their hands (like cycling). Their triggered abilities work as normal, they can still play lands, and so on."}],"imageName":"silence"},{"layout":"normal","type":"Creature - Cat","types":["Creature"],"colors":["White"],"multiverseid":208283,"name":"Silvercoat Lion","subtypes":["Cat"],"cmc":2,"rarity":"Common","artist":"Terese Nielsen","power":"2","toughness":"2","manaCost":"{1}{W}","flavor":"\"In the wild, white fur like mine is an aberration. We lack natural camouflage, but the inability to hide encourages other strengths.\"\n\n—Ajani Goldmane","number":"31","imageName":"silvercoat lion"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":205120,"name":"Sleep","cmc":4,"rarity":"Uncommon","artist":"Chris Rahn","manaCost":"{2}{U}{U}","text":"Tap all creatures target player controls. Those creatures don't untap during that player's next untap step.","flavor":"\"I give them dreams so wondrous that they hesitate to return to the world of the conscious.\"\n\n—Garild, merfolk mage","number":"73","rulings":[{"date":"2009-10-01","text":"The second part of Sleep's effect affects all creatures the targeted player controls as Sleep resolves, not just the ones that Sleep actually caused to become tapped."},{"date":"2009-10-01","text":"Sleep tracks both the player and the creatures. If one of the creatures controlled by the targeted player as Sleep resolves changes controllers, the creature will untap as normal during its new controller's next untap step."}],"imageName":"sleep"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":205095,"name":"Solemn Offering","cmc":3,"rarity":"Common","artist":"Sam Wood","manaCost":"{2}{W}","text":"Destroy target artifact or enchantment. You gain 4 life.","flavor":"\"A relic donation is suggested.\"\n\n\"The suggestion is mandatory.\"\n\n—Temple signs","number":"32","rulings":[{"date":"2009-10-01","text":"If the targeted permanent is an illegal target by the time Solemn Offering would resolve, the entire spell is countered. You won't gain any life."}],"imageName":"solemn offering"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":205069,"name":"Sorcerer's Strongbox","cmc":4,"rarity":"Uncommon","artist":"Chuck Lukacs","manaCost":"{4}","text":"{2}, {T}: Flip a coin. If you win the flip, sacrifice Sorcerer's Strongbox and draw three cards.","flavor":"Simun the Quiet filled the chest with his most precious thoughts. But in a fit of paranoia, he locked up the memory of where he hid the key.","number":"213","rulings":[{"date":"2010-08-15","text":"If you lose the flip, nothing happens."},{"date":"2010-08-15","text":"If you no longer control Sorcerer's Strongbox by the time you win the flip, you won't be able to sacrifice it. You'll still draw three cards, though."}],"imageName":"sorcerer's strongbox"},{"layout":"normal","type":"Creature - Wurm","types":["Creature"],"colors":["Green"],"multiverseid":205123,"name":"Spined Wurm","subtypes":["Wurm"],"cmc":5,"rarity":"Common","artist":"Carl Critchlow","power":"5","toughness":"4","manaCost":"{4}{G}","flavor":"\"They're as much like plants as animals. Leave them unchecked, and they'll choke out all other forms of life.\"\n\n—Hadi Kasten, Calla Dale naturalist","number":"197","imageName":"spined wurm"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["White"],"multiverseid":208279,"name":"Squadron Hawk","subtypes":["Bird"],"cmc":2,"rarity":"Common","artist":"Rob Alexander","power":"1","toughness":"1","manaCost":"{1}{W}","text":"Flying\n\nWhen Squadron Hawk enters the battlefield, you may search your library for up to three cards named Squadron Hawk, reveal them, put them into your hand, then shuffle your library.","number":"33","imageName":"squadron hawk"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":205048,"name":"Stabbing Pain","cmc":1,"rarity":"Common","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{B}","text":"Target creature gets -1/-1 until end of turn. Tap that creature.","flavor":"\"You can take the fight out of nearly any creature if you know where its soft spot is.\"\n\n—Guttor, flesh-warper","number":"118","rulings":[{"date":"2010-08-15","text":"You may target any creature with Stabbing Pain. It's okay if it's already tapped."},{"date":"2010-08-15","text":"If Stabbing Pain targets an untapped creature with 1 toughness, that creature gets -1/-1, then it becomes tapped, then (after Stabbing Pain resolves) it's put into the graveyard as a state-based action. Similarly, if Stabbing Pain targets an untapped creature with 1 less than lethal damage marked on it (such as a 3/3 creature with 2 damage marked on it), that creature gets -1/-1, then it becomes tapped, then (after Stabbing Pain resolves) it's destroyed as a state-based action. In each case, any abilities that trigger when that creature becomes tapped will trigger."}],"imageName":"stabbing pain"},{"layout":"normal","type":"Artifact Creature - Construct","types":["Artifact","Creature"],"colors":[],"multiverseid":205036,"name":"Steel Overseer","subtypes":["Construct"],"cmc":2,"rarity":"Rare","artist":"Chris Rahn","power":"1","toughness":"1","manaCost":"{2}","text":"{T}: Put a +1/+1 counter on each artifact creature you control.","flavor":"\"The world is already run by all manner of machines. One day, they'll remind us of that fact.\"\n\n—Sargis Haz, artificer","number":"214","rulings":[{"date":"2010-08-15","text":"Steel Overseer is affected by its own ability (assuming that, by the time the ability resolves, you still control Steel Overseer and its types haven't changed). You'll put a +1/+1 counter on it, as well as on each other artifact creature you control."}],"imageName":"steel overseer"},{"layout":"normal","type":"Artifact Creature - Golem","types":["Artifact","Creature"],"colors":[],"multiverseid":205056,"name":"Stone Golem","subtypes":["Golem"],"cmc":5,"rarity":"Uncommon","artist":"Martina Pilcerova","power":"4","toughness":"4","manaCost":"{5}","flavor":"The sculptor, like most artists, put his heart and soul in his work. But the newly awakened golem decided he wanted his creator's other, more tangible parts.","number":"215","imageName":"stone golem"},{"layout":"normal","type":"Creature - Pegasus","types":["Creature"],"colors":["White"],"multiverseid":208294,"name":"Stormfront Pegasus","subtypes":["Pegasus"],"cmc":2,"rarity":"Common","artist":"rk post","power":"2","toughness":"1","manaCost":"{1}{W}","text":"Flying","flavor":"\"At summer's end, the pegasus herd stampedes across the sky. Their silent footfalls taunt the clouds and bid the rains to come.\"\n\n—Stormfront fable","number":"34","imageName":"stormfront pegasus"},{"layout":"normal","type":"Creature - Leviathan","types":["Creature"],"colors":["Blue"],"multiverseid":205029,"name":"Stormtide Leviathan","subtypes":["Leviathan"],"cmc":8,"rarity":"Rare","artist":"Karl Kopinski","power":"8","toughness":"8","manaCost":"{5}{U}{U}{U}","text":"Islandwalk (This creature is unblockable as long as defending player controls an Island.)\n\nAll lands are Islands in addition to their other types.\n\nCreatures without flying or islandwalk can't attack.","number":"74","rulings":[{"date":"2010-08-15","text":"Islandwalk cares about lands with the land type Island, not necessarily lands named Island."},{"date":"2010-08-15","text":"Stormtide Leviathan's second ability causes each land on the battlefield to have the land type Island. Each land thus has the ability to tap to add {U} to its controller's mana pool. This effect doesn't change anything else about those lands, including their names, other subtypes, other abilities, or whether they're legendary, basic, or snow."},{"date":"2010-08-15","text":"If Stormtide Leviathan loses its abilities, all lands on the battlefield (including those that enter the battlefield later on) will still be Islands in addition to their other types and will still be able to tap to produce {U}. The way continuous effects work, Stormtide Leviathan's type-changing ability is applied before the effect that removes that ability is applied."},{"date":"2010-08-15","text":"Stormtide Leviathan's third ability affects all creatures with neither flying nor islandwalk, regardless of who controls them. They can't attack any player or planeswalker."}],"imageName":"stormtide leviathan"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["White"],"multiverseid":205030,"name":"Sun Titan","subtypes":["Giant"],"cmc":6,"rarity":"Mythic Rare","artist":"Todd Lockwood","power":"6","toughness":"6","manaCost":"{4}{W}{W}","text":"Vigilance\n\nWhenever Sun Titan enters the battlefield or attacks, you may return target permanent card with converted mana cost 3 or less from your graveyard to the battlefield.","flavor":"A blazing sun that never sets.","number":"35","rulings":[{"date":"2010-08-15","text":"A permanent card is an artifact, creature, enchantment, land, or planeswalker card."},{"date":"2010-08-15","text":"The converted mana cost of a card in your graveyard is determined solely by the mana symbols printed in its upper right corner. The converted mana cost is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {3}{U}{U} has converted mana cost 5."},{"date":"2010-08-15","text":"If the mana cost of a card in your graveyard includes {X}, X is considered to be 0."},{"date":"2010-08-15","text":"If a card in your graveyard has no mana symbols in its upper right corner (because it's a land card, for example), its converted mana cost is 0."}],"imageName":"sun titan"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205124,"name":"Sunpetal Grove","rarity":"Rare","artist":"Jason Chan","text":"Sunpetal Grove enters the battlefield tapped unless you control a Forest or a Plains.\n\n{T}: Add {G} or {W} to your mana pool.","number":"228","rulings":[{"date":"2009-10-01","text":"This checks for lands you control with the land type Forest or Plains, not for lands named Forest or Plains. The lands it checks for don't have to be basic lands. For example, if you control Hallowed Fountain (a nonbasic land with the land types Plains and Island), Sunpetal Grove will enter the battlefield untapped."},{"date":"2009-10-01","text":"As This is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."}],"imageName":"sunpetal grove"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":213621,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"John Avon","text":"B","number":"238","variations":[213623,213622,213620],"imageName":"swamp1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":213620,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Larry Elmore","text":"B","number":"239","variations":[213623,213622,213621],"imageName":"swamp2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":213622,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Alex Horley-Orlandelli","text":"B","number":"240","variations":[213623,213620,213621],"imageName":"swamp3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":213623,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Jim Pavelec","text":"B","number":"241","variations":[213622,213620,213621],"imageName":"swamp4"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":205044,"name":"Sword of Vengeance","subtypes":["Equipment"],"cmc":3,"rarity":"Rare","artist":"Dan Scott","manaCost":"{3}","text":"Equipped creature gets +2/+0 and has first strike, vigilance, trample, and haste.\n\nEquip {3} ({3}: Attach to target creature you control. Equip only as a sorcery.)","flavor":"When wielded by a true believer, it matters little whether the sword is a relic or a replica.","number":"216","imageName":"sword of vengeance"},{"layout":"normal","type":"Creature - Elf Scout","types":["Creature"],"colors":["Green"],"multiverseid":204976,"name":"Sylvan Ranger","subtypes":["Elf","Scout"],"cmc":2,"rarity":"Common","artist":"Christopher Moeller","power":"1","toughness":"1","manaCost":"{1}{G}","text":"When Sylvan Ranger enters the battlefield, you may search your library for a basic land card, reveal it, put it into your hand, then shuffle your library.","flavor":"\"Not all paths are found on the forest floor.\"","number":"198","imageName":"sylvan ranger"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":205058,"name":"Temple Bell","cmc":3,"rarity":"Rare","artist":"Mark Tedin","manaCost":"{3}","text":"{T}: Each player draws a card.","flavor":"Enlightenment is not gained by striking the bell or hearing its toll. It's found in the silence that follows.","number":"217","imageName":"temple bell"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":205236,"name":"Terramorphic Expanse","rarity":"Common","artist":"Dan Scott","text":"{T}, Sacrifice Terramorphic Expanse: Search your library for a basic land card and put it onto the battlefield tapped. Then shuffle your library.","number":"229","imageName":"terramorphic expanse"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":204973,"name":"Thunder Strike","cmc":2,"rarity":"Common","artist":"Wayne Reynolds","manaCost":"{1}{R}","text":"Target creature gets +2/+0 and gains first strike until end of turn. (It deals combat damage before creatures without first strike.)","flavor":"Lightning reflexes, thunderous might.","number":"157","rulings":[{"date":"2010-08-15","text":"Thunder Strike can target any creature, even one that already has first strike or double strike. (If it affects such a creature, it will, in effect, just give it +2/+0.)"},{"date":"2010-08-15","text":"If a creature doesn't have first strike, granting it first strike after combat damage has been dealt in the first-strike combat damage step won't prevent it from dealing combat damage. It will still assign and deal its combat damage in the second combat damage step."}],"imageName":"thunder strike"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":205022,"name":"Time Reversal","cmc":5,"rarity":"Mythic Rare","artist":"Howard Lyon","manaCost":"{3}{U}{U}","text":"Each player shuffles his or her hand and graveyard into his or her library, then draws seven cards. Exile Time Reversal.","flavor":"\"Optimists see the world as they wish it to be. Pessimists see the world as it is. Must these roles be mutually exclusive?\" \n\n—Evo Ragus","number":"75","imageName":"time reversal"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White"],"multiverseid":205014,"name":"Tireless Missionaries","subtypes":["Human","Cleric"],"cmc":5,"rarity":"Common","artist":"Dave Kendall","power":"2","toughness":"3","manaCost":"{4}{W}","text":"When Tireless Missionaries enters the battlefield, you gain 3 life.","flavor":"If they succeed in their holy work, their order will vanish into welcome obscurity, for there will be no more souls to redeem.","number":"36","imageName":"tireless missionaries"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":205000,"name":"Tome Scour","cmc":1,"rarity":"Common","artist":"Steven Belledin","manaCost":"{U}","text":"Target player puts the top five cards of his or her library into his or her graveyard.","flavor":"Genius is overrated, especially when it's someone else's.","number":"76","rulings":[{"date":"2009-10-01","text":"If there are fewer than five cards in the targeted player's library, that player puts all the cards from his or her library into his or her graveyard."}],"imageName":"tome scour"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":208221,"name":"Traumatize","cmc":5,"rarity":"Rare","artist":"Greg Staples","manaCost":"{3}{U}{U}","text":"Target player puts the top half of his or her library, rounded down, into his or her graveyard.","flavor":"He was left with just enough memory to understand what he had lost.","number":"77","rulings":[{"date":"2004-10-04","text":"The player can put the cards in their graveyard in any order they choose."}],"imageName":"traumatize"},{"layout":"normal","type":"Artifact Creature - Construct","types":["Artifact","Creature"],"colors":[],"multiverseid":206719,"name":"Triskelion","subtypes":["Construct"],"cmc":6,"rarity":"Rare","artist":"Christopher Moeller","power":"1","toughness":"1","manaCost":"{6}","text":"Triskelion enters the battlefield with three +1/+1 counters on it.\n\nRemove a +1/+1 counter from Triskelion: Triskelion deals 1 damage to target creature or player.","flavor":"\"Why do bad things always come in threes?\"\n\n—Gisulf, expedition survivor","number":"218","rulings":[{"date":"2010-08-15","text":"If you activate the ability of an attacking or blocking Triskelion during the declare blockers step, it will deal less combat damage as a result. If you wait until the combat damage step, but Triskelion is dealt lethal damage, it'll be destroyed before you get a chance to activate its ability."},{"date":"2010-08-15","text":"If Triskelion has damage marked on it, activating its ability may cause that damage to become lethal. For example, say a Triskelion with two +1/+1 counters on it has been dealt 2 damage earlier in the turn. If you activate its ability by removing a +1/+1 counter from it, it now has 2 toughness and is destroyed as a state-based action. You won't be able to remove the other +1/+1 counter from it to activate its ability again. The first activation of the ability will still resolve."}],"imageName":"triskelion"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":205237,"name":"Unholy Strength","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Terese Nielsen","manaCost":"{B}","text":"Enchant creature\n\nEnchanted creature gets +2/+1.","flavor":"\"Born under the moon, the second child will stumble on temptation and seek power in the dark places of the heart.\"\n\n—Codex of the Constellari","number":"119","imageName":"unholy strength"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":208223,"name":"Unsummon","cmc":1,"rarity":"Common","artist":"Izzy","manaCost":"{U}","text":"Return target creature to its owner's hand.","flavor":"\"You're trespassing in my reality. Ask permission next time.\"\n\n—Simun the Quiet","number":"78","imageName":"unsummon"},{"layout":"normal","type":"Creature - Archon","types":["Creature"],"colors":["White"],"multiverseid":208288,"name":"Vengeful Archon","subtypes":["Archon"],"cmc":7,"rarity":"Rare","artist":"Greg Staples","power":"7","toughness":"7","manaCost":"{4}{W}{W}{W}","text":"Flying\n\n{X}: Prevent the next X damage that would be dealt to you this turn. If damage is prevented this way, Vengeful Archon deals that much damage to target player.","number":"37","rulings":[{"date":"2010-08-15","text":"The only target of Vengeful Archon's ability is the player it may deal damage to. You choose that target as you activate the ability, not at the time it prevents damage."},{"date":"2010-08-15","text":"If the targeted player is an illegal target by the time the ability resolves, the entire ability is countered. No damage will be prevented."},{"date":"2010-08-15","text":"Vengeful Archon's ability doesn't have you choose a source of damage. It will apply to the next X damage you would be dealt that turn, regardless of where that damage comes from. It doesn't matter whether the damage would all be dealt at the same time. For example, if X is 4 and you'd be dealt 3 damage by Lightning Bolt, that 3 damage is prevented and Vengeful Archon deals 3 damage to the targeted player. The prevention effect will still apply to the next 1 damage you'd be dealt that turn."},{"date":"2010-08-15","text":"The effect of Vengeful Archon's ability is not a redirection effect. If it prevents damage, Vengeful Archon (not the source of that damage) deals damage to the targeted player as part of that prevention effect. Vengeful Archon is the source of the new damage, so the characteristics of the original source (such as its color, or whether it had lifelink or deathtouch) don't affect this damage. The new damage is not combat damage, even if the prevented damage was. Since you control the source of the new damage, if you targeted an opponent with Vengeful Archon's ability, you may have Vengeful Archon deal its damage to a planeswalker that opponent controls."},{"date":"2010-08-15","text":"Whether the targeted player is still a legal target is no longer checked after Vengeful Archon's ability resolves. For example, if a player targeted by Vengeful Archon's ability puts Leyline of Sanctity (which says \"You can't be the target of spells or abilities your opponents control\") onto the battlefield after the ability resolves but before it prevents damage, the ability will still prevent damage and still deal damage to that player. If Vengeful Archon can't deal damage to the targeted player (because the player is no longer in the game in a multiplayer game, for example), it will still prevent damage. It just won't deal any damage itself."},{"date":"2010-08-15","text":"If Vengeful Archon's ability doesn't prevent any damage (perhaps because a different prevention effect is applied to the damage that would be dealt to you, or because the damage is unpreventable), Vengeful Archon won't deal any damage itself."},{"date":"2010-08-15","text":"If Vengeful Archon's ability prevents damage, Vengeful Archon deals its damage immediately afterward as part of that same prevention effect. This happens before state-based actions are checked, and before any player can cast spells or activate abilities. If a spell or ability would have caused that damage to be dealt, this happens before that spell or ability resumes its resolution."},{"date":"2010-08-15","text":"If you would be dealt combat damage by multiple attacking creatures, you choose which of that damage to prevent. For example, if X is 3 and you'd be dealt combat damage by a 1/3 Scroll Thief and a 3/5 Siege Mastodon, you might choose to prevent 1 damage from the Scroll Thief and 2 damage from the Siege Mastodon. You don't decide until the point at which the creatures would deal their damage."},{"date":"2010-08-15","text":"If the amount of damage that would be dealt to you is in excess of the amount of damage that Vengeful Archon's ability would prevent, that source deals its excess damage to you at the same time that the rest of it is prevented. Then Vengeful Archon deals its damage."},{"date":"2010-08-15","text":"If multiple effects modify how damage will be dealt, the player who would be dealt damage chooses the order to apply the effects. For example, say you've activated Vengeful Archon's ability with X = 3 targeting Player A, and you've activated Vengeful Archon's ability with X = 1 targeting Player B. You're dealt 2 damage. You can apply the first prevention effect (dealing 2 damage to Player A), or you can apply the second prevention effect (dealing 1 damage to Player B) followed by the first prevention effect (dealing 1 damage to Player A). The unused portions of the prevention effects remain."}],"imageName":"vengeful archon"},{"layout":"normal","type":"Creature - Vampire Wizard","types":["Creature"],"colors":["Black"],"multiverseid":205232,"name":"Viscera Seer","subtypes":["Vampire","Wizard"],"cmc":1,"rarity":"Common","artist":"John Stanko","power":"1","toughness":"1","manaCost":"{B}","text":"Sacrifice a creature: Scry 1. (To scry 1, look at the top card of your library, then you may put that card on the bottom of your library.)","flavor":"In matters of life and death, he trusts his gut.","number":"120","rulings":[{"date":"2010-08-15","text":"You can sacrifice Viscera Seer to activate its own ability."},{"date":"2010-08-15","text":"If you sacrifice an attacking or blocking creature during the declare blockers step, it won't deal combat damage. If you wait until the combat damage step, but that creature is dealt lethal damage, it'll be destroyed before you get a chance to sacrifice it."}],"imageName":"viscera seer"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red"],"multiverseid":208004,"name":"Volcanic Strength","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Izzy","manaCost":"{1}{R}","text":"Enchant creature\n\nEnchanted creature gets +2/+2 and has mountainwalk. (It's unblockable as long as defending player controls a Mountain.)","flavor":"His blood boiled over, and he erupted with fists of stone.","number":"158","imageName":"volcanic strength"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206332,"name":"Voltaic Key","cmc":1,"rarity":"Uncommon","artist":"Franz Vohwinkel","manaCost":"{1}","text":"{1}, {T}: Untap target artifact.","flavor":"The missing piece to every puzzle.","number":"219","imageName":"voltaic key"},{"layout":"normal","type":"Creature - Human Berserker","types":["Creature"],"colors":["Red"],"multiverseid":208011,"name":"Vulshok Berserker","subtypes":["Human","Berserker"],"cmc":4,"rarity":"Common","artist":"Pete Venters","power":"3","toughness":"2","manaCost":"{3}{R}","text":"Haste (This creature can attack and {T} as soon as it comes under your control.)","flavor":"He will carve out a legend for himself with his own two hands.","number":"159","imageName":"vulshok berserker"},{"layout":"normal","type":"Creature - Wall","types":["Creature"],"colors":["Blue"],"multiverseid":205128,"name":"Wall of Frost","subtypes":["Wall"],"cmc":3,"rarity":"Uncommon","artist":"Mike Bierek","power":"0","toughness":"7","manaCost":"{1}{U}{U}","text":"Defender\n\nWhenever Wall of Frost blocks a creature, that creature doesn't untap during its controller's next untap step.","flavor":"\"I welcome it. The pasture is cleared of weeds and the wolves are frozen solid.\"\n\n—Lumi, goatherd","number":"79","rulings":[{"date":"2009-10-01","text":"Unlike Sleep, Wall of Frost's triggered ability tracks the creature, but not its controller. If the creature changes controllers before its first controller's next untap step has come around, then it won't untap during its new controller's next untap step."}],"imageName":"wall of frost"},{"layout":"normal","type":"Creature - Plant Wall","types":["Creature"],"colors":["Green"],"multiverseid":204983,"name":"Wall of Vines","subtypes":["Plant","Wall"],"cmc":1,"rarity":"Common","artist":"John Stanko","power":"0","toughness":"3","manaCost":"{G}","text":"Defender (This creature can't attack.)\n\nReach (This creature can block creatures with flying.)","flavor":"Like all jungle plants, the vines must fight and claw for sunlight. Once their place is secured, they grow strong, sharp, and impenetrable.","number":"199","imageName":"wall of vines"},{"layout":"normal","type":"Creature - Human Cleric","types":["Creature"],"colors":["White"],"multiverseid":208274,"name":"War Priest of Thune","subtypes":["Human","Cleric"],"cmc":2,"rarity":"Uncommon","artist":"Izzy","power":"2","toughness":"2","manaCost":"{1}{W}","text":"When War Priest of Thune enters the battlefield, you may destroy target enchantment.","flavor":"\"Let nothing take away from the purity of swords clashing or of arrows taking flight toward the breast of evil.\"","number":"38","rulings":[{"date":"2010-08-15","text":"Unlike Manic Vandal's ability, War Priest of Thune's ability is not mandatory. If you're the only player who controls an enchantment, you must target one of them, but you don't have to destroy it."}],"imageName":"war priest of thune"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":205057,"name":"Warlord's Axe","subtypes":["Equipment"],"cmc":3,"rarity":"Uncommon","artist":"Franz Vohwinkel","manaCost":"{3}","text":"Equipped creature gets +3/+1.\n\nEquip {4} ({4}: Attach to target creature you control. Equip only as a sorcery.)","flavor":"To split wood with it would be sacrilege. This tool has but one purpose, and that is war.","number":"220","imageName":"warlord's axe"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Blue"],"multiverseid":205006,"name":"Water Servant","subtypes":["Elemental"],"cmc":4,"rarity":"Uncommon","artist":"Igor Kieryluk","power":"3","toughness":"4","manaCost":"{2}{U}{U}","text":"{U}: Water Servant gets +1/-1 until end of turn.\n\n{U}: Water Servant gets -1/+1 until end of turn.","flavor":"\"This creature has innate perceptiveness. It knows when to rise and when to vanish into the tides.\"\n\n—Jestus Dreya, Of Elements and Eternity","number":"80","rulings":[{"date":"2010-08-15","text":"You can activate Water Servant's second ability even if doing so would cause Water Servant's power to be less than 0. If Water Servant's power is less than 0, treat it as 0 for all purposes except for further modifying it, or causing the power of another creature (such as Riptide Mangler) to become equal to it."}],"imageName":"water servant"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":206342,"name":"Whispersilk Cloak","subtypes":["Equipment"],"cmc":3,"rarity":"Uncommon","artist":"Daren Bader","manaCost":"{3}","text":"Equipped creature is unblockable and has shroud.\n\nEquip {2}","number":"221","imageName":"whispersilk cloak"},{"layout":"normal","type":"Creature - Human Knight","types":["Creature"],"colors":["White"],"multiverseid":205239,"name":"White Knight","subtypes":["Human","Knight"],"cmc":2,"rarity":"Uncommon","artist":"Christopher Moeller","power":"2","toughness":"2","manaCost":"{W}{W}","text":"First strike (This creature deals combat damage before creatures without first strike.)\n\nProtection from black (This creature can't be blocked, targeted, dealt damage, or enchanted by anything black.)","number":"39","imageName":"white knight"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":204972,"name":"Wild Evocation","cmc":6,"rarity":"Rare","artist":"Chippy","manaCost":"{5}{R}","text":"At the beginning of each player's upkeep, that player reveals a card at random from his or her hand. If it's a land card, the player puts it onto the battlefield. Otherwise, the player casts it without paying its mana cost if able.","number":"160","rulings":[{"date":"2010-08-15","text":"If a player reveals a nonland card, that player must cast that card if it's possible to do so, even if he or she doesn't want to. The player casts it as part of the resolution of Wild Evocation's ability. Timing restrictions based on the card's type (such as creature or sorcery) are ignored. Other play restrictions are not (such as \"Cast [this card] only during combat\")."},{"date":"2010-08-15","text":"If a player reveals a nonland card, but can't cast it due to a lack of legal targets or a play restriction, it simply remains in his or her hand."},{"date":"2010-08-15","text":"If, as the result of Wild Evocation's ability, a player casts a card \"without paying its mana cost,\" any X in the mana cost will be 0, and that player can't pay any alternative costs (such as Demon of Death's Gate's alternative cost). On the other hand, if the card has optional additional costs (such as kicker or multikicker), the player may pay those."},{"date":"2010-08-15","text":"If casting the revealed card involves paying a mandatory additional cost (such as the one Fling has), the player casting that card must pay that cost if able. If he or she can't, the card remains uncast in his or her hand. If the mandatory additional cost includes a mana payment, the situation is more complex. If the player has enough mana in his or her mana pool to pay the cost, that player must do so. If the player can't possibly pay the cost, the card remains uncast in his or her hand. However, if the player has the means to produce enough mana to pay the cost, then he or she has a choice: The player may cast the card, produce mana, and pay the cost. Or the player may choose to activate no mana abilities, thus making the card impossible to cast because the additional mana can't be paid."},{"date":"2010-08-15","text":"If a player casts a nonland card revealed with Wild Evocation's ability, it's put on the stack as a spell, then Wild Evocation's ability finishes resolving. The spell will then resolve as normal, after players get a chance to cast spells and activate abilities."}],"imageName":"wild evocation"},{"layout":"normal","type":"Creature - Griffin","types":["Creature"],"colors":["White"],"multiverseid":208275,"name":"Wild Griffin","subtypes":["Griffin"],"cmc":3,"rarity":"Common","artist":"Matt Cavotta","power":"2","toughness":"2","manaCost":"{2}{W}","text":"Flying","flavor":"Farmers typically keep their flocks at thirteen sheep—one to distract the griffins while they take the other twelve to market.","number":"40","imageName":"wild griffin"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":206330,"name":"Wurm's Tooth","cmc":2,"rarity":"Uncommon","artist":"Alan Pollack","manaCost":"{2}","text":"Whenever a player casts a green spell, you may gain 1 life.","flavor":"\"The great wurm bit down on me. Instead of being crunched bloody, I slid into the space where its tooth was missing. One tooth—a boon most potent, indeed.\"\n\n—The Tall Tales of Oleander","number":"222","rulings":[{"date":"2009-10-01","text":"The ability triggers whenever any player, not just you, casts a green spell."},{"date":"2009-10-01","text":"If a player casts a green spell, Wurm's Tooth's ability triggers and is put on the stack on top of that spell. Wurm's Tooth's ability will resolve (causing you to gain 1 life) before the spell does."}],"imageName":"wurm's tooth"},{"layout":"normal","type":"Creature - Wurm","types":["Creature"],"colors":["Green"],"multiverseid":205221,"name":"Yavimaya Wurm","subtypes":["Wurm"],"cmc":6,"rarity":"Common","artist":"Steven Belledin","power":"6","toughness":"4","manaCost":"{4}{G}{G}","text":"Trample (If this creature would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.)","flavor":"Anywhere else, colossal. In the forests of Yavimaya, commonplace.","number":"200","imageName":"yavimaya wurm"}]}