{
  "name": "Dragon Con",
  "code": "pDRC",
  "magicCardsInfoCode": "drc",
  "isMCISet": true,
  "releaseDate": "1994-01-01",
  "border": "black",
  "type": "promo",
  "cards": [
    {
      "artist": "Michael Whelan",
      "cmc": 4,
      "colorIdentity": [
        "R"
      ],
      "colors": [
        "Red"
      ],
      "flavor": "These small but intelligent Dragons and their Olesian allies held back the tide of Pashalik Mons's hordes of Goblin Raiders.\nDragonCon 1994",
      "foreignNames": [
        {
          "language": "Japanese",
          "name": "ナラスニ・ドラゴン"
        }
      ],
      "id": "2f6ad2b7730247c9eb7acc83abc33bb6fe569749",
      "imageName": "nalathni dragon",
      "layout": "normal",
      "legalities": [
        {
          "format": "Classic",
          "legality": "Legal"
        },
        {
          "format": "Commander",
          "legality": "Legal"
        },
        {
          "format": "Legacy",
          "legality": "Legal"
        },
        {
          "format": "Vintage",
          "legality": "Legal"
        }
      ],
      "manaCost": "{2}{R}{R}",
      "mciNumber": "1",
      "multiverseid": 97050,
      "name": "Nalathni Dragon",
      "number": "1",
      "power": "1",
      "printings": [
        "pDRC",
        "pMEI"
      ],
      "rarity": "Special",
      "rulings": [
        {
          "date": "2008-10-01",
          "text": "If a creature with banding attacks, it can team up with any number of other attacking creatures with banding (and up to one nonbanding creature) and attack as a unit called a \"band.\" The band can be blocked by any creature that could block a single creature in the band. Blocking any creature in a band blocks the entire band. If a creature with banding is blocked, the attacking player chooses how the blockers' damage is assigned."
        },
        {
          "date": "2008-10-01",
          "text": "A maximum of one nonbanding creature can join an attacking band no matter how many creatures with banding are in it."
        },
        {
          "date": "2008-10-01",
          "text": "Creatures in the same band must all attack the same player or planeswalker."
        },
        {
          "date": "2009-10-01",
          "text": "If a creature in combat has banding, its controller assigns damage for creatures blocking or blocked by it. That player can ignore the damage assignment order when making this assignment."
        }
      ],
      "source": "DragonCon 1994",
      "subtypes": [
        "Dragon"
      ],
      "text": "Flying; banding (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)\n{R}: Nalathni Dragon gets +1/+0 until end of turn. If this ability has been activated four or more times this turn, sacrifice Nalathni Dragon at the beginning of the next end step.",
      "toughness": "1",
      "type": "Creature — Dragon",
      "types": [
        "Creature"
      ]
    }
  ]
}