{"name":"World Magic Cup Qualifiers","code":"pWCQ","magicCardsInfoCode":"wmcq","magicRaritiesCodes":"780-rarities-world-magic-cup-qualifiers-promos","isMCISet":true,"releaseDate":"2013-04-06","border":"black","type":"promo","cards":[{"layout":"normal","type":"Creature — Elemental","types":["Creature"],"colors":["Green"],"name":"Vengevine","rarity":"Special","subtypes":["Elemental"],"power":"4","toughness":"3","cmc":4,"manaCost":"{2}{G}{G}","text":"Haste\nWhenever you cast a spell, if it's the second creature spell you cast this turn, you may return Vengevine from your graveyard to the battlefield.","flavor":"Leave but a shred of root and it will return, bursting with vigor.","artist":"Trevor Claxton","rulings":[{"date":"2010-06-15","text":"If you cast your second creature spell in a turn and Vengevine is in your graveyard, Vengevine's second ability triggers and goes on the stack on top of it. The ability will resolve, allowing you to return Vengevine to the battlefield, before the creature spell does."},{"date":"2010-06-15","text":"Vengevine's triggered ability works only if Vengevine is already in your graveyard as you finish casting your second creature spell in a turn, and it remains there continuously until the ability resolves."},{"date":"2010-06-15","text":"Vengevine doesn't need to be in your graveyard as you start casting your second creature spell in a turn, only as you finish. This matters if you sacrifice a Vengevine on the battlefield while casting that creature spell, perhaps to pay a cost of that spell or a cost of a mana ability."},{"date":"2010-06-15","text":"Vengevine's triggered ability checks the card types of the spells you cast over the course of the entire turn, not just the ones you cast while Vengevine is in your graveyard. For example, if you cast a creature spell, then Vengevine is put into your graveyard, then you cast another creature spell, Vengevine's ability triggers."},{"date":"2010-06-15","text":"Vengevine's ability triggers only for the second creature spell you cast in a turn. It won't trigger for the third, fourth, or so on. It also doesn't matter how many noncreature spells you cast in a turn; the ability counts just the creature spells."}],"legalities":{"Modern":"Legal","Zendikar Block":"Legal","Legacy":"Legal","Vintage":"Legal","Freeform":"Legal","Prismatic":"Legal","Tribal Wars Legacy":"Legal","Singleton 100":"Legal","Commander":"Legal"},"number":"1","foreignNames":[{"language":"Chinese Simplified","name":"复仇藤蔓"},{"language":"French","name":"Vengeliane"},{"language":"German","name":"Racheranke"},{"language":"Italian","name":"Liane Vendicative"},{"language":"Japanese","name":"復讐蔦"},{"language":"Portuguese (Brazil)","name":"Trepadeira Vingativa"},{"language":"Russian","name":"Мстящий Лозовик"},{"language":"Spanish","name":"Parra vengadora"}],"source":"World Magic Cup Qualifiers Participation bonus","imageName":"vengevine","printings":["Rise of the Eldrazi","World Magic Cup Qualifiers"],"releaseDate":"2013"}]}