{"name":"Zendikar","code":"ZEN","releaseDate":"2009-10-02","border":"black","cards":[{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":178135,"name":"Adventuring Gear","subtypes":["Equipment"],"cmc":1,"rarity":"Common","artist":"Howard Lyon","manaCost":"{1}","text":"Landfall — Whenever a land enters the battlefield under your control, equipped creature gets +2/+2 until end of turn.\n\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)","flavor":"An explorer's essentials in a wild world.","number":"195","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."},{"date":"2009-10-01","text":"The landfall ability gives +2/+2 to the creature that's equipped by Adventuring Gear at the time that ability resolves. It doesn't matter what creature Adventuring Gear was attached to (if any) when it triggered. That bonus remains with that creature even if Adventuring Gear leaves the battlefield or becomes attached to a different creature later in the turn."},{"date":"2009-10-01","text":"If Adventuring Gear leaves the battlefield before its landfall ability resolves, the creature it was attached to at the time it left the battlefield gets +2/+2. If it wasn't attached to a creature at that time, nothing gets the bonus."}],"imageName":"adventuring gear"},{"layout":"normal","type":"Creature - Illusion","types":["Creature"],"colors":["Blue"],"multiverseid":170993,"name":"Æther Figment","subtypes":["Illusion"],"cmc":2,"rarity":"Uncommon","artist":"Thomas M. Baxa","power":"1","toughness":"1","manaCost":"{1}{U}","text":"Kicker {3} (You may pay an additional {3} as you cast this spell.)\n\nÆther Figment is unblockable.\n\nIf Æther Figment was kicked, it enters the battlefield with two +1/+1 counters on it.","number":"40","imageName":"aether figment"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":189638,"name":"Akoum Refuge","rarity":"Uncommon","artist":"Fred Fields","text":"Akoum Refuge enters the battlefield tapped.\n\nWhen Akoum Refuge enters the battlefield, you gain 1 life.\n\n{T}: Add {B} or {R} to your mana pool.","number":"210","imageName":"akoum refuge"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Blue"],"multiverseid":197538,"name":"Archive Trap","subtypes":["Trap"],"cmc":5,"rarity":"Rare","artist":"Jason Felix","manaCost":"{3}{U}{U}","text":"If an opponent searched his or her library this turn, you may pay {0} rather than pay Archive Trap's mana cost.\n\nTarget opponent puts the top thirteen cards of his or her library into his or her graveyard.","number":"41","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"Archive Trap checks only whether an opponent searched his or her library. It doesn't matter whether that player found a card during the search."},{"date":"2009-10-01","text":"A spell or ability causes a player to search his or her library only if it specifically contains the word \"search\" in its text. For example, if a spell or ability lets a player look at the top four cards of his or her library and do something with one of those cards, that's not a search."},{"date":"2009-10-01","text":"If a search effect is affected by Aven Mindcensor's ability (which causes a player to search the top four cards of his or her library instead), that still counts as searching that library."},{"date":"2009-10-01","text":"The opponent you target doesn't have to be the opponent who searched his or her library."},{"date":"2009-10-01","text":"If the targeted opponent has fewer than thirteen cards in his or her library, that player puts his or her entire library into his or her graveyard."}],"imageName":"archive trap"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Blue"],"multiverseid":197893,"name":"Archmage Ascension","cmc":3,"rarity":"Rare","artist":"Christopher Moeller","manaCost":"{2}{U}","text":"At the beginning of each end step, if you drew two or more cards this turn, you may put a quest counter on Archmage Ascension.\n\nAs long as Archmage Ascension has six or more quest counters on it, if you would draw a card, you may instead search your library for a card, put that card into your hand, then shuffle your library.","number":"42","rulings":[{"date":"2009-10-01","text":"Archmage Ascension's first ability has an \"intervening 'if' clause.\" It won't trigger at all unless you've already drawn two or more cards by the time the end step begins."},{"date":"2009-10-01","text":"If an effect would cause you to draw multiple cards while Archmage Ascension has six or more quest counters on it, each individual draw may be replaced by Archmage Ascension's effect. Process the draws one at a time. Even if you use the reasonable shortcut of finding all of the cards at once and only physically shuffling once, the game will consider you to have searched and shuffled once per card."},{"date":"2009-10-01","text":"If a spell or ability causes you to put cards in your hand without specifically using the word \"draw,\" Archmage Ascension's abilities ignore it."},{"date":"2009-10-01","text":"If two or more replacement effects would apply to a card-drawing event, the player who's drawing the card chooses what order to apply them. It's possible that after applying one of them, the others will no longer be applicable because the player would no longer draw a card. For example, if you control more than one Archmage Ascension with six quest counters on it and you would draw a card, each Archmage Ascension's replacement effect could apply. Once you use one, the rest are no longer applicable."}],"imageName":"archmage ascension"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":177584,"name":"Arid Mesa","rarity":"Rare","artist":"Raymond Swanland","text":"{T}, Pay 1 life, Sacrifice Arid Mesa: Search your library for a Mountain or Plains card and put it onto the battlefield. Then shuffle your library.","number":"211","imageName":"arid mesa"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":190420,"name":"Armament Master","subtypes":["Kor","Soldier"],"cmc":2,"rarity":"Rare","artist":"Steven Belledin","power":"2","toughness":"2","manaCost":"{W}{W}","text":"Other Kor creatures you control get +2/+2 for each Equipment attached to Armament Master.","flavor":"\"We prepare for the known with daggers, rations, rope, and pitons. But we also prepare for the unknown with billycat tails, pikku roots, hedron chips . . .\"","number":"1","imageName":"armament master"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["White"],"multiverseid":193404,"name":"Arrow Volley Trap","subtypes":["Trap"],"cmc":5,"rarity":"Uncommon","artist":"Steve Argyle","manaCost":"{3}{W}{W}","text":"If four or more creatures are attacking, you may pay {1}{W} rather than pay Arrow Volley Trap's mana cost.\n\nArrow Volley Trap deals 5 damage divided as you choose among any number of target attacking creatures.","number":"2","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"The number of targets must be at least 1 and at most 5. You divide the damage as you cast Arrow Volley Trap, not as it resolves. Each target must be assigned at least 1 damage."}],"imageName":"arrow volley trap"},{"layout":"normal","type":"Creature - Human Rogue Ally","types":["Creature"],"colors":["Black"],"multiverseid":197402,"name":"Bala Ged Thief","subtypes":["Human","Rogue","Ally"],"cmc":4,"rarity":"Rare","artist":"Matt Cavotta","power":"2","toughness":"2","manaCost":"{3}{B}","text":"Whenever Bala Ged Thief or another Ally enters the battlefield under your control, target player reveals a number of cards from his or her hand equal to the number of Allies you control. You choose one of them. That player discards that card.","number":"79","rulings":[{"date":"2009-10-01","text":"The ability counts the number of allies you control as it resolves."},{"date":"2009-10-01","text":"If the number of Allies you control as the ability resolves is greater than the number of cards in the targeted player's hand, that player reveals his or her entire hand. You choose one of the cards revealed this way and that player discards it."}],"imageName":"bala ged thief"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Green"],"multiverseid":197531,"name":"Baloth Cage Trap","subtypes":["Trap"],"cmc":5,"rarity":"Uncommon","artist":"Austin Hsu","manaCost":"{3}{G}{G}","text":"If an opponent had an artifact enter the battlefield under his or her control this turn, you may pay {1}{G} rather than pay Baloth Cage Trap's mana cost.\n\nPut a 4/4 green Beast creature token onto the battlefield.","number":"156","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."}],"imageName":"baloth cage trap"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":192231,"name":"Baloth Woodcrasher","subtypes":["Beast"],"cmc":6,"rarity":"Uncommon","artist":"Zoltan Boros & Gabor Szikszai","power":"4","toughness":"4","manaCost":"{4}{G}{G}","text":"Landfall — Whenever a land enters the battlefield under your control, Baloth Woodcrasher gets +4/+4 and gains trample until end of turn.","flavor":"Its insatiable hunger quickly depletes a region of prey. It must migrate from place to place to feed its massive bulk.","number":"157","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"baloth woodcrasher"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Green"],"multiverseid":185703,"name":"Beast Hunt","cmc":4,"rarity":"Common","artist":"Kieran Yanner","manaCost":"{3}{G}","text":"Reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest into your graveyard.","flavor":"\"Surely we could tame something besides hurdas and pillarfield oxen!\"\n\n—Sheyda, Ondu gamekeeper","number":"158","rulings":[{"date":"2009-10-01","text":"If there are three or fewer cards in your library, you'll reveal all of them."}],"imageName":"beast hunt"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Green"],"multiverseid":197890,"name":"Beastmaster Ascension","cmc":3,"rarity":"Rare","artist":"Alex Horley-Orlandelli","manaCost":"{2}{G}","text":"Whenever a creature you control attacks, you may put a quest counter on Beastmaster Ascension.\n\nAs long as Beastmaster Ascension has seven or more quest counters on it, creatures you control get +5/+5.","number":"159","rulings":[{"date":"2009-10-01","text":"If you attack with multiple creatures, Beastmaster Ascension's first ability triggers multiple times."}],"imageName":"beastmaster ascension"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":193397,"name":"Blade of the Bloodchief","subtypes":["Equipment"],"cmc":1,"rarity":"Rare","artist":"Jung Park","manaCost":"{1}","text":"Whenever a creature dies, put a +1/+1 counter on equipped creature. If equipped creature is a Vampire, put two +1/+1 counters on it instead.\n\nEquip {1}","number":"196","rulings":[{"date":"2009-10-01","text":"Blade of the Bloodchief's ability triggers regardless of who controlled the creature and whose graveyard it was put into."},{"date":"2009-10-01","text":"The +1/+1 counters are put on the equipped creature, not Blade of the Bloodchief. If Blade of the Bloodchief is moved to a different creature, the +1/+1 counters will stay where they are."},{"date":"2009-10-01","text":"The creature that gets the counters is the one that's equipped by Blade of the Bloodchief at the time the ability resolves. It doesn't matter what creature Blade of the Bloodchief was attached to (if any) when it triggered."},{"date":"2009-10-01","text":"If Blade of the Bloodchief leaves the battlefield before its triggered ability resolves, the counters are put on the creature it was attached to at the time it left the battlefield. If it wasn't attached to a creature at that time, nothing gets the counters."},{"date":"2009-10-01","text":"If the equipped creature itself is put into a graveyard, Blade of the Bloodchief's ability will trigger. However, it won't do anything when it resolves unless a spell or ability has caused it to become attached to another creature by that time. (Remember that you may activate an equip ability only as a sorcery.)"},{"date":"2009-10-01","text":"If the equipped creature and another creature are dealt lethal damage at the same time, the equipped creature will be put into a graveyard before it would receive any counters."}],"imageName":"blade of the bloodchief"},{"layout":"normal","type":"Creature - Boar","types":["Creature"],"colors":["Red"],"multiverseid":180350,"name":"Bladetusk Boar","subtypes":["Boar"],"cmc":4,"rarity":"Common","artist":"Paul Bonner","power":"3","toughness":"2","manaCost":"{3}{R}","text":"Intimidate (This creature can't be blocked except by artifact creatures and/or creatures that share a color with it.)","flavor":"Those who dare stand in its path are either brave or mindless. Or in the case of goblins, both.","number":"118","rulings":[{"date":"2009-10-01","text":"Intimidate looks at the current colors of a creature that has it. Normally, Bladetusk Boar can't be blocked except by artifact creatures and/or red creatures. If it's turned blue, then it can't be blocked except by artifact creatures and/or blue creatures."},{"date":"2009-10-01","text":"If an attacking creature has intimidate, what colors it is matters only as the defending player declares blockers. Once it's blocked, changing its colors won't change that."}],"imageName":"bladetusk boar"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":191372,"name":"Blazing Torch","subtypes":["Equipment"],"cmc":1,"rarity":"Uncommon","artist":"Vance Kovacs","manaCost":"{1}","text":"Equipped creature can't be blocked by Vampires or Zombies.\n\nEquipped creature has \"{T}, Sacrifice Blazing Torch: Blazing Torch deals 2 damage to target creature or player.\"\n\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)","number":"197","rulings":[{"date":"2009-10-01","text":"If a Blazing Torch controlled by one player somehow winds up equipping a creature a different player controls, the damage ability can't be activated by either player. Only the creature's controller may activate the ability -- but since that player can't sacrifice Blazing Torch (a permanent he or she doesn't control), the ability's cost can't be paid."},{"date":"2009-10-01","text":"The source of the damage is Blazing Torch, not the equipped creature. However, the equipped creature's ability is what targets the creature or player. If Blazing Torch is equipped to a red creature, for example, the ability couldn't target a creature with protection from red. It could target a creature with protection from artifacts, but all the damage would be prevented."}],"imageName":"blazing torch"},{"layout":"normal","type":"Creature - Vampire Shaman","types":["Creature"],"colors":["Black"],"multiverseid":180362,"name":"Blood Seeker","subtypes":["Vampire","Shaman"],"cmc":2,"rarity":"Common","artist":"Greg Staples","power":"1","toughness":"1","manaCost":"{1}{B}","text":"Whenever a creature enters the battlefield under an opponent's control, you may have that player lose 1 life.","flavor":"A drop now is all he needs to find you later.","number":"80","rulings":[{"date":"2011-09-22","text":"Life loss is not the same as damage. Blood Seeker's ability will not cause creatures with bloodthirst to enter the battlefield with +1/+1 counters."}],"imageName":"blood seeker"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":170995,"name":"Blood Tribute","cmc":6,"rarity":"Rare","artist":"Alex Horley-Orlandelli","manaCost":"{4}{B}{B}","text":"Kicker—Tap an untapped Vampire you control. (You may tap a Vampire you control in addition to any other costs as you cast this spell.)\n\nTarget opponent loses half his or her life, rounded up. If Blood Tribute was kicked, you gain life equal to the life lost this way.","number":"81","rulings":[{"date":"2009-10-01","text":"You can tap a creature that hasn't been under your control since your most recent turn began to pay the kicker cost."}],"imageName":"blood tribute"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":197892,"name":"Bloodchief Ascension","cmc":1,"rarity":"Rare","artist":"Adi Granov","manaCost":"{B}","text":"At the beginning of each end step, if an opponent lost 2 or more life this turn, you may put a quest counter on Bloodchief Ascension. (Damage causes loss of life.)\n\nWhenever a card is put into an opponent's graveyard from anywhere, if Bloodchief Ascension has three or more quest counters on it, you may have that player lose 2 life. If you do, you gain 2 life.","number":"82","rulings":[{"date":"2009-10-01","text":"Bloodchief Ascension's first ability has an \"intervening 'if' clause.\" It won't trigger at all unless an opponent has already lost 2 or more life by the time the end step begins."},{"date":"2009-10-01","text":"Bloodchief Ascension's first ability checks how much life was lost by each opponent over the course of the entire turn, even if Bloodchief Ascension wasn't on the battlefield the whole time."},{"date":"2009-10-01","text":"For the first ability to trigger, a single opponent must have lost 2 life. Two opponents each losing 1 life won't cause it to trigger. It will trigger a maximum of once per turn, no matter how many opponents have lost 2 or more life."},{"date":"2009-10-01","text":"Bloodchief Ascension's first ability checks only whether life was lost. It doesn't care whether life was also gained. For example, if an opponent lost 4 life and gained 6 life during the turn, that player will have a higher life total than he or she started the turn with -- but Bloodchief Ascension's first ability will still trigger."},{"date":"2009-10-01","text":"Bloodchief Ascension's second ability doesn't behave like a leaves-the-battlefield triggered ability, since the card put into an opponent's graveyard may come from anywhere. If a Bloodchief Ascension with three quest counters on it and a permanent an opponent owns are destroyed at the same time, for example, the game will not \"look back in time\" at the game state, and Bloodchief Ascension's second ability won't trigger."}],"imageName":"bloodchief ascension"},{"layout":"normal","type":"Creature - Vampire Spirit","types":["Creature"],"colors":["Black"],"multiverseid":192230,"name":"Bloodghast","subtypes":["Vampire","Spirit"],"cmc":2,"rarity":"Rare","artist":"Daarken","power":"2","toughness":"1","manaCost":"{B}{B}","text":"Bloodghast can't block.\n\nBloodghast has haste as long as an opponent has 10 or less life.\n\nLandfall — Whenever a land enters the battlefield under your control, you may return Bloodghast from your graveyard to the battlefield.","number":"83","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."},{"date":"2009-10-01","text":"Bloodghast's landfall ability triggers only if it's already in your graveyard at the time a land enters the battlefield under your control."}],"imageName":"bloodghast"},{"layout":"normal","type":"Creature - Wraith","types":["Creature"],"colors":["Black"],"multiverseid":177500,"name":"Bog Tatters","subtypes":["Wraith"],"cmc":5,"rarity":"Common","artist":"Daarken","power":"4","toughness":"2","manaCost":"{4}{B}","text":"Swampwalk","flavor":"A wraith is a tale of brutal slaying told anew whenever it finds a victim.","number":"84","imageName":"bog tatters"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":180509,"name":"Bold Defense","cmc":3,"rarity":"Common","artist":"Scott Chou","manaCost":"{2}{W}","text":"Kicker {3}{W} (You may pay an additional {3}{W} as you cast this spell.)\n\nCreatures you control get +1/+1 until end of turn. If Bold Defense was kicked, instead creatures you control get +2/+2 and gain first strike until end of turn.","number":"3","rulings":[{"date":"2009-10-01","text":"Only creatures you control as Bold Defense resolves are affected."},{"date":"2009-10-01","text":"If a creature doesn't have first strike, granting it first strike after combat damage has been dealt in the first combat damage step won't prevent it from dealing combat damage. It will still assign and deal its combat damage in the second combat damage step."}],"imageName":"bold defense"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":185734,"name":"Brave the Elements","cmc":1,"rarity":"Uncommon","artist":"Goran Josic","manaCost":"{W}","text":"Choose a color. White creatures you control gain protection from the chosen color until end of turn.","flavor":"\"Trust me, your lost fingers and toes are nothing compared to the lost treasures of Sejiri.\"\n\n—Zahr Gada, Halimar expedition leader","number":"4","rulings":[{"date":"2009-10-01","text":"You choose a color as Brave the Elements resolves. Once the color is chosen, it's too late for players to respond."},{"date":"2009-10-01","text":"Only white creatures you control at the time Brave the Elements resolves gain the protection ability. Creatures that come under your control later in the turn, or that turn white later in the turn, won't have it."}],"imageName":"brave the elements"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":177558,"name":"Burst Lightning","cmc":1,"rarity":"Common","artist":"Vance Kovacs","manaCost":"{R}","text":"Kicker {4} (You may pay an additional {4} as you cast this spell.)\n\nBurst Lightning deals 2 damage to target creature or player. If Burst Lightning was kicked, it deals 4 damage to that creature or player instead.","number":"119","imageName":"burst lightning"},{"layout":"normal","type":"Creature - Merfolk Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":183417,"name":"Caller of Gales","subtypes":["Merfolk","Wizard"],"cmc":1,"rarity":"Common","artist":"Alex Horley-Orlandelli","power":"1","toughness":"1","manaCost":"{U}","text":"{1}{U}, {T}: Target creature gains flying until end of turn.","flavor":"\"Some merfolk choose to rest their fins in the water. I believe wisdom exists not only where we were born but where we were told not to go.\"","number":"43","imageName":"caller of gales"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":189001,"name":"Cancel","cmc":3,"rarity":"Common","artist":"Scott Chou","manaCost":"{1}{U}{U}","text":"Counter target spell.","flavor":"Zendikar's volatile mana is the basis for many spectacular spells—and some equally astonishing failures.","number":"44","imageName":"cancel"},{"layout":"normal","type":"Creature - Giant","types":["Creature"],"colors":["White"],"multiverseid":185697,"name":"Caravan Hurda","subtypes":["Giant"],"cmc":5,"rarity":"Common","artist":"Dave Kendall","power":"1","toughness":"5","manaCost":"{4}{W}","text":"Lifelink (Damage dealt by this creature also causes you to gain that much life.)","flavor":"\"Not too bright, but good enough for the job required—carrying and walking in a straight line.\"\n\n—Bruse Tarl, Goma Fada nomad","number":"5","imageName":"caravan hurda"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":193406,"name":"Carnage Altar","cmc":2,"rarity":"Uncommon","artist":"James Paick","manaCost":"{2}","text":"{3}, Sacrifice a creature: Draw a card.","flavor":"\"In these bloodstains I will find the fingerprints of our oppressors.\"\n\n—Anowon, the Ruin Sage","number":"198","imageName":"carnage altar"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":198524,"name":"Celestial Mantle","subtypes":["Aura"],"cmc":6,"rarity":"Rare","artist":"Steve Argyle","manaCost":"{3}{W}{W}{W}","text":"Enchant creature\n\nEnchanted creature gets +3/+3.\n\nWhenever enchanted creature deals combat damage to a player, double its controller's life total.","flavor":"Upon such armor, even a mountain would break.","number":"6","rulings":[{"date":"2009-10-01","text":"At the time the ability triggers, determine which creature Celestial Mantle is enchanting. As the ability resolves, determine who currently controls that creature (or, if it's no longer on the battlefield, determine who controlled it when it left). That's the player whose life total is doubled. It doesn't matter who controls Celestial Mantle, who controlled the creature at the time the ability triggered, or what creature Celestial Mantle enchants at the time the ability resolves."},{"date":"2009-10-01","text":"If a creature dealing combat damage at the same time as the enchanted creature has lifelink, the life gained due to lifelink happens before Celestial Mantle's triggered ability resolves."},{"date":"2009-10-01","text":"If the enchanted creature's controller has a life total below 0 (which is possible if that player controls Platinum Angel, for example), Celestial Mantle's triggered ability multiplies that number by two. For example, if the player had -4 life, that player's life total becomes -8."},{"date":"2009-10-01","text":"If a player's life total is doubled, that player actually gains or loses the necessary amount of life. For example, if the life total of the enchanted creature's controller is 14 when Celestial Mantle's triggered ability resolves, the ability causes that player to gain 14 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."},{"date":"2010-06-15","text":"In a Two-Headed Giant game, Celestial Mantle's essentially doubles the team's life-total. Specifically, the triggered ability will affect one player's life total, and then the team's life total is adjusted by the amount of life the player gains as a result of this ability. Suppose a creature enchanted by Celestial Mantle deals combat damage to an opponent, and that creature's controller's team has 11 life. That player then has 11 life, so it's doubled to 22, for a net gain of 11 life. The team's life total becomes 22 (11 + 11)."}],"imageName":"celestial mantle"},{"layout":"normal","type":"Planeswalker - Chandra","types":["Planeswalker"],"colors":["Red"],"multiverseid":195402,"name":"Chandra Ablaze","subtypes":["Chandra"],"cmc":6,"rarity":"Mythic Rare","artist":"Steve Argyle","loyalty":5,"manaCost":"{4}{R}{R}","text":"+1: Discard a card. If a red card is discarded this way, Chandra Ablaze deals 4 damage to target creature or player.\n\n-2: Each player discards his or her hand, then draws three cards.\n\n-7: Cast any number of red instant and/or sorcery cards from your graveyard without paying their mana costs.","number":"120","rulings":[{"date":"2009-10-01","text":"If you activate Chandra Ablaze's first ability, you don't discard a card until the ability resolves. You may activate the ability even if your hand is empty. You choose a target as you activate the ability even if you have no red cards in hand at that time."},{"date":"2009-10-01","text":"As the first ability resolves, nothing happens if your hand is empty. But if you have any cards in hand, you must discard one. If you discard a nonred card, Chandra doesn't deal any damage."},{"date":"2009-10-01","text":"If the creature targeted by the first ability is an illegal target by the time it resolves, the entire ability is countered. You won't discard a card."},{"date":"2009-10-01","text":"You may activate Chandra's second ability even if your hand is empty. As it resolves, a player whose hand is empty simply draws three cards."},{"date":"2009-10-01","text":"You cast red instant cards and red sorcery cards from your graveyard as part of the resolution of Chandra Ablaze's third ability. You don't choose which ones to cast until you're actually doing so as the ability resolves. You cast only the ones you want to, and you may cast them in any order. Timing restrictions based on the card's type (if it's a sorcery) are ignored. Other restrictions are not (such as \"Cast [this card] only during combat\"). Each card you cast this way is put on the stack, then the ability finishes resolving. Those spells will then resolve as normal, one at a time, in the opposite order that they were put on the stack. They'll go back to the graveyard as they resolve."},{"date":"2009-10-01","text":"If you cast a card \"without paying its mana cost,\" you can't pay any alternative costs. You can pay additional costs, such as kicker costs."}],"imageName":"chandra ablaze"},{"layout":"normal","type":"Creature - Kor Scout","types":["Creature"],"colors":["White"],"multiverseid":177546,"name":"Cliff Threader","subtypes":["Kor","Scout"],"cmc":2,"rarity":"Common","artist":"Paul Bonner","power":"2","toughness":"1","manaCost":"{1}{W}","text":"Mountainwalk","flavor":"\"The crossing demands singular focus. Your life consists of these ropes, these hooks, and these rocky crags. Your past is miles below.\"","number":"7","imageName":"cliff threader"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Green"],"multiverseid":197535,"name":"Cobra Trap","subtypes":["Trap"],"cmc":6,"rarity":"Uncommon","artist":"Scott Chou","manaCost":"{4}{G}{G}","text":"If a noncreature permanent under your control was destroyed this turn by a spell or ability an opponent controlled, you may pay {G} rather than pay Cobra Trap's mana cost.\n\nPut four 1/1 green Snake creature tokens onto the battlefield.","number":"160","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"A spell or ability destroys a permanent only if that spell or ability specifically contains the word \"destroy\" in its text. If a spell or ability an opponent controls exiles a noncreature permanent you control, causes you to sacrifice a noncreature permanent, removes all loyalty counters from a planeswalker you control, or causes an ability you control to trigger (and then that ability destroys a permanent you control), Cobra Trap's alternative cost condition hasn't been met."}],"imageName":"cobra trap"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":195626,"name":"Conqueror's Pledge","cmc":5,"rarity":"Rare","artist":"Kev Walker","manaCost":"{2}{W}{W}{W}","text":"Kicker {6} (You may pay an additional {6} as you cast this spell.)\n\nPut six 1/1 white Kor Soldier creature tokens onto the battlefield. If Conqueror's Pledge was kicked, put twelve of those tokens onto the battlefield instead.","number":"8","imageName":"conqueror's pledge"},{"layout":"normal","type":"Creature - Merfolk Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":186322,"name":"Cosi's Trickster","subtypes":["Merfolk","Wizard"],"cmc":1,"rarity":"Rare","artist":"Igor Kieryluk","power":"1","toughness":"1","manaCost":"{U}","text":"Whenever an opponent shuffles his or her library, you may put a +1/+1 counter on Cosi's Trickster.","flavor":"She watches the chaos created by the Roil, seeking strength in the patterns of anarchy.","number":"45","rulings":[{"date":"2009-10-01","text":"Cosi's Trickster's ability triggers when an opponent shuffles his or her library because that player was instructed to do so by a spell or ability that specifically contains the word \"shuffle\" in its text or (in the case of a keyword ability) in its rules."},{"date":"2009-10-01","text":"The cascade ability doesn't cause a player to shuffle his or her library, even if that player revealed his or her entire library. The revealed cards are put on the bottom of their owner's library in a random order, but they're not \"shuffled.\""},{"date":"2009-10-01","text":"If an opponent's library is empty or has just a single card in it when a spell or ability instructs that player to shuffle his or her library, Cosi's Trickster's ability will still trigger."}],"imageName":"cosi's trickster"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190394,"name":"Crypt of Agadeem","rarity":"Rare","artist":"Jason Felix","text":"Crypt of Agadeem enters the battlefield tapped.\n\n{T}: Add {B} to your mana pool.\n\n{2}, {T}: Add {B} to your mana pool for each black creature card in your graveyard.","number":"212","imageName":"crypt of agadeem"},{"layout":"normal","type":"Creature - Shade","types":["Creature"],"colors":["Black"],"multiverseid":178121,"name":"Crypt Ripper","subtypes":["Shade"],"cmc":4,"rarity":"Common","artist":"Dave Kendall","power":"2","toughness":"2","manaCost":"{2}{B}{B}","text":"Haste\n\n{B}: Crypt Ripper gets +1/+1 until end of turn.","flavor":"The tender light of the living quickens the pulse of the dead.","number":"85","imageName":"crypt ripper"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":186309,"name":"Day of Judgment","cmc":4,"rarity":"Rare","artist":"Vincent Proce","manaCost":"{2}{W}{W}","text":"Destroy all creatures.","flavor":"\"I have seen planes leveled and all life rendered to dust. It brought no pleasure, even to a heart as dark as mine.\"\n\n—Sorin Markov","number":"9","imageName":"day of judgment"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":190406,"name":"Demolish","cmc":4,"rarity":"Common","artist":"John Avon","manaCost":"{3}{R}","text":"Destroy target artifact or land.","flavor":"\"This is why I hate settlements. They lull you into a false sense of security.\"\n\n—Yon Basrel, Oran-Rief survivalist","number":"121","imageName":"demolish"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":178137,"name":"Desecrated Earth","cmc":5,"rarity":"Common","artist":"Daarken","manaCost":"{4}{B}","text":"Destroy target land. Its controller discards a card.","flavor":"\"The land is swollen with mana, cursed relics, and secrets. If you puncture it, you never know what will burst out.\"\n\n—Javad Nasrin, Ondu relic hunter","number":"86","rulings":[{"date":"2009-10-01","text":"If the targeted land is an illegal target by the time Desecrated Earth resolves, the entire spell is countered. No one discards a card."}],"imageName":"desecrated earth"},{"layout":"normal","type":"Creature - Kor Cleric","types":["Creature"],"colors":["White"],"multiverseid":191374,"name":"Devout Lightcaster","subtypes":["Kor","Cleric"],"cmc":3,"rarity":"Rare","artist":"Shelly Wan","power":"2","toughness":"2","manaCost":"{W}{W}{W}","text":"Protection from black\n\nWhen Devout Lightcaster enters the battlefield, exile target black permanent.","flavor":"\"Goddess, grant us light to banish the world's shadows.\"\n\n—Prayer to Kamsa","number":"10","rulings":[{"date":"2009-10-01","text":"Devout Lightcaster's triggered ability isn't optional. When it enters the battlefield, if you're the only player that controls a black permanent, you'll have to target a black permanent you control."}],"imageName":"devout lightcaster"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":180115,"name":"Disfigure","cmc":1,"rarity":"Common","artist":"Justin Sweet","manaCost":"{B}","text":"Target creature gets -2/-2 until end of turn.","flavor":"\"Brave scar or unfortunate tale? It all depends on your pain threshold.\"","number":"87","imageName":"disfigure"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":193398,"name":"Eldrazi Monument","cmc":5,"rarity":"Mythic Rare","artist":"Mark Tedin","manaCost":"{5}","text":"Creatures you control get +1/+1, have flying, and are indestructible.\n\nAt the beginning of your upkeep, sacrifice a creature. If you can't, sacrifice Eldrazi Monument.","flavor":"\"Gods don't die. They merely slumber.\"\n\n—Ayli, Kamsa cleric","number":"199","rulings":[{"date":"2009-10-01","text":"If you control any creatures as the triggered ability resolves, you must sacrifice one. You can't choose to sacrifice Eldrazi Monument instead. You sacrifice the Monument only if you had no creatures to sacrifice."},{"date":"2009-10-01","text":"Lethal damage and effects that say \"destroy\" won't cause an indestructible creature to be put into the graveyard. However, an indestructible creature can be put into the graveyard for a number of reasons. The most likely reasons are if it's sacrificed, if it's legendary and another legendary creature with the same name is on the battlefield, or if its toughness is 0 or less."}],"imageName":"eldrazi monument"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":191373,"name":"Electropotence","cmc":3,"rarity":"Rare","artist":"Christopher Moeller","manaCost":"{2}{R}","text":"Whenever a creature enters the battlefield under your control, you may pay {2}{R}. If you do, that creature deals damage equal to its power to target creature or player.","flavor":"Where life and force collide.","number":"122","rulings":[{"date":"2009-10-01","text":"You target a creature or player when the ability triggers. You decide whether or not to pay {2}{R} as the ability resolves."},{"date":"2009-10-01","text":"Once you decide to pay {2}{R}, it's too late for anyone to respond (such as by activating a regeneration ability the targeted creature has)."},{"date":"2009-10-01","text":"If you pay {2}{R}, the creature that entered the battlefield deals damage equal to its current power to the targeted creature or player. If it's no longer on the battlefield, its last known existence on the battlefield is checked to determine its power."},{"date":"2009-10-01","text":"Electropotence is the source of the ability, but the creature is the source of the damage. The ability couldn't target a creature with protection from red, for example. It could target a creature with protection from creatures, but all the damage would be prevented. Since damage is dealt by the creature, lifelink, deathtouch, and wither are taken into account, even if the creature has left the battlefield by the time it deals damage."}],"imageName":"electropotence"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":192221,"name":"Elemental Appeal","cmc":4,"rarity":"Rare","artist":"Anthony Francisco","manaCost":"{R}{R}{R}{R}","text":"Kicker {5} (You may pay an additional {5} as you cast this spell.)\n\nPut a 7/1 red Elemental creature token with trample and haste onto the battlefield. Exile it at the beginning of the next end step. If Elemental Appeal was kicked, that creature gets +7/+0 until end of turn.","number":"123","rulings":[{"date":"2009-10-01","text":"If Elemental Appeal was kicked, it creates a 7/1 token with trample and haste that gets +7/+0 until end of turn. It doesn't create a 14/1 token. This matters in case something copies that token (the copy will be just 7/1), or in case Elemental Appeal is somehow cast during an end step (in which case the +7/+0 lasts just for that turn)."}],"imageName":"elemental appeal"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":190399,"name":"Emeria Angel","subtypes":["Angel"],"cmc":4,"rarity":"Rare","artist":"Jim Murray","power":"3","toughness":"3","manaCost":"{2}{W}{W}","text":"Flying\n\nLandfall — Whenever a land enters the battlefield under your control, you may put a 1/1 white Bird creature token with flying onto the battlefield.","flavor":"When the earth shudders, the sky overflows.","number":"11","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"emeria angel"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190414,"name":"Emeria, the Sky Ruin","rarity":"Rare","artist":"Jaime Jones","text":"Emeria, the Sky Ruin enters the battlefield tapped.\n\nAt the beginning of your upkeep, if you control seven or more Plains, you may return target creature card from your graveyard to the battlefield.\n\n{T}: Add {W} to your mana pool.","number":"213","rulings":[{"date":"2009-10-01","text":"Emeria, the Sky Ruin's triggered ability has an \"intervening 'if' clause.\" That means (1) the ability won't trigger at all unless you control seven or more Plains as your upkeep starts, and (2) the ability will do nothing if you control fewer than seven Plains by the time it resolves."}],"imageName":"emeria, the sky ruin"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":189006,"name":"Eternity Vessel","cmc":6,"rarity":"Mythic Rare","artist":"John Avon","manaCost":"{6}","text":"Eternity Vessel enters the battlefield with X charge counters on it, where X is your life total.\n\nLandfall — Whenever a land enters the battlefield under your control, you may have your life total become the number of charge counters on Eternity Vessel.","number":"200","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."},{"date":"2009-10-01","text":"Eternity Vessel's landfall ability cares only about how many charge counters are on it, not what its controller's life total was as it entered the battlefield. The number of charge counters may be changed by other spells and abilities."},{"date":"2009-10-01","text":"For your life total to become the number of charge counters on Eternity Vessel, you actually gain or lose the necessary amount of life. For example, if your life total is 4 when Eternity Vessel's landfall ability resolves and Eternity Vessel has 12 charge counters on it, the ability will cause you to gain 8 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."},{"date":"2010-06-15","text":"In a Two-Headed Giant game, your life total is the same as your team's life total, so Eternity Vessel enters the battlefield with a number of charge counters on it equal to your team's life total. When its landfall ability resolves, it causes its controller to lose or gain the appropriate amount of life, and the team's life total is adjusted by the amount of life the player gains or loses as a result of this ability. Suppose Eternity Vessel has 15 charge counters on it when its landfall ability resolves, and its controller's team has 11 life. That player's life total is 11, which becomes 15, for a net gain of 4 life. The team's life total becomes 15."}],"imageName":"eternity vessel"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":193405,"name":"Expedition Map","cmc":1,"rarity":"Common","artist":"Franz Vohwinkel","manaCost":"{1}","text":"{2}, {T}, Sacrifice Expedition Map: Search your library for a land card, reveal it, and put it into your hand. Then shuffle your library.","flavor":"\"I use maps to find out where explorers have already been. Then I go the other way.\"\n\n—Javad Nasrin, Ondu relic hunter","number":"201","rulings":[{"date":"2009-10-01","text":"You may find any land card, not just a basic land card."}],"imageName":"expedition map"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":190396,"name":"Explorer's Scope","subtypes":["Equipment"],"cmc":1,"rarity":"Common","artist":"Vincent Proce","manaCost":"{1}","text":"Whenever equipped creature attacks, look at the top card of your library. If it's a land card, you may put it onto the battlefield tapped.\n\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)","number":"202","imageName":"explorer's scope"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":189629,"name":"Feast of Blood","cmc":2,"rarity":"Uncommon","artist":"Jason Felix","manaCost":"{1}{B}","text":"Cast Feast of Blood only if you control two or more Vampires.\n\nDestroy target creature. You gain 4 life.","flavor":"\"The vampires of this world don't know the pleasures of hunger. They gorge themselves without savoring the kill.\"\n\n—Sorin Markov","number":"88","rulings":[{"date":"2009-10-01","text":"Whether you control two or more Vampires is checked only as you try to move Feast of Blood to the stack as the first step of casting it. It doesn't matter whether you still control two or more Vampires as you finish casting Feast of Blood (in case you somehow sacrifice one to produce mana) or as Feast of Blood resolves."},{"date":"2009-10-01","text":"If the targeted creature is an illegal target by the time Feast of Blood resolves, the entire spell is countered. You don't gain life."}],"imageName":"feast of blood"},{"layout":"normal","type":"Creature - Cat Beast","types":["Creature"],"colors":["White"],"multiverseid":185743,"name":"Felidar Sovereign","subtypes":["Cat","Beast"],"cmc":6,"rarity":"Mythic Rare","artist":"Zoltan Boros & Gabor Szikszai","power":"4","toughness":"6","manaCost":"{4}{W}{W}","text":"Vigilance, lifelink\n\nAt the beginning of your upkeep, if you have 40 or more life, you win the game.","flavor":"\"If survival is a game, I've seen the winner.\"\n\n—Hazir, Sejiri cartographer","number":"12","rulings":[{"date":"2009-10-01","text":"Felidar Sovereign's triggered ability has an \"intervening 'if' clause.\" That means (1) the ability won't trigger at all unless you have 40 or more life as your upkeep starts, and (2) the ability will do nothing if your life total is less than 40 by the time it resolves."},{"date":"2010-06-15","text":"In a Two-Headed Giant game, your life total is the same as your team's life total. As such, the ability triggers if your team has 40 or more life."}],"imageName":"felidar sovereign"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":195158,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"John Avon","text":"G","number":"246","variations":[201962,201960,195183,201961,195177,201959,195192],"imageName":"forest1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":201959,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"John Avon","text":"G","number":"246a","variations":[201962,201960,195158,195183,201961,195177,195192],"imageName":"forest1a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":201962,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Jung Park","text":"G","number":"247","variations":[201960,195158,195183,201961,195177,201959,195192],"imageName":"forest2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":195192,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Jung Park","text":"G","number":"247a","variations":[201962,201960,195158,195183,201961,195177,201959],"imageName":"forest2a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":195177,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"G","number":"248","variations":[201962,201960,195158,195183,201961,201959,195192],"imageName":"forest3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":201960,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"G","number":"248a","variations":[201962,195158,195183,201961,195177,201959,195192],"imageName":"forest3a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":201961,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Vincent Proce","text":"G","number":"249","variations":[201962,201960,195158,195183,195177,201959,195192],"imageName":"forest4"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Forest","types":["Land"],"colors":[],"multiverseid":195183,"name":"Forest","subtypes":["Forest"],"rarity":"Basic Land","artist":"Vincent Proce","text":"G","number":"249a","variations":[201962,201960,195158,201961,195177,201959,195192],"imageName":"forest4a"},{"layout":"normal","type":"Creature - Elf Scout","types":["Creature"],"colors":["Green"],"multiverseid":180361,"name":"Frontier Guide","subtypes":["Elf","Scout"],"cmc":2,"rarity":"Uncommon","artist":"Wayne Reynolds","power":"1","toughness":"1","manaCost":"{1}{G}","text":"{3}{G}, {T}: Search your library for a basic land card and put it onto the battlefield tapped. Then shuffle your library.","flavor":"\"The elders say Zendikar has no safe, peaceful places. How would they know? They've never looked.\"","number":"161","imageName":"frontier guide"},{"layout":"normal","type":"Creature - Vampire Warrior","types":["Creature"],"colors":["Black"],"multiverseid":185698,"name":"Gatekeeper of Malakir","subtypes":["Vampire","Warrior"],"cmc":2,"rarity":"Uncommon","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{B}{B}","text":"Kicker {B} (You may pay an additional {B} as you cast this spell.)\n\nWhen Gatekeeper of Malakir enters the battlefield, if it was kicked, target player sacrifices a creature.","flavor":"\"You may enter the city—once the toll is paid.\"","number":"89","imageName":"gatekeeper of malakir"},{"layout":"normal","type":"Creature - Elemental Beast","types":["Creature"],"colors":["Red"],"multiverseid":197887,"name":"Geyser Glider","subtypes":["Elemental","Beast"],"cmc":5,"rarity":"Uncommon","artist":"Warren Mahy","power":"4","toughness":"4","manaCost":"{3}{R}{R}","text":"Landfall — Whenever a land enters the battlefield under your control, Geyser Glider gains flying until end of turn.","flavor":"\"Quit pontificating, mage. The last thing we want to do is give it more hot air.\"\n\n—Tala Vertan, Makindi shieldmate","number":"124","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"geyser glider"},{"layout":"normal","type":"Creature - Scorpion","types":["Creature"],"colors":["Black"],"multiverseid":192226,"name":"Giant Scorpion","subtypes":["Scorpion"],"cmc":3,"rarity":"Common","artist":"Raymond Swanland","power":"1","toughness":"3","manaCost":"{2}{B}","text":"Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)","flavor":"Its sting hurts, but death is strangely painless.","number":"90","imageName":"giant scorpion"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":195627,"name":"Gigantiform","subtypes":["Aura"],"cmc":5,"rarity":"Rare","artist":"Justin Sweet","manaCost":"{3}{G}{G}","text":"Kicker {4}\n\nEnchant creature\n\nEnchanted creature is 8/8 and has trample.\n\nWhen Gigantiform enters the battlefield, if it was kicked, you may search your library for a card named Gigantiform, put it onto the battlefield, then shuffle your library.","number":"162","rulings":[{"date":"2009-10-01","text":"If the creature targeted by the Gigantiform spell is an illegal target by the time Gigantiform resolves, the spell is countered. It won't enter the battlefield, so you won't get to search your library for another Gigantiform."},{"date":"2009-10-01","text":"Gigantiform overwrites all previous effects that set the enchanted creature's power and toughness to specific values. Other effects that set its power or toughness to specific values that start to apply after Gigantiform becomes attached to it will overwrite Gigantiform."},{"date":"2009-10-01","text":"Effects that modify the enchanted creature's power or toughness, such as the effects of Giant Growth or Glorious Anthem, will apply to it no matter when they started to take effect. The same is true for counters that change the creature's power or toughness (such as +1/+1 counters) and effects that switch its power and toughness."},{"date":"2009-10-01","text":"Although the Gigantiform cast as a spell targets a creature, the Gigantiform put onto the battlefield as a result of the first one's triggered ability does not. It may be attached to a creature with shroud, for example. However, it may not be attached to a creature that couldn't be enchanted by it, such as a creature with protection from green. You don't choose which creature it will be attached to until it enters the battlefield. Once you choose which creature to attach it to, it's too late for players to respond."}],"imageName":"gigantiform"},{"layout":"normal","type":"Creature - Goblin Warrior","types":["Creature"],"colors":["Red"],"multiverseid":177501,"name":"Goblin Bushwhacker","subtypes":["Goblin","Warrior"],"cmc":1,"rarity":"Common","artist":"Mark Tedin","power":"1","toughness":"1","manaCost":"{R}","text":"Kicker {R} (You may pay an additional {R} as you cast this spell.)\n\nWhen Goblin Bushwhacker enters the battlefield, if it was kicked, creatures you control get +1/+0 and gain haste until end of turn.","number":"125","rulings":[{"date":"2009-10-01","text":"Only creatures you control as Goblin Bushwhacker's ability resolves are affected. This includes Goblin Bushwhacker itself, unless it already left the battlefield by then."}],"imageName":"goblin bushwhacker"},{"layout":"normal","type":"Creature - Goblin Scout","types":["Creature"],"colors":["Red"],"multiverseid":170987,"name":"Goblin Guide","subtypes":["Goblin","Scout"],"cmc":1,"rarity":"Rare","artist":"Warren Mahy","power":"2","toughness":"2","manaCost":"{R}","text":"Haste\n\nWhenever Goblin Guide attacks, defending player reveals the top card of his or her library. If it's a land card, that player puts it into his or her hand.","flavor":"\"I've been all over this world. I even remember some of those places.\"","number":"126","imageName":"goblin guide"},{"layout":"normal","type":"Creature - Goblin Shaman","types":["Creature"],"colors":["Red"],"multiverseid":180411,"name":"Goblin Ruinblaster","subtypes":["Goblin","Shaman"],"cmc":3,"rarity":"Uncommon","artist":"Matt Cavotta","power":"2","toughness":"1","manaCost":"{2}{R}","text":"Kicker {R} (You may pay an additional {R} as you cast this spell.)\n\nHaste\n\nWhen Goblin Ruinblaster enters the battlefield, if it was kicked, destroy target nonbasic land.","number":"127","imageName":"goblin ruinblaster"},{"layout":"normal","type":"Creature - Goblin Scout","types":["Creature"],"colors":["Red"],"multiverseid":180473,"name":"Goblin Shortcutter","subtypes":["Goblin","Scout"],"cmc":2,"rarity":"Common","artist":"Jesper Ejsing","power":"2","toughness":"1","manaCost":"{1}{R}","text":"When Goblin Shortcutter enters the battlefield, target creature can't block this turn.","flavor":"\"Goblins are cheap, but be careful. It's a lot easier to steal from a corpse than a customer.\"\n\n—Samila, Murasa Expeditionary House","number":"128","imageName":"goblin shortcutter"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Red"],"multiverseid":185701,"name":"Goblin War Paint","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Austin Hsu","manaCost":"{1}{R}","text":"Enchant creature\n\nEnchanted creature gets +2/+2 and has haste. (It can attack and {T} no matter when it came under its controller's control.)","flavor":"War paint made from kolya fruit heightens senses and lessens fear. Unfortunately, fear is usually what keeps you alive.","number":"129","imageName":"goblin war paint"},{"layout":"normal","type":"Creature - Jellyfish","types":["Creature"],"colors":["Blue"],"multiverseid":198523,"name":"Gomazoa","subtypes":["Jellyfish"],"cmc":3,"rarity":"Uncommon","artist":"Chippy","power":"0","toughness":"3","manaCost":"{2}{U}","text":"Defender, flying\n\n{T}: Put Gomazoa and each creature it's blocking on top of their owners' libraries, then those players shuffle their libraries.","flavor":"To explorers, \"point man\" is a polite way of saying \"gomazoa fodder.\"","number":"46","rulings":[{"date":"2009-10-01","text":"Gomazoa's ability can be activated any time its controller has priority. It doesn't need to be blocking any creatures."},{"date":"2009-10-01","text":"If Gomazoa isn't blocking a creature at the time its ability resolves, only Gomazoa is put on top of its owner's library, and only that player shuffles his or her library."}],"imageName":"gomazoa"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":192220,"name":"Grappling Hook","subtypes":["Equipment"],"cmc":4,"rarity":"Rare","artist":"Philip Straub","manaCost":"{4}","text":"Equipped creature has double strike.\n\nWhenever equipped creature attacks, you may have target creature block it this turn if able.\n\nEquip {4}","flavor":"Part tool, part weapon, part of the kor.","number":"203","rulings":[{"date":"2009-10-01","text":"If you control the triggered ability, you decide whether to have the targeted creature block the attacking creature at the time the ability resolves, not at the time blockers are declared."},{"date":"2009-10-01","text":"If you choose to have the targeted creature block, the creature it must block is the one that was equipped by Grappling Hook at the time the ability triggered. It doesn't matter if Grappling Hook leaves the battlefield or somehow becomes attached to another creature."},{"date":"2009-10-01","text":"If you choose to have the targeted creature block the creature that was equipped with Grappling Hook, but it isn't able to do so as blockers are declared (for example, because the attacking creature has flying and the targeted creature doesn't), the requirement to block does nothing. The targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."},{"date":"2009-10-01","text":"Tapped creatures, creatures that can't block as the result of an effect, creatures with unpaid costs to block (such as those from War Cadence), and creatures that aren't controlled by the defending player are exempt from effects that would require them to block. Such creatures can be targeted by the ability, but the requirement to block does nothing."}],"imageName":"grappling hook"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":189631,"name":"Graypelt Refuge","rarity":"Uncommon","artist":"Philip Straub","text":"Graypelt Refuge enters the battlefield tapped.\n\nWhen Graypelt Refuge enters the battlefield, you gain 1 life.\n\n{T}: Add {G} or {W} to your mana pool.","number":"214","imageName":"graypelt refuge"},{"layout":"normal","type":"Creature - Antelope","types":["Creature"],"colors":["Green"],"multiverseid":189621,"name":"Grazing Gladehart","subtypes":["Antelope"],"cmc":3,"rarity":"Common","artist":"Ryan Pancoast","power":"2","toughness":"2","manaCost":"{2}{G}","text":"Landfall — Whenever a land enters the battlefield under your control, you may gain 2 life.","flavor":"\"Don't be fooled. If it were as docile as it looks, it would've died off long ago.\"\n\n—Yon Basrel, Oran-Rief survivalist","number":"163","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"grazing gladehart"},{"layout":"normal","type":"Creature - Elf Druid","types":["Creature"],"colors":["Green"],"multiverseid":185694,"name":"Greenweaver Druid","subtypes":["Elf","Druid"],"cmc":3,"rarity":"Uncommon","artist":"Justin Sweet","power":"1","toughness":"1","manaCost":"{2}{G}","text":"{T}: Add {G}{G} to your mana pool.","flavor":"The other tribes call them fanatics, but none deny that the Mul Daya elves have an iron-strong bond to some force greater than themselves.","number":"164","imageName":"greenweaver druid"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":180127,"name":"Grim Discovery","cmc":2,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{1}{B}","text":"Choose one or both — Return target creature card from your graveyard to your hand; and/or return target land card from your graveyard to your hand.","flavor":"Few among the living understand just how much of their world is shaped by the ruins of the dead.","number":"91","imageName":"grim discovery"},{"layout":"normal","type":"Creature - Specter","types":["Creature"],"colors":["Black"],"multiverseid":183418,"name":"Guul Draz Specter","subtypes":["Specter"],"cmc":4,"rarity":"Rare","artist":"Mark Tedin","power":"2","toughness":"2","manaCost":"{2}{B}{B}","text":"Flying\n\nGuul Draz Specter gets +3/+3 as long as an opponent has no cards in hand.\n\nWhenever Guul Draz Specter deals combat damage to a player, that player discards a card.","number":"92","imageName":"guul draz specter"},{"layout":"normal","type":"Creature - Vampire Rogue","types":["Creature"],"colors":["Black"],"multiverseid":180498,"name":"Guul Draz Vampire","subtypes":["Vampire","Rogue"],"cmc":1,"rarity":"Common","artist":"Steve Argyle","power":"1","toughness":"1","manaCost":"{B}","text":"As long as an opponent has 10 or less life, Guul Draz Vampire gets +2/+1 and has intimidate. (It can't be blocked except by artifact creatures and/or creatures that share a color with it.)","flavor":"\"A creature's bloodscent is a beacon that cannot be disguised.\"","number":"93","rulings":[{"date":"2009-10-01","text":"Intimidate looks at the current colors of a creature that has it. Normally, if Guul Draz Vampire has intimidate, it can't be blocked except by artifact creatures and/or black creatures. If it's turned white, then it can't be blocked except by artifact creatures and/or white creatures."},{"date":"2009-10-01","text":"If an attacking creature has intimidate, what colors it is matters only as the defending player declares blockers. Once it's blocked, changing its colors won't change that."}],"imageName":"guul draz vampire"},{"layout":"normal","type":"Creature - Crocodile","types":["Creature"],"colors":["Black"],"multiverseid":170998,"name":"Hagra Crocodile","subtypes":["Crocodile"],"cmc":4,"rarity":"Common","artist":"Daren Bader","power":"3","toughness":"1","manaCost":"{3}{B}","text":"Hagra Crocodile can't block.\n\nLandfall — Whenever a land enters the battlefield under your control, Hagra Crocodile gets +2/+2 until end of turn.","flavor":"The creatures of Zendikar are opportunists, eating whatever is available to them. Like goblins. Or boats.","number":"94","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"hagra crocodile"},{"layout":"normal","type":"Creature - Ogre Shaman Ally","types":["Creature"],"colors":["Black"],"multiverseid":197404,"name":"Hagra Diabolist","subtypes":["Ogre","Shaman","Ally"],"cmc":5,"rarity":"Uncommon","artist":"Karl Kopinski","power":"3","toughness":"2","manaCost":"{4}{B}","text":"Whenever Hagra Diabolist or another Ally enters the battlefield under your control, you may have target player lose life equal to the number of Allies you control.","flavor":"\"When exploring the darkest regions, wickedness can be the best accomplice of all.\"","number":"95","rulings":[{"date":"2009-10-01","text":"The ability counts the number of allies you control as it resolves."}],"imageName":"hagra diabolist"},{"layout":"normal","type":"Creature - Demon","types":["Creature"],"colors":["Black"],"multiverseid":185752,"name":"Halo Hunter","subtypes":["Demon"],"cmc":5,"rarity":"Rare","artist":"Chris Rahn","power":"6","toughness":"3","manaCost":"{2}{B}{B}{B}","text":"Intimidate (This creature can't be blocked except by artifact creatures and/or creatures that share a color with it.)\n\nWhen Halo Hunter enters the battlefield, destroy target Angel.","flavor":"Hanging on the walls of his lair, the fallen halos cast his depravity in everlasting light.","number":"96","rulings":[{"date":"2009-10-01","text":"Intimidate looks at the current colors of a creature that has it. Normally, Halo Hunter can't be blocked except by artifact creatures and/or red creatures. If it's turned white, then it can't be blocked except by artifact creatures and/or white creatures."},{"date":"2009-10-01","text":"If an attacking creature has intimidate, what colors it is matters only as the defending player declares blockers. Once it's blocked, changing its colors won't change that."},{"date":"2009-10-01","text":"Halo Hunter's triggered ability isn't optional. When it enters the battlefield, if you're the only player that controls an Angel, you'll have to target an Angel you control."}],"imageName":"halo hunter"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":180408,"name":"Harrow","cmc":3,"rarity":"Common","artist":"Izzy","manaCost":"{2}{G}","text":"As an additional cost to cast Harrow, sacrifice a land.\n\nSearch your library for up to two basic land cards and put them onto the battlefield. Then shuffle your library.","flavor":"The Roil redraws the world as it passes, leaving only the hedrons unchanged.","number":"165","rulings":[{"date":"2004-10-04","text":"The sacrifice of a land is part of the cost of casting Harrow. You can't pay this cost more than once to get a multiple effect."},{"date":"2004-10-04","text":"The two lands do not count toward your normal one land you can play each turn."},{"date":"2004-10-04","text":"Because the \"search\" requires you to find a card with certain characteristics, you don't have to find the card if you don't want to."}],"imageName":"harrow"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["Black"],"multiverseid":191361,"name":"Heartstabber Mosquito","subtypes":["Insect"],"cmc":4,"rarity":"Common","artist":"Jason Felix","power":"2","toughness":"2","manaCost":"{3}{B}","text":"Kicker {2}{B} (You may pay an additional {2}{B} as you cast this spell.)\n\nFlying\n\nWhen Heartstabber Mosquito enters the battlefield, if it was kicked, destroy target creature.","number":"97","imageName":"heartstabber mosquito"},{"layout":"normal","type":"Creature - Crab","types":["Creature"],"colors":["Blue"],"multiverseid":180348,"name":"Hedron Crab","subtypes":["Crab"],"cmc":1,"rarity":"Uncommon","artist":"Jesper Ejsing","power":"0","toughness":"2","manaCost":"{U}","text":"Landfall — Whenever a land enters the battlefield under your control, target player puts the top three cards of his or her library into his or her graveyard.","flavor":"Hedrons perplex minds both great and small.","number":"47","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"hedron crab"},{"layout":"normal","type":"Artifact Creature - Construct","types":["Artifact","Creature"],"colors":[],"multiverseid":193394,"name":"Hedron Scrabbler","subtypes":["Construct"],"cmc":2,"rarity":"Common","artist":"Jason Felix","power":"1","toughness":"1","manaCost":"{2}","text":"Landfall — Whenever a land enters the battlefield under your control, Hedron Scrabbler gets +1/+1 until end of turn.","flavor":"\"I don't care when the hedrons awoke. Why is the question that really matters.\"\n\n—Anowon, the Ruin Sage","number":"204","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"hedron scrabbler"},{"layout":"normal","type":"Creature - Elemental Hound","types":["Creature"],"colors":["Red"],"multiverseid":192215,"name":"Hellfire Mongrel","subtypes":["Elemental","Hound"],"cmc":3,"rarity":"Uncommon","artist":"Dan Scott","power":"2","toughness":"2","manaCost":"{2}{R}","text":"At the beginning of each opponent's upkeep, if that player has two or fewer cards in hand, Hellfire Mongrel deals 2 damage to him or her.","flavor":"There is no fondness between the hound and its master. There is only a common appreciation of the hunt.","number":"130","rulings":[{"date":"2009-10-01","text":"Hellfire Mongrel's triggered ability has an \"intervening 'if' clause.\" That means (1) the ability won't trigger at all unless the opponent whose turn it is has two or fewer cards in hand as his or her upkeep starts, and (2) the ability will do nothing if that player has three or more cards in hand by the time it resolves."},{"date":"2009-10-01","text":"In a Two-Headed Giant game, this ability will potentially trigger twice at the beginning of the opposing team's upkeep -- once for each player on that team."}],"imageName":"hellfire mongrel"},{"layout":"normal","type":"Creature - Dragon","types":["Creature"],"colors":["Red"],"multiverseid":185727,"name":"Hellkite Charger","subtypes":["Dragon"],"cmc":6,"rarity":"Rare","artist":"Jaime Jones","power":"5","toughness":"5","manaCost":"{4}{R}{R}","text":"Flying, haste\n\nWhenever Hellkite Charger attacks, you may pay {5}{R}{R}. If you do, untap all attacking creatures and after this phase, there is an additional combat phase.","number":"131","rulings":[{"date":"2009-10-01","text":"You decide whether to pay {5}{R}{R} as Hellkite Charger's ability resolves."},{"date":"2009-10-01","text":"If you pay {5}{R}{R}, the new combat phase immediately follows the current combat phase. There is no main phase in between."},{"date":"2009-10-01","text":"Hellkite Charger's ability may trigger multiple times in the same turn, since its own ability gives it multiple chances to attack. Each time it resolves, you may create an additional combat phase."},{"date":"2009-10-01","text":"If two Hellkite Chargers attack at the same time, both of their abilities trigger. If you pay {5}{R}{R} for each, two new combat phases will be created. However, all attacking creatures untap as those abilities resolve, not as the combat phases start. Any creature that attacks in the second combat phase will remain tapped during the third combat phase."}],"imageName":"hellkite charger"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":180435,"name":"Hideous End","cmc":3,"rarity":"Common","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{1}{B}{B}","text":"Destroy target nonblack creature. Its controller loses 2 life.","flavor":"\"A little dark magic won't stop me. The worse the curse, the better the prize.\"\n\n—Radavi, Joraga relic hunter, last words","number":"98","rulings":[{"date":"2009-10-01","text":"If the targeted creature is an illegal target by the time Hideous End resolves, the entire spell is countered. No one loses life."}],"imageName":"hideous end"},{"layout":"normal","type":"Creature - Human Berserker Ally","types":["Creature"],"colors":["Red"],"multiverseid":180467,"name":"Highland Berserker","subtypes":["Human","Berserker","Ally"],"cmc":2,"rarity":"Common","artist":"Chris Rahn","power":"2","toughness":"1","manaCost":"{1}{R}","text":"Whenever Highland Berserker or another Ally enters the battlefield under your control, you may have Ally creatures you control gain first strike until end of turn.","flavor":"He gets paid by the axe.","number":"132","rulings":[{"date":"2009-10-01","text":"The ability affects only Allies you control at the time the ability resolves."}],"imageName":"highland berserker"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Red"],"multiverseid":197530,"name":"Inferno Trap","subtypes":["Trap"],"cmc":4,"rarity":"Uncommon","artist":"Philip Straub","manaCost":"{3}{R}","text":"If you've been dealt damage by two or more creatures this turn, you may pay {R} rather than pay Inferno Trap's mana cost.\n\nInferno Trap deals 4 damage to target creature.","flavor":"\"Do you smell something burning?\"","number":"133","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"Inferno Trap's alternative cost condition checks for any damage, not just combat damage."},{"date":"2009-10-01","text":"The alternative cost condition doesn't check who controlled the creatures that dealt damage to you. Damage dealt to you by your own creatures counts."},{"date":"2009-10-01","text":"The alternative cost condition is satisfied only if two different creatures dealt damage to you, not if one creature dealt damage to you twice. The damage may have been dealt to you simultaneously (as with combat damage), or at separate times."},{"date":"2009-10-01","text":"You may target any creature, not just one that dealt damage to you this turn."}],"imageName":"inferno trap"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":178151,"name":"Into the Roil","cmc":2,"rarity":"Common","artist":"Kieran Yanner","manaCost":"{1}{U}","text":"Kicker {1}{U} (You may pay an additional {1}{U} as you cast this spell.)\n\nReturn target nonland permanent to its owner's hand. If Into the Roil was kicked, draw a card.","flavor":"\"Roil tide! Roil tide! Tie yourselves down!\"","number":"48","rulings":[{"date":"2009-10-01","text":"If the targeted permanent is an illegal target by the time Into the Roil resolves, the entire spell is countered. You don't draw a card."}],"imageName":"into the roil"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":190407,"name":"Iona, Shield of Emeria","subtypes":["Angel"],"cmc":9,"rarity":"Mythic Rare","artist":"Jason Chan","power":"7","toughness":"7","manaCost":"{6}{W}{W}{W}","text":"Flying\n\nAs Iona, Shield of Emeria enters the battlefield, choose a color.\n\nYour opponents can't cast spells of the chosen color.","flavor":"No more shall the righteous cower before evil.","number":"13","rulings":[{"date":"2009-10-01","text":"Iona's third ability includes permanent spells (artifacts, creatures, enchantments, and planeswalkers), not just instant and sorcery spells. It does not include lands or abilities (such as cycling or unearth)."},{"date":"2009-10-01","text":"Once the color is chosen, it's too late for opponents to respond by casting spells of that color. Iona is not yet in the battlefield at the time the color is chosen, so, for example, there's no way for an opponent to destroy it by casting Doom Blade if the chosen color is black."}],"imageName":"iona, shield of emeria"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Blue"],"multiverseid":185711,"name":"Ior Ruin Expedition","cmc":2,"rarity":"Common","artist":"Chris Rahn","manaCost":"{1}{U}","text":"Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Ior Ruin Expedition.\n\nRemove three quest counters from Ior Ruin Expedition and sacrifice it: Draw two cards.","number":"49","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"ior ruin expedition"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":195187,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"John Avon","text":"U","number":"234","variations":[195170,195165,201966,201964,201963,201965,195161],"imageName":"island1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":201966,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"John Avon","text":"U","number":"234a","variations":[195170,195165,201964,201963,201965,195187,195161],"imageName":"island1a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":195165,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Jung Park","text":"U","number":"235","variations":[195170,201966,201964,201963,201965,195187,195161],"imageName":"island2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":201964,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Jung Park","text":"U","number":"235a","variations":[195170,195165,201966,201963,201965,195187,195161],"imageName":"island2a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":201963,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"U","number":"236","variations":[195170,195165,201966,201964,201965,195187,195161],"imageName":"island3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":195161,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"U","number":"236a","variations":[195170,195165,201966,201964,201963,201965,195187],"imageName":"island3a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":201965,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Vincent Proce","text":"U","number":"237","variations":[195170,195165,201966,201964,201963,195187,195161],"imageName":"island4"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Island","types":["Land"],"colors":[],"multiverseid":195170,"name":"Island","subtypes":["Island"],"rarity":"Basic Land","artist":"Vincent Proce","text":"U","number":"237a","variations":[195165,201966,201964,201963,201965,195187,195161],"imageName":"island4a"},{"layout":"normal","type":"Creature - Elf Rogue Ally","types":["Creature"],"colors":["Green"],"multiverseid":192227,"name":"Joraga Bard","subtypes":["Elf","Rogue","Ally"],"cmc":4,"rarity":"Common","artist":"Volkan Baga","power":"1","toughness":"4","manaCost":"{3}{G}","text":"Whenever Joraga Bard or another Ally enters the battlefield under your control, you may have Ally creatures you control gain vigilance until end of turn.","flavor":"Adventuring bards recite Chanter's Epics, never-ending tales that keep their comrades' minds alert to danger.","number":"166","rulings":[{"date":"2009-10-01","text":"The ability affects only Allies you control at the time the ability resolves."}],"imageName":"joraga bard"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":177505,"name":"Journey to Nowhere","cmc":2,"rarity":"Common","artist":"Warren Mahy","manaCost":"{1}{W}","text":"When Journey to Nowhere enters the battlefield, exile target creature.\n\nWhen Journey to Nowhere leaves the battlefield, return the exiled card to the battlefield under its owner's control.","number":"14","rulings":[{"date":"2009-10-01","text":"If Journey to Nowhere leaves the battlefield before its first ability has resolved, its second ability will trigger and do nothing. Then its first ability will resolve and exile the targeted creature forever."}],"imageName":"journey to nowhere"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":189627,"name":"Jwar Isle Refuge","rarity":"Uncommon","artist":"Cyril Van Der Haegen","text":"Jwar Isle Refuge enters the battlefield tapped.\n\nWhen Jwar Isle Refuge enters the battlefield, you gain 1 life.\n\n{T}: Add {U} or {B} to your mana pool.","number":"215","imageName":"jwar isle refuge"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":169963,"name":"Kabira Crossroads","rarity":"Common","artist":"James Paick","text":"Kabira Crossroads enters the battlefield tapped.\n\nWhen Kabira Crossroads enters the battlefield, you gain 2 life.\n\n{T}: Add {W} to your mana pool.","number":"216","imageName":"kabira crossroads"},{"layout":"normal","type":"Creature - Human Cleric Ally","types":["Creature"],"colors":["White"],"multiverseid":180347,"name":"Kabira Evangel","subtypes":["Human","Cleric","Ally"],"cmc":3,"rarity":"Rare","artist":"Eric Deschamps","power":"2","toughness":"3","manaCost":"{2}{W}","text":"Whenever Kabira Evangel or another Ally enters the battlefield under your control, you may choose a color. If you do, Allies you control gain protection from the chosen color until end of turn.","number":"15","rulings":[{"date":"2009-10-01","text":"You choose a color (or choose not to) as the triggered ability resolves. Once the color is chosen, it's too late for players to respond."}],"imageName":"kabira evangel"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Vampire Warrior","types":["Creature"],"colors":["Black"],"multiverseid":185704,"name":"Kalitas, Bloodchief of Ghet","subtypes":["Vampire","Warrior"],"cmc":7,"rarity":"Mythic Rare","artist":"Todd Lockwood","power":"5","toughness":"5","manaCost":"{5}{B}{B}","text":"{B}{B}{B}, {T}: Destroy target creature. If that creature dies this way, put a black Vampire creature token onto the battlefield. Its power is equal to that creature's power and its toughness is equal to that creature's toughness.","number":"99","rulings":[{"date":"2009-10-01","text":"You get the token, not the player who controlled the creature."},{"date":"2009-10-01","text":"If the targeted creature is indestructible or regenerates, you won't get a Vampire token. Similarly, if the targeted creature is destroyed but a replacement effect moves it to a different zone instead of its owner's graveyard, you won't get a Vampire token."},{"date":"2009-10-01","text":"The power and toughness of the token are based on the destroyed creature's last existence on the battlefield. The token doesn't have any of the destroyed creature's other characteristics."}],"imageName":"kalitas, bloodchief of ghet"},{"layout":"normal","type":"Creature - Human Soldier Ally","types":["Creature"],"colors":["White"],"multiverseid":191356,"name":"Kazandu Blademaster","subtypes":["Human","Soldier","Ally"],"cmc":2,"rarity":"Uncommon","artist":"Michael Komarck","power":"1","toughness":"1","manaCost":"{W}{W}","text":"First strike, vigilance\n\nWhenever Kazandu Blademaster or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Kazandu Blademaster.","flavor":"\"If you hire a sell-sword, you'd better watch your back. Hire me, and I'll watch it for you.\"","number":"16","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"kazandu blademaster"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":189635,"name":"Kazandu Refuge","rarity":"Uncommon","artist":"Franz Vohwinkel","text":"Kazandu Refuge enters the battlefield tapped.\n\nWhen Kazandu Refuge enters the battlefield, you gain 1 life.\n\n{T}: Add {R} or {G} to your mana pool.","number":"217","imageName":"kazandu refuge"},{"layout":"normal","type":"Creature - Minotaur Warrior Ally","types":["Creature"],"colors":["Red"],"multiverseid":190408,"name":"Kazuul Warlord","subtypes":["Minotaur","Warrior","Ally"],"cmc":5,"rarity":"Rare","artist":"Kev Walker","power":"3","toughness":"3","manaCost":"{4}{R}","text":"Whenever Kazuul Warlord or another Ally enters the battlefield under your control, you may put a +1/+1 counter on each Ally creature you control.","flavor":"On expeditions, minotaurs are worth their weight in gold. Fortunately for their paymasters, most minotaurs don't know how much they weigh.","number":"134","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."},{"date":"2009-10-01","text":"Unlike other Allies with similar abilities, Kazuul Warlord's ability lets you put +1/+1 counters on all your Ally creatures, not just itself."}],"imageName":"kazuul warlord"},{"layout":"normal","type":"Artifact","types":["Artifact"],"colors":[],"multiverseid":198519,"name":"Khalni Gem","cmc":4,"rarity":"Uncommon","artist":"Franz Vohwinkel","manaCost":"{4}","text":"When Khalni Gem enters the battlefield, return two lands you control to their owner's hand.\n\n{T}: Add two mana of any one color to your mana pool.","flavor":"A fragment of ancient power lost in the heart of Ora Ondar.","number":"205","rulings":[{"date":"2009-10-01","text":"If you don't control any lands by the time Khalni Gem's triggered ability resolves, nothing happens. If you control just one, you'll have to return it to its owner's hand. Khalni Gem isn't affected in either case."}],"imageName":"khalni gem"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Green"],"multiverseid":186320,"name":"Khalni Heart Expedition","cmc":2,"rarity":"Common","artist":"Jason Chan","manaCost":"{1}{G}","text":"Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Khalni Heart Expedition.\n\nRemove three quest counters from Khalni Heart Expedition and sacrifice it: Search your library for up to two basic land cards, put them onto the battlefield tapped, then shuffle your library.","number":"167","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"khalni heart expedition"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":177530,"name":"Kor Aeronaut","subtypes":["Kor","Soldier"],"cmc":2,"rarity":"Uncommon","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{W}{W}","text":"Kicker {1}{W} (You may pay an additional {1}{W} as you cast this spell.)\n\nFlying\n\nWhen Kor Aeronaut enters the battlefield, if it was kicked, target creature gains flying until end of turn.","number":"17","imageName":"kor aeronaut"},{"layout":"normal","type":"Creature - Kor Scout","types":["Creature"],"colors":["White"],"multiverseid":170991,"name":"Kor Cartographer","subtypes":["Kor","Scout"],"cmc":4,"rarity":"Common","artist":"Ryan Pancoast","power":"2","toughness":"2","manaCost":"{3}{W}","text":"When Kor Cartographer enters the battlefield, you may search your library for a Plains card, put it onto the battlefield tapped, then shuffle your library.","flavor":"Kor have no concept of exploration. They return to homelands forgotten.","number":"18","imageName":"kor cartographer"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":177542,"name":"Kor Duelist","subtypes":["Kor","Soldier"],"cmc":1,"rarity":"Uncommon","artist":"Izzy","power":"1","toughness":"1","manaCost":"{W}","text":"As long as Kor Duelist is equipped, it has double strike. (It deals both first-strike and regular combat damage.)","flavor":"\"Swords cannot reach far enough. Chains cannot strike hard enough. An eternal dilemma, but a simple one.\"","number":"19","imageName":"kor duelist"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":178131,"name":"Kor Hookmaster","subtypes":["Kor","Soldier"],"cmc":3,"rarity":"Common","artist":"Wayne Reynolds","power":"2","toughness":"2","manaCost":"{2}{W}","text":"When Kor Hookmaster enters the battlefield, tap target creature an opponent controls. That creature doesn't untap during its controller's next untap step.","flavor":"\"For us, a rope represents the ties that bind the kor. For you, it's more literal.\"","number":"20","rulings":[{"date":"2009-10-01","text":"You may target any creature an opponent controls. It's okay if it's already tapped."},{"date":"2009-10-01","text":"If the targeted creature is untapped at the time its controller's next untap step begins, this ability has no effect. It won't apply at some later time when the targeted creature is tapped."},{"date":"2009-10-01","text":"If the affected creature changes controllers before its old controller's next untap step, this ability will prevent it from being untapped during its new controller's next untap step."}],"imageName":"kor hookmaster"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":189637,"name":"Kor Outfitter","subtypes":["Kor","Soldier"],"cmc":2,"rarity":"Common","artist":"Kieran Yanner","power":"2","toughness":"2","manaCost":"{W}{W}","text":"When Kor Outfitter enters the battlefield, you may attach target Equipment you control to target creature you control.","flavor":"\"We take only what we need to survive. Believe me, you will need this.\"","number":"21","rulings":[{"date":"2009-10-01","text":"You may target Kor Outfitter with its ability."},{"date":"2009-10-01","text":"If either target is illegal by the time the ability resolves, the ability won't do anything. If both targets are illegal, the ability is countered."}],"imageName":"kor outfitter"},{"layout":"normal","type":"Creature - Kor Cleric","types":["Creature"],"colors":["White"],"multiverseid":192214,"name":"Kor Sanctifiers","subtypes":["Kor","Cleric"],"cmc":3,"rarity":"Common","artist":"Dan Scott","power":"2","toughness":"3","manaCost":"{2}{W}","text":"Kicker {W} (You may pay an additional {W} as you cast this spell.)\n\nWhen Kor Sanctifiers enters the battlefield, if it was kicked, destroy target artifact or enchantment.","flavor":"\"Why keep such trinkets? They only add weight to your travels.\"","number":"22","imageName":"kor sanctifiers"},{"layout":"normal","type":"Creature - Kor Soldier","types":["Creature"],"colors":["White"],"multiverseid":178145,"name":"Kor Skyfisher","subtypes":["Kor","Soldier"],"cmc":2,"rarity":"Common","artist":"Dan Scott","power":"2","toughness":"3","manaCost":"{1}{W}","text":"Flying\n\nWhen Kor Skyfisher enters the battlefield, return a permanent you control to its owner's hand.","flavor":"\"Sometimes I snare the unexpected, but I know its purpose will be revealed in time.\"","number":"23","rulings":[{"date":"2009-10-01","text":"The triggered ability doesn't target a permanent. You choose which one to return to its owner's hand as the ability resolves. No one can respond to the choice."},{"date":"2009-10-01","text":"If Kor Skyfisher is still on the battlefield as its triggered ability resolves, you may return Kor Skyfisher itself."}],"imageName":"kor skyfisher"},{"layout":"normal","type":"Creature - Kraken","types":["Creature"],"colors":["Blue"],"multiverseid":177585,"name":"Kraken Hatchling","subtypes":["Kraken"],"cmc":1,"rarity":"Common","artist":"Jason Felix","power":"0","toughness":"4","manaCost":"{U}","flavor":"A spike and a maul are needed to crack their shells, but the taste is worth the effort.","number":"50","imageName":"kraken hatchling"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":188999,"name":"Landbind Ritual","cmc":5,"rarity":"Uncommon","artist":"Steve Prescott","manaCost":"{3}{W}{W}","text":"You gain 2 life for each Plains you control.","flavor":"\"Honor this place, for our children's children will stand here and speak these same words again.\"\n\n—Ayli, Kamsa cleric","number":"24","imageName":"landbind ritual"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Red"],"multiverseid":197528,"name":"Lavaball Trap","subtypes":["Trap"],"cmc":8,"rarity":"Rare","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{6}{R}{R}","text":"If an opponent had two or more lands enter the battlefield under his or her control this turn, you may pay {3}{R}{R} rather than pay Lavaball Trap's mana cost.\n\nDestroy two target lands. Lavaball Trap deals 4 damage to each creature.","number":"135","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"You may target any two lands, not just ones that entered the battlefield this turn."},{"date":"2009-10-01","text":"All creatures are dealt damage, not just ones controlled by the targeted lands' controller(s)."},{"date":"2009-10-01","text":"If both targeted lands are illegal targets by the time Lavaball Trap resolves, the entire spell is countered. No creatures are dealt damage."}],"imageName":"lavaball trap"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Blue"],"multiverseid":197534,"name":"Lethargy Trap","subtypes":["Trap"],"cmc":4,"rarity":"Common","artist":"Anthony Francisco","manaCost":"{3}{U}","text":"If three or more creatures are attacking, you may pay {U} rather than pay Lethargy Trap's mana cost.\n\nAttacking creatures get -3/-0 until end of turn.","flavor":"Suddenly, Zurdi didn't care about treasure, glory, food . . . or the drakes circling above.","number":"51","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."}],"imageName":"lethargy trap"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Blue"],"multiverseid":189636,"name":"Living Tsunami","subtypes":["Elemental"],"cmc":4,"rarity":"Uncommon","artist":"Matt Cavotta","power":"4","toughness":"4","manaCost":"{2}{U}{U}","text":"Flying\n\nAt the beginning of your upkeep, sacrifice Living Tsunami unless you return a land you control to its owner's hand.","flavor":"At low tide it slumbers. At high tide it devours.","number":"52","imageName":"living tsunami"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Octopus","types":["Creature"],"colors":["Blue"],"multiverseid":191369,"name":"Lorthos, the Tidemaker","subtypes":["Octopus"],"cmc":8,"rarity":"Mythic Rare","artist":"Kekai Kotaki","power":"8","toughness":"8","manaCost":"{5}{U}{U}{U}","text":"Whenever Lorthos, the Tidemaker attacks, you may pay {8}. If you do, tap up to eight target permanents. Those permanents don't untap during their controllers' next untap steps.","flavor":"When Lorthos emerges from his deepwater realm, the tides bow to his will and the coastline cowers in his presence.","number":"53","rulings":[{"date":"2009-10-01","text":"You may target any eight (or fewer) permanents. It's okay if any of them are already tapped, and it's okay if any of them are controlled by someone other than the defending player."},{"date":"2009-10-01","text":"If a targeted permanent is untapped at the time its controller's next untap step begins, this ability has no effect on it. It won't apply at some later time when the targeted permanent is tapped."},{"date":"2009-10-01","text":"If an affected permanent changes controllers before its old controller's next untap step, this ability will prevent it from being untapped during its new controller's next untap step."}],"imageName":"lorthos, the tidemaker"},{"layout":"normal","type":"Creature - Snake","types":["Creature"],"colors":["Green"],"multiverseid":185749,"name":"Lotus Cobra","subtypes":["Snake"],"cmc":2,"rarity":"Mythic Rare","artist":"Chippy","power":"2","toughness":"1","manaCost":"{1}{G}","text":"Landfall — Whenever a land enters the battlefield under your control, you may add one mana of any color to your mana pool.","flavor":"Its scales contain the essence of thousands of lotus blooms.","number":"168","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"lotus cobra"},{"layout":"normal","type":"Creature - Merfolk Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":190404,"name":"Lullmage Mentor","subtypes":["Merfolk","Wizard"],"cmc":3,"rarity":"Rare","artist":"Jaime Jones","power":"2","toughness":"2","manaCost":"{1}{U}{U}","text":"Whenever a spell or ability you control counters a spell, you may put a 1/1 blue Merfolk creature token onto the battlefield.\n\nTap seven untapped Merfolk you control: Counter target spell.","flavor":"\"Many voices are needed to quiet this land.\"","number":"54","rulings":[{"date":"2009-10-01","text":"A spell or ability counters a spell only if it specifically contains the word \"counter\" in its text. If a spell or ability you control causes all the targets of a spell to become illegal, that spell is countered by the game rules, not the spell or ability you control. For example, if you control Lullmage Mentor and cast Doom Blade to destroy a creature targeted by Giant Growth, you do not get a Merfolk token when the game rules counter Giant Growth."},{"date":"2009-10-01","text":"Lullmage Mentor's second ability will cause its first ability to trigger."},{"date":"2009-10-01","text":"Since the second ability doesn't have a tap symbol in its cost, you can tap creatures (including Lullmage Mentor itself) that haven't been under your control since your most recent turn began to pay the cost."}],"imageName":"lullmage mentor"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":197889,"name":"Luminarch Ascension","cmc":2,"rarity":"Rare","artist":"Michael Komarck","manaCost":"{1}{W}","text":"At the beginning of each opponent's end step, if you didn't lose life this turn, you may put a quest counter on Luminarch Ascension. (Damage causes loss of life.)\n\n{1}{W}: Put a 4/4 white Angel creature token with flying onto the battlefield. Activate this ability only if Luminarch Ascension has four or more quest counters on it.","number":"25","rulings":[{"date":"2009-10-01","text":"Luminarch Ascension's first ability has an \"intervening 'if' clause.\" It checks whether you've lost life during the turn both as it would trigger and as it resolves."},{"date":"2009-10-01","text":"Life lost during the end step after Luminarch Ascension's first ability resolves has no bearing on it."},{"date":"2009-10-01","text":"Luminarch Ascension's first ability checks only whether life was lost. It doesn't care whether life was also gained. For example, if you lost 4 life and gained 6 life during the turn, you'll have a higher life total than you started the turn with -- but Luminarch Ascension's first ability won't trigger."},{"date":"2009-10-01","text":"Luminarch Ascension's second ability checks how many quest counters are on it only at the time you activate the ability. Once activated, the ability will resolve as normal even if quest counters are removed from Luminarch Ascension."},{"date":"2009-10-01","text":"In a Two-Headed Giant game, Luminarch Ascension's first ability will trigger twice at the beginning of the opposing team's end step if you didn't lose life that turn. If both abilities resolve, it will get two quest counters. (It doesn't matter whether your teammate lost life or not.)"}],"imageName":"luminarch ascension"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":180352,"name":"Magma Rift","cmc":3,"rarity":"Common","artist":"Jung Park","manaCost":"{2}{R}","text":"As an additional cost to cast Magma Rift, sacrifice a land.\n\nMagma Rift deals 5 damage to target creature.","flavor":"\"Lighting a fire needs kindling and heat. You be the kindling. I'll bring the heat.\"\n\n—Chandra Nalaar","number":"136","imageName":"magma rift"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190412,"name":"Magosi, the Waterveil","rarity":"Rare","artist":"Eric Deschamps","text":"Magosi, the Waterveil enters the battlefield tapped.\n\n{T}: Add {U} to your mana pool.\n\n{U}, {T}: Put an eon counter on Magosi, the Waterveil. Skip your next turn.\n\n{T}, Remove an eon counter from Magosi, the Waterveil and return it to its owner's hand: Take an extra turn after this one.","number":"218","rulings":[{"date":"2009-10-01","text":"As Magosi's third ability resolves, you'll skip your next turn even if you don't put an eon counter on Magosi (because it's left the battlefield by then, perhaps)."},{"date":"2009-10-01","text":"You can activate Magosi's fourth ability only if it has an eon counter on it."},{"date":"2009-10-01","text":"You return Magosi to its owner's hand as part of the cost to activate its fourth ability. If Magosi has more than one eon counter on it, you can't activate the ability, untap it, then activate it again."},{"date":"2009-10-01","text":"If you somehow activate Magosi's third and fourth abilities during the same turn, the effects will cancel each other out. The turn you skip is the next one you would take, which is the turn created by Magosi's fourth ability. It doesn't matter in which order the abilities resolved."},{"date":"2009-10-01","text":"If you take an extra turn in a Two-Headed Giant game, you entire team takes the extra turn."}],"imageName":"magosi, the waterveil"},{"layout":"normal","type":"Creature - Kor Soldier Ally","types":["Creature"],"colors":["White"],"multiverseid":195628,"name":"Makindi Shieldmate","subtypes":["Kor","Soldier","Ally"],"cmc":3,"rarity":"Common","artist":"Howard Lyon","power":"0","toughness":"3","manaCost":"{2}{W}","text":"Defender\n\nWhenever Makindi Shieldmate or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Makindi Shieldmate.","flavor":"The more who rely on him, the more resolute he becomes.","number":"26","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"makindi shieldmate"},{"layout":"normal","type":"Creature - Vampire Shaman","types":["Creature"],"colors":["Black"],"multiverseid":190398,"name":"Malakir Bloodwitch","subtypes":["Vampire","Shaman"],"cmc":5,"rarity":"Rare","artist":"Shelly Wan","power":"4","toughness":"4","manaCost":"{3}{B}{B}","text":"Flying, protection from white\n\nWhen Malakir Bloodwitch enters the battlefield, each opponent loses life equal to the number of Vampires you control. You gain life equal to the life lost this way.","number":"100","imageName":"malakir bloodwitch"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":186324,"name":"Mark of Mutiny","cmc":3,"rarity":"Uncommon","artist":"Mike Bierek","manaCost":"{2}{R}","text":"Gain control of target creature until end of turn. Put a +1/+1 counter on it and untap it. That creature gains haste until end of turn. (It can attack and {T} this turn.)","flavor":"The flame of anger is hard to douse once lit.","number":"137","rulings":[{"date":"2009-10-01","text":"You may target a creature you already control. You may target a creature that's already untapped."},{"date":"2009-10-01","text":"The +1/+1 counter remains on the creature after the control-changing effect ends."}],"imageName":"mark of mutiny"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":177543,"name":"Marsh Casualties","cmc":2,"rarity":"Uncommon","artist":"Scott Chou","manaCost":"{B}{B}","text":"Kicker {3} (You may pay an additional {3} as you cast this spell.)\n\nCreatures target player controls get -1/-1 until end of turn. If Marsh Casualties was kicked, those creatures get -2/-2 until end of turn instead.","number":"101","imageName":"marsh casualties"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":191371,"name":"Marsh Flats","rarity":"Rare","artist":"Izzy","text":"{T}, Pay 1 life, Sacrifice Marsh Flats: Search your library for a Plains or Swamp card and put it onto the battlefield. Then shuffle your library.","number":"219","imageName":"marsh flats"},{"layout":"normal","type":"Creature - Merfolk Scout","types":["Creature"],"colors":["Blue"],"multiverseid":189625,"name":"Merfolk Seastalkers","subtypes":["Merfolk","Scout"],"cmc":4,"rarity":"Uncommon","artist":"Eric Deschamps","power":"2","toughness":"3","manaCost":"{3}{U}","text":"Islandwalk\n\n{2}{U}: Tap target creature without flying.","flavor":"\"Do they seek knowledge or wealth? Are they bandits or benefactors? It depends on who is chanting the tale.\"\n\n—Nikou, Joraga bard","number":"55","imageName":"merfolk seastalkers"},{"layout":"normal","type":"Creature - Merfolk Scout","types":["Creature"],"colors":["Blue"],"multiverseid":170978,"name":"Merfolk Wayfinder","subtypes":["Merfolk","Scout"],"cmc":3,"rarity":"Uncommon","artist":"Christopher Moeller","power":"1","toughness":"2","manaCost":"{2}{U}","text":"Flying\n\nWhen Merfolk Wayfinder enters the battlefield, reveal the top three cards of your library. Put all Island cards revealed this way into your hand and the rest on the bottom of your library in any order.","number":"56","rulings":[{"date":"2009-10-01","text":"If there are three or fewer cards in your library, you'll reveal all of them."}],"imageName":"merfolk wayfinder"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":193403,"name":"Mind Sludge","cmc":5,"rarity":"Uncommon","artist":"Howard Lyon","manaCost":"{4}{B}","text":"Target player discards a card for each Swamp you control.","flavor":"\"Guard your thoughts. You never know who might wish to take them from you.\"\n\n—Kalitas, Bloodchief of Ghet","number":"102","imageName":"mind sludge"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Blue"],"multiverseid":197532,"name":"Mindbreak Trap","subtypes":["Trap"],"cmc":4,"rarity":"Mythic Rare","artist":"Christopher Moeller","manaCost":"{2}{U}{U}","text":"If an opponent cast three or more spells this turn, you may pay {0} rather than pay Mindbreak Trap's mana cost.\n\nExile any number of target spells.","flavor":"\"Life is a maze. This is one of its dead ends.\"\n\n—Noyan Dar, Tazeem lullmage","number":"57","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"Mindbreak Trap's alternative cost condition checks whether an opponent cast three or more spells this turn, not whether those spells have resolved."},{"date":"2009-10-01","text":"If a spell is exiled, it's removed from the stack and thus will not resolve. The spell isn't countered; it just no longer exists. This works on spells that can't be countered, such as Terra Stomper."}],"imageName":"mindbreak trap"},{"layout":"normal","type":"Creature - Zombie","types":["Creature"],"colors":["Black"],"multiverseid":180415,"name":"Mindless Null","subtypes":["Zombie"],"cmc":3,"rarity":"Common","artist":"Karl Kopinski","power":"2","toughness":"2","manaCost":"{2}{B}","text":"Mindless Null can't block unless you control a Vampire.","flavor":"Only a bloodchief can create vampires. The rest sire nulls, who become mindless beasts in their former bodies.","number":"103","rulings":[{"date":"2009-10-01","text":"Whether you control a Vampire matters only at the time you declare blockers. Once Mindless Null blocks a creature, that won't change, even if all the Vampires you control leave the battlefield."}],"imageName":"mindless null"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Black"],"multiverseid":190401,"name":"Mire Blight","subtypes":["Aura"],"cmc":1,"rarity":"Common","artist":"Dave Kendall","manaCost":"{B}","text":"Enchant creature\n\nWhen enchanted creature is dealt damage, destroy it.","flavor":"\"Is there anything in Guul Draz that doesn't suck the life out of you?\"\n\n—Tarsa, Sea Gate sell-sword","number":"104","rulings":[{"date":"2009-10-01","text":"Mire Blight's ability triggers when the enchanted creature is dealt any kind of damage, not just combat damage."},{"date":"2009-10-01","text":"If Mire Blight's ability triggers, the creature it was enchanting at that time is the one that will be destroyed when the ability resolves. It doesn't matter if Mire Blight leaves the battlefield or somehow becomes attached to another creature by that time."}],"imageName":"mire blight"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190413,"name":"Misty Rainforest","rarity":"Rare","artist":"Shelly Wan","text":"{T}, Pay 1 life, Sacrifice Misty Rainforest: Search your library for a Forest or Island card and put it onto the battlefield. Then shuffle your library.","number":"220","imageName":"misty rainforest"},{"layout":"normal","type":"Creature - Fungus Beast","types":["Creature"],"colors":["Green"],"multiverseid":183414,"name":"Mold Shambler","subtypes":["Fungus","Beast"],"cmc":4,"rarity":"Common","artist":"Karl Kopinski","power":"3","toughness":"3","manaCost":"{3}{G}","text":"Kicker {1}{G} (You may pay an additional {1}{G} as you cast this spell.)\n\nWhen Mold Shambler enters the battlefield, if it was kicked, destroy target noncreature permanent.","flavor":"When civilization encroaches on nature, Zendikar encroaches back.","number":"169","imageName":"mold shambler"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":191359,"name":"Molten Ravager","subtypes":["Elemental"],"cmc":3,"rarity":"Common","artist":"Dave Kendall","power":"0","toughness":"4","manaCost":"{2}{R}","text":"{R}: Molten Ravager gets +1/+0 until end of turn.","flavor":"\"Only the foolhardy would venture into the Akoum Mountains without a lullmage to tame the raging rocks and living fires.\"\n\n—Sachir, Akoum Expeditionary House","number":"138","imageName":"molten ravager"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":195178,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"John Avon","number":"242","variations":[201970,201969,201968,201967,195171,195181,195184],"imageName":"mountain1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":201968,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"John Avon","number":"242a","variations":[201970,201969,201967,195178,195171,195181,195184],"imageName":"mountain1a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":195171,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Jung Park","number":"243","variations":[201970,201969,201968,201967,195178,195181,195184],"imageName":"mountain2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":201967,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Jung Park","number":"243a","variations":[201970,201969,201968,195178,195171,195181,195184],"imageName":"mountain2a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":195181,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Véronique Meignaud","number":"244","variations":[201970,201969,201968,201967,195178,195171,195184],"imageName":"mountain3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":201969,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Véronique Meignaud","number":"244a","variations":[201970,201968,201967,195178,195171,195181,195184],"imageName":"mountain3a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":201970,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Vincent Proce","number":"245","variations":[201969,201968,201967,195178,195171,195181,195184],"imageName":"mountain4"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Mountain","types":["Land"],"colors":[],"multiverseid":195184,"name":"Mountain","subtypes":["Mountain"],"rarity":"Basic Land","artist":"Vincent Proce","number":"245a","variations":[201970,201969,201968,201967,195178,195171,195181],"imageName":"mountain4a"},{"layout":"normal","type":"Creature - Human Shaman Ally","types":["Creature"],"colors":["Red"],"multiverseid":195634,"name":"Murasa Pyromancer","subtypes":["Human","Shaman","Ally"],"cmc":6,"rarity":"Uncommon","artist":"Kekai Kotaki","power":"3","toughness":"2","manaCost":"{4}{R}{R}","text":"Whenever Murasa Pyromancer or another Ally enters the battlefield under your control, you may have Murasa Pyromancer deal damage to target creature equal to the number of Allies you control.","flavor":"\"Fire is my accomplice. For enough coin, it can be yours as well.\"","number":"139","rulings":[{"date":"2009-10-01","text":"The ability counts the number of allies you control as it resolves."},{"date":"2009-10-01","text":"You target a creature when the ability triggers. You decide whether to have Murasa Pyromancer deal damage to that creature as the ability resolves."}],"imageName":"murasa pyromancer"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":180360,"name":"Narrow Escape","cmc":3,"rarity":"Common","artist":"Karl Kopinski","manaCost":"{2}{W}","text":"Return target permanent you control to its owner's hand. You gain 4 life.","flavor":"\"A good explorer has to be as slippery as a gomazoa, as tough as a scute bug, and luckier than a ten-fingered trapfinder.\"\n\n—Arhana, Kazandu trapfinder","number":"27","imageName":"narrow escape"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Black"],"multiverseid":197529,"name":"Needlebite Trap","subtypes":["Trap"],"cmc":7,"rarity":"Uncommon","artist":"Daarken","manaCost":"{5}{B}{B}","text":"If an opponent gained life this turn, you may pay {B} rather than pay Needlebite Trap's mana cost.\n\nTarget player loses 5 life and you gain 5 life.","flavor":"The traps around the vampire city of Malakir hint at the thirst of its inhabitants.","number":"105","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"Needlebite Trap's alternative cost condition checks only whether life was gained. It doesn't care whether life was also lost. For example, if an opponent gained 4 life and lost 6 life during the turn, that player will have a lower life total than he or she started the turn with -- but you can still cast Needlebite Trap by paying {B}."}],"imageName":"needlebite trap"},{"layout":"normal","type":"Creature - Human Warrior Ally","types":["Creature"],"colors":["Black"],"multiverseid":197403,"name":"Nimana Sell-Sword","subtypes":["Human","Warrior","Ally"],"cmc":4,"rarity":"Common","artist":"Daarken","power":"2","toughness":"2","manaCost":"{3}{B}","text":"Whenever Nimana Sell-Sword or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Nimana Sell-Sword.","flavor":"\"He asked if I had work for him. No wasn't the right answer.\"\n\n—Samila, Murasa Expeditionary House","number":"106","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"nimana sell-sword"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["White"],"multiverseid":180346,"name":"Nimbus Wings","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Chris Rahn","manaCost":"{1}{W}","text":"Enchant creature\n\nEnchanted creature gets +1/+2 and has flying.","flavor":"Explorers may find ways into the Sky Ruin, but they find its secrets well protected by shifting hedrons and Roil winds.","number":"28","imageName":"nimbus wings"},{"layout":"normal","type":"Planeswalker - Nissa","types":["Planeswalker"],"colors":["Green"],"multiverseid":190411,"name":"Nissa Revane","subtypes":["Nissa"],"cmc":4,"rarity":"Mythic Rare","artist":"Jaime Jones","loyalty":2,"manaCost":"{2}{G}{G}","text":"+1: Search your library for a card named Nissa's Chosen and put it onto the battlefield. Then shuffle your library.\n\n+1: You gain 2 life for each Elf you control.\n\n-7: Search your library for any number of Elf creature cards and put them onto the battlefield. Then shuffle your library.","number":"170","rulings":[{"date":"2009-10-01","text":"You may activate Nissa's first ability even if you know you have no cards named Nissa's Chosen in your library. You must still shuffle your library in that situation."},{"date":"2009-10-01","text":"You may activate Nissa's second ability even if you control no Elves."}],"imageName":"nissa revane"},{"layout":"normal","type":"Creature - Elf Warrior","types":["Creature"],"colors":["Green"],"multiverseid":185699,"name":"Nissa's Chosen","subtypes":["Elf","Warrior"],"cmc":2,"rarity":"Common","artist":"Jaime Jones","power":"2","toughness":"3","manaCost":"{G}{G}","text":"If Nissa's Chosen would die, put it on the bottom of its owner's library instead.","flavor":"\"Nissa will save the elves, but only the ones who have proved their worth.\"","number":"171","imageName":"nissa's chosen"},{"layout":"normal","type":"Creature - Spirit","types":["Creature"],"colors":["White"],"multiverseid":171001,"name":"Noble Vestige","subtypes":["Spirit"],"cmc":3,"rarity":"Common","artist":"Jason Chan","power":"1","toughness":"2","manaCost":"{2}{W}","text":"Flying\n\n{T}: Prevent the next 1 damage that would be dealt to target player this turn.","flavor":"Most spirits are chained to this world by their despair, but he remains tethered by his hope for better days.","number":"29","imageName":"noble vestige"},{"layout":"normal","supertypes":["Legendary"],"type":"Legendary Creature - Demon","types":["Creature"],"colors":["Black"],"multiverseid":192219,"name":"Ob Nixilis, the Fallen","subtypes":["Demon"],"cmc":5,"rarity":"Mythic Rare","artist":"Jason Felix","power":"3","toughness":"3","manaCost":"{3}{B}{B}","text":"Landfall — Whenever a land enters the battlefield under your control, you may have target player lose 3 life. If you do, put three +1/+1 counters on Ob Nixilis, the Fallen.","flavor":"His spark lost, he plots revenge upon the plane whose corrupting mana fractured his soul.","number":"107","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"ob nixilis, the fallen"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Red"],"multiverseid":192224,"name":"Obsidian Fireheart","subtypes":["Elemental"],"cmc":4,"rarity":"Mythic Rare","artist":"Raymond Swanland","power":"4","toughness":"4","manaCost":"{1}{R}{R}{R}","text":"{1}{R}{R}: Put a blaze counter on target land without a blaze counter on it. For as long as that land has a blaze counter on it, it has \"At the beginning of your upkeep, this land deals 1 damage to you.\" (The land continues to burn after Obsidian Fireheart has left the battlefield.)","number":"140","rulings":[{"date":"2009-10-01","text":"As the reminder text indicates, whether the targeted land has the triggered ability that's been granted to it depends only on whether it has a blaze counter on it, not on whether Obsidian Fireheart is still on the battlefield."},{"date":"2009-10-01","text":"The ability gained by the land triggers at the beginning of the upkeep of the land's controller, not the beginning of the upkeep of Obsidian Fireheart's controller. The player who controls the land at the time the ability triggers is the one who's dealt damage."},{"date":"2009-10-01","text":"A land with a blaze counter on it is an illegal target for this ability. You may activate the ability targeting a land, then activate the ability in response to itself targeting the same land. Although the first ability to resolve will put a blaze counter on that land, the second ability to resolve will be countered."},{"date":"2009-10-01","text":"If all blaze counters on a land are moved to a different land, the triggered ability doesn't follow them. The first land no longer has the ability because it no longer has a blaze counter on it. The second land doesn't have the ability because Obsidian Fireheart didn't target it."},{"date":"2009-10-01","text":"If a land ends up with more than one blaze counter on it (thanks to Doubling Season or Gilder Bairn, for example), the ability still only causes it to deal 1 damage to its controller each turn."}],"imageName":"obsidian fireheart"},{"layout":"normal","type":"Creature - Kor Cleric Ally","types":["Creature"],"colors":["White"],"multiverseid":192210,"name":"Ondu Cleric","subtypes":["Kor","Cleric","Ally"],"cmc":2,"rarity":"Common","artist":"Jim Murray","power":"1","toughness":"1","manaCost":"{1}{W}","text":"Whenever Ondu Cleric or another Ally enters the battlefield under your control, you may gain life equal to the number of Allies you control.","flavor":"A cleric's true balm is the confidence he inspires in his compatriots.","number":"30","rulings":[{"date":"2009-10-01","text":"The ability counts the number of allies you control as it resolves."}],"imageName":"ondu cleric"},{"layout":"normal","type":"Creature - Elf Shaman","types":["Creature"],"colors":["Green"],"multiverseid":185737,"name":"Oracle of Mul Daya","subtypes":["Elf","Shaman"],"cmc":4,"rarity":"Rare","artist":"Vance Kovacs","power":"2","toughness":"2","manaCost":"{3}{G}","text":"You may play an additional land on each of your turns.\n\nPlay with the top card of your library revealed.\n\nYou may play the top card of your library if it's a land card.","number":"172","rulings":[{"date":"2009-10-01","text":"As you play a land, announce whether it's your normal land play for the turn or you're playing it as the result of Oracle of Mul Daya's first ability (or another such effect that exists)."},{"date":"2009-10-01","text":"If you control more than one Oracle of Mul Daya, the effects of their first abilities are cumulative. If you control two, for example, you can play three lands on your turn."},{"date":"2009-10-01","text":"Oracle of Mul Daya doesn't change the times when you can play a land card from the top of your library. You can play a land only during your main phase when you have priority and the stack is empty. Doing so counts as one of your land plays for the turn (either your normal one, the additional one Oracle of Mul Daya grants you, or an additional one from some other effect)."},{"date":"2009-10-01","text":"If you play your first land of the turn from the top of your library, and the new top card is another land card, you can play that one too."},{"date":"2013-04-15","text":"The top card of your library isn't in your hand, so you can't suspend it, cycle it, discard it, or activate any of its activated abilities."},{"date":"2013-04-15","text":"If the top card of your library changes while you're casting a spell or activating an ability, the new top card won't be revealed until you finish casting that spell or activating that ability."},{"date":"2013-04-15","text":"When playing with the top card of your library revealed, if an effect tells you to draw several cards, reveal each one before you draw it."}],"imageName":"oracle of mul daya"},{"layout":"normal","type":"Creature - Spider","types":["Creature"],"colors":["Green"],"multiverseid":185696,"name":"Oran-Rief Recluse","subtypes":["Spider"],"cmc":3,"rarity":"Common","artist":"Lars Grant-West","power":"1","toughness":"3","manaCost":"{2}{G}","text":"Kicker {2}{G} (You may pay an additional {2}{G} as you cast this spell.)\n\nReach (This creature can block creatures with flying.)\n\nWhen Oran-Rief Recluse enters the battlefield, if it was kicked, destroy target creature with flying.","number":"173","imageName":"oran-rief recluse"},{"layout":"normal","type":"Creature - Human Warrior Ally","types":["Creature"],"colors":["Green"],"multiverseid":178138,"name":"Oran-Rief Survivalist","subtypes":["Human","Warrior","Ally"],"cmc":2,"rarity":"Common","artist":"Kev Walker","power":"1","toughness":"1","manaCost":"{1}{G}","text":"Whenever Oran-Rief Survivalist or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Oran-Rief Survivalist.","flavor":"\"I'm strong enough to survive alone. I'm smart enough to want companions at my side.\"","number":"174","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"oran-rief survivalist"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190417,"name":"Oran-Rief, the Vastwood","rarity":"Rare","artist":"Mike Bierek","text":"Oran-Rief, the Vastwood enters the battlefield tapped.\n\n{T}: Add {G} to your mana pool.\n\n{T}: Put a +1/+1 counter on each green creature that entered the battlefield this turn.","number":"221","rulings":[{"date":"2009-10-01","text":"Oran-Rief's third ability cares about permanents' characteristics at the time the ability resolves, not their characteristics at the time they entered the battlefield. For example, if a blue creature enters the battlefield, then is turned green by a spell or ability, then Oran-Rief's second ability resolves, you'll put a +1/+1 counter on that creature."},{"date":"2009-10-01","text":"Oran-Rief's second ability affects all permanents that are green creatures that entered the battlefield this turn, not just the ones you control."}],"imageName":"oran-rief, the vastwood"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":178109,"name":"Paralyzing Grasp","subtypes":["Aura"],"cmc":3,"rarity":"Common","artist":"Izzy","manaCost":"{2}{U}","text":"Enchant creature\n\nEnchanted creature doesn't untap during its controller's untap step.","flavor":"The Halimar Sea Caves are both the breeding ground of giant squids and the dumping ground of hardened criminals.","number":"58","rulings":[{"date":"2009-10-01","text":"Paralyzing Grasp may target, and may enchant, an untapped creature. If it does, it will have no effect unless that creature becomes tapped somehow."},{"date":"2012-10-01","text":"The enchanted creature can still be untapped by a spell or ability at other times."}],"imageName":"paralyzing grasp"},{"layout":"normal","type":"Creature - Ox","types":["Creature"],"colors":["White"],"multiverseid":190395,"name":"Pillarfield Ox","subtypes":["Ox"],"cmc":4,"rarity":"Common","artist":"Andrew Robinson","power":"2","toughness":"4","manaCost":"{3}{W}","flavor":"These stubborn and unpredictable oxen inspire the plains nomads' most colorful curses.","number":"31","imageName":"pillarfield ox"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":169975,"name":"Piranha Marsh","rarity":"Common","artist":"Nic Klein","text":"Piranha Marsh enters the battlefield tapped.\n\nWhen Piranha Marsh enters the battlefield, target player loses 1 life.\n\n{T}: Add {B} to your mana pool.","number":"222","imageName":"piranha marsh"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["White"],"multiverseid":197533,"name":"Pitfall Trap","subtypes":["Trap"],"cmc":3,"rarity":"Uncommon","artist":"Franz Vohwinkel","manaCost":"{2}{W}","text":"If exactly one creature is attacking, you may pay {W} rather than pay Pitfall Trap's mana cost.\n\nDestroy target attacking creature without flying.","flavor":"Each spike is poisoned—the trapmaker's idea of mercy.","number":"32","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."}],"imageName":"pitfall trap"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":201973,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"John Avon","text":"W","number":"230","variations":[195163,201971,201972,195179,195173,201974,195196],"imageName":"plains1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":195179,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"John Avon","text":"W","number":"230a","variations":[195163,201971,201972,195173,201974,201973,195196],"imageName":"plains1a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":201972,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Jung Park","text":"W","number":"231","variations":[195163,201971,195179,195173,201974,201973,195196],"imageName":"plains2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":195173,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Jung Park","text":"W","number":"231a","variations":[195163,201971,201972,195179,201974,201973,195196],"imageName":"plains2a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":201974,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"W","number":"232","variations":[195163,201971,201972,195179,195173,201973,195196],"imageName":"plains3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":195196,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"W","number":"232a","variations":[195163,201971,201972,195179,195173,201974,201973],"imageName":"plains3a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":201971,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Vincent Proce","text":"W","number":"233","variations":[195163,201972,195179,195173,201974,201973,195196],"imageName":"plains4"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Plains","types":["Land"],"colors":[],"multiverseid":195163,"name":"Plains","subtypes":["Plains"],"rarity":"Basic Land","artist":"Vincent Proce","text":"W","number":"233a","variations":[201971,201972,195179,195173,201974,201973,195196],"imageName":"plains4a"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["Red"],"multiverseid":170977,"name":"Plated Geopede","subtypes":["Insect"],"cmc":2,"rarity":"Common","artist":"Eric Deschamps","power":"1","toughness":"1","manaCost":"{1}{R}","text":"First strike\n\nLandfall — Whenever a land enters the battlefield under your control, Plated Geopede gets +2/+2 until end of turn.","flavor":"\"Kor armorers buy the scales and claws. Elf oracles buy the rest.\"\n\n—Nablus, North Hada trapper","number":"141","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"plated geopede"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":169958,"name":"Predatory Urge","subtypes":["Aura"],"cmc":4,"rarity":"Rare","artist":"Scott Chou","manaCost":"{3}{G}","text":"Enchant creature\n\nEnchanted creature has \"{T}: This creature deals damage equal to its power to target creature. That creature deals damage equal to its power to this creature.\"","number":"175","rulings":[{"date":"2009-10-01","text":"The controller of the enchanted creature may activate the ability, not the controller of Predatory Urge."},{"date":"2009-10-01","text":"If the enchanted creature's ability is activated, that creature is the one that will deal and be dealt damage when the ability resolves. It doesn't matter if Predatory Urge leaves the battlefield or somehow becomes attached to another creature by that time."},{"date":"2009-10-01","text":"If the targeted creature leaves the battlefield (or otherwise becomes an illegal target) before the ability resolves, the ability is countered. The enchanted creature isn't dealt damage."},{"date":"2009-10-01","text":"On the other hand, if the enchanted creature leaves the battlefield before the ability resolves, the ability continues to resolve. The enchanted creature deals damage to the targeted creature equal to the power the enchanted creature had as it last existed on the battlefield."},{"date":"2009-10-01","text":"You may have the enchanted creature target itself with its own ability. If you do, it will deal damage to itself equal to its power, then immediately do it again."}],"imageName":"predatory urge"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":193407,"name":"Primal Bellow","cmc":1,"rarity":"Uncommon","artist":"Daren Bader","manaCost":"{G}","text":"Target creature gets +1/+1 until end of turn for each Forest you control.","flavor":"\"A might spell can be handy against baloths, giants, kraken, the Roil—or if you lose your bearings in the woods.\"\n\n—Chadir the Navigator","number":"176","imageName":"primal bellow"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":192217,"name":"Punishing Fire","cmc":2,"rarity":"Uncommon","artist":"Christopher Moeller","manaCost":"{1}{R}","text":"Punishing Fire deals 2 damage to target creature or player.\n\nWhenever an opponent gains life, you may pay {R}. If you do, return Punishing Fire from your graveyard to your hand.","number":"142","rulings":[{"date":"2009-10-01","text":"Punishing Fire's triggered ability triggers only if it's already in your graveyard at the time an opponent gains life. For example, you can cast it in response to a spell or ability that will cause an opponent to gain life. In that case, Punishing Fire will resolve first, so it will be in the graveyard by the time the opponent gains life. However, if you wait until an opponent actually gains life and then cast Punishing Fire, you won't be able to return it to your hand at that time."},{"date":"2009-10-01","text":"You choose whether to pay {R} as the triggered ability resolves."},{"date":"2009-10-01","text":"If Punishing Fire has left your graveyard by the time its triggered ability resolves, you may still pay {R}, but you won't return it to your hand. This is true even if Punishing Fire has left your graveyard and returned to it by the time its triggered ability resolves."}],"imageName":"punishing fire"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":197891,"name":"Pyromancer Ascension","cmc":2,"rarity":"Rare","artist":"Kev Walker","manaCost":"{1}{R}","text":"Whenever you cast an instant or sorcery spell that has the same name as a card in your graveyard, you may put a quest counter on Pyromancer Ascension.\n\nWhenever you cast an instant or sorcery spell while Pyromancer Ascension has two or more quest counters on it, you may copy that spell. You may choose new targets for the copy.","number":"143","rulings":[{"date":"2009-10-01","text":"If either of Pyromancer Ascension's abilities triggers, it will go on the stack on top of the spell that caused it to trigger. The ability will resolve first. If it's Pyromancer Ascension's second ability that triggered, the copy it creates will also resolve before the original spell. The copy is created even if the original spell has been countered."},{"date":"2009-10-01","text":"If Pyromancer Ascension's first ability triggers, you'll put a quest counter on it even if the card in your graveyard leaves your graveyard by the time the ability resolves."},{"date":"2009-10-01","text":"If you cast an instant or sorcery spell from your graveyard (due to an ability such as retrace, for example), Pyromancer Ascension's first ability won't trigger unless another card with the same name is in your graveyard."},{"date":"2009-10-01","text":"The second ability triggers only if Pyromancer Ascension already has two quest counters on it at the time you cast an instant or sorcery spell. This means a spell can't both cause the second counter to be put on Pyromancer Ascension and become copied."},{"date":"2009-10-01","text":"If you copy a spell, the copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them."},{"date":"2009-10-01","text":"You may copy an instant or sorcery spell that has no targets."},{"date":"2009-10-01","text":"If the original spell was kicked, the copy is kicked too. Other decisions made for the original spell, such as the value of X or the mode, are also copied."},{"date":"2011-09-22","text":"Both of these abilities trigger when a spell is cast, not when it resolves. This means that their effects will occur even if the Ascension is destroyed in response to such a spell being cast."}],"imageName":"pyromancer ascension"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Blue"],"multiverseid":195635,"name":"Quest for Ancient Secrets","cmc":1,"rarity":"Uncommon","artist":"Mike Bierek","manaCost":"{U}","text":"Whenever a card is put into your graveyard from anywhere, you may put a quest counter on Quest for Ancient Secrets.\n\nRemove five quest counters from Quest for Ancient Secrets and sacrifice it: Target player shuffles his or her graveyard into his or her library.","number":"59","imageName":"quest for ancient secrets"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":197407,"name":"Quest for Pure Flame","cmc":1,"rarity":"Uncommon","artist":"Cyril Van Der Haegen","manaCost":"{R}","text":"Whenever a source you control deals damage to an opponent, you may put a quest counter on Quest for Pure Flame.\n\nRemove four quest counters from Quest for Pure Flame and sacrifice it: If any source you control would deal damage to a creature or player this turn, it deals double that damage to that creature or player instead.","number":"144","rulings":[{"date":"2009-10-01","text":"Both of Quest for Pure Flame's abilities interact with any kind of damage, not just combat damage."},{"date":"2009-10-01","text":"The source of combat damage is the creature that dealt it."},{"date":"2009-10-01","text":"If a spell causes damage to be dealt, that spell will always identify the source of the damage. In most cases, the source is the spell itself. For example, Lightning Bolt says \"Lightning Bolt deals 3 damage to target creature or player.\""},{"date":"2009-10-01","text":"If an ability causes damage to be dealt, that ability will always identify the source of the damage. The ability itself is never the source. However, the source of the ability is often the source of the damage. For example, Prodigal Pyromancer's ability says \"Prodigal Pyromancer deals 1 damage to target creature or player.\""},{"date":"2009-10-01","text":"If the source of the damage is a permanent, Quest for Pure Flame checks whether you control that permanent at the time that damage is dealt. If the permanent has left the battlefield by then, its last known information is used. If the source of the damage is a spell, whether you control it is obvious. If the source of the damage is a card in some other zone (such as a cycled Jund Sojourners), Quest for Pure Flame checks whether you're the card's owner, rather than whether you're its controller."},{"date":"2009-10-01","text":"When the first ability resolves, you may put just one quest counter on Quest for Pure Flame. It doesn't matter how much damage the source dealt."},{"date":"2009-10-01","text":"The first ability will trigger multiple times if multiple sources you control deal damage to a single opponent at once, or if a single source you control deals damage to multiple opponents at once."},{"date":"2009-10-01","text":"The second ability affects all sources you control that would deal damage to a creature or player at any point in the rest of the turn."},{"date":"2009-10-01","text":"If multiple effects modify how damage will be dealt, the player who would be dealt damage or the controller of the creature that would be dealt damage chooses the order to apply the effects. For example, Mending Hands says, \"Prevent the next 4 damage that would be dealt to target creature or player this turn.\" Suppose a spell controlled by a player who has activated Quest for Pure Fire's second ability would deal 5 damage to a player who has cast Mending Hands targeting him or herself. The player who would be dealt damage can either (a) prevent 4 damage first and then let Quest for Pure Fire's effect double the remaining 1 damage, taking 2 damage, or (b) double the damage to 10 and then prevent 4 damage, taking 6 damage."},{"date":"2009-10-01","text":"Combat damage that a source you control would deal to a planeswalker is not doubled. However, if a source you control would deal noncombat damage to that player, and that player chooses to apply Quest for Pure Fire's replacement effect before applying the planeswalker redirection effect, the damage will be doubled before you choose whether to deal it to a planeswalker that player controls. (If your opponents always apply the planeswalker redirection effect first, Quest for Pure Fire's effect will never double damage that a source you control would deal to a planeswalker.)"},{"date":"2009-10-01","text":"If a spell or ability divides damage among multiple recipients (such as Arrow Volley Trap does), the damage is divided before Quest for Pure Fire's effect doubles it. The same is true for combat damage."},{"date":"2009-10-01","text":"If you activate the second ability of more than one Quest for Pure Flame in the same turn, the effects are cumulative. Two such effects will cause damage from sources you control to be multiplied by four; three such effects will cause damage from sources you control to be multiplied by eight."}],"imageName":"quest for pure flame"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Green"],"multiverseid":195572,"name":"Quest for the Gemblades","cmc":2,"rarity":"Uncommon","artist":"Karl Kopinski","manaCost":"{1}{G}","text":"Whenever a creature you control deals combat damage to a creature, you may put a quest counter on Quest for the Gemblades.\n\nRemove a quest counter from Quest for the Gemblades and sacrifice it: Put four +1/+1 counters on target creature.","number":"177","rulings":[{"date":"2009-10-01","text":"When the first ability resolves, you may put just one quest counter on Quest for the Gemblades. It doesn't matter how much damage the source dealt."},{"date":"2009-10-01","text":"The first ability will trigger multiple times if a creature you control deals combat damage to multiple creatures, and/or if multiple creatures you control each deal combat damage to a single creature."},{"date":"2009-10-01","text":"If there are no counters on Quest for the Gemblades yet, and simultaneously a creature you control deals combat damage to a creature and a creature you control is dealt lethal combat damage, the first ability will trigger too late for you to be able to activate the second ability and save your creature."}],"imageName":"quest for the gemblades"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":180448,"name":"Quest for the Gravelord","cmc":1,"rarity":"Uncommon","artist":"Chris Rahn","manaCost":"{B}","text":"Whenever a creature dies, you may put a quest counter on Quest for the Gravelord.\n\nRemove three quest counters from Quest for the Gravelord and sacrifice it: Put a 5/5 black Zombie Giant creature token onto the battlefield.","number":"108","rulings":[{"date":"2009-10-01","text":"Quest for the Gravelord's first ability triggers regardless of who controlled the creature and whose graveyard it was put into."}],"imageName":"quest for the gravelord"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":197406,"name":"Quest for the Holy Relic","cmc":1,"rarity":"Uncommon","artist":"Greg Staples","manaCost":"{W}","text":"Whenever you cast a creature spell, you may put a quest counter on Quest for the Holy Relic.\n\nRemove five quest counters from Quest for the Holy Relic and sacrifice it: Search your library for an Equipment card, put it onto the battlefield, and attach it to a creature you control. Then shuffle your library.","number":"33","rulings":[{"date":"2009-10-01","text":"If you cast a creature spell, Quest for the Holy Relic's triggered ability triggers and goes on the stack on top of it. The triggered ability will resolve before the spell does."},{"date":"2009-10-01","text":"The activated ability doesn't target the creature the Equipment will be attached to. It may be attached to a creature with shroud, for example. You don't choose which creature it will be attached to until you actually attach it. Once you choose which creature to attach it to, it's too late for players to respond."},{"date":"2009-10-01","text":"You may activate Quest for the Holy Relic's activated ability even if you control no creatures, or you control no creatures that can be equipped. In that case, you'll simply put the Equipment card you find onto the battlefield without attaching it to anything."}],"imageName":"quest for the holy relic"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":192222,"name":"Rampaging Baloths","subtypes":["Beast"],"cmc":6,"rarity":"Mythic Rare","artist":"Steve Prescott","power":"6","toughness":"6","manaCost":"{4}{G}{G}","text":"Trample\n\nLandfall — Whenever a land enters the battlefield under your control, you may put a 4/4 green Beast creature token onto the battlefield.","flavor":"\"When the land is angry, so are they.\"\n\n—Nissa Revane","number":"178","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"rampaging baloths"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Black"],"multiverseid":197537,"name":"Ravenous Trap","subtypes":["Trap"],"cmc":4,"rarity":"Uncommon","artist":"Cyril Van Der Haegen","manaCost":"{2}{B}{B}","text":"If an opponent had three or more cards put into his or her graveyard from anywhere this turn, you may pay {0} rather than pay Ravenous Trap's mana cost.\n\nExile all cards from target player's graveyard.","number":"109","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."}],"imageName":"ravenous trap"},{"layout":"normal","type":"Creature - Human Wizard","types":["Creature"],"colors":["Blue"],"multiverseid":180493,"name":"Reckless Scholar","subtypes":["Human","Wizard"],"cmc":3,"rarity":"Common","artist":"Steve Prescott","power":"2","toughness":"1","manaCost":"{2}{U}","text":"{T}: Target player draws a card, then discards a card.","flavor":"\"Any good prospector must sift the gold from the sand.\"","number":"60","imageName":"reckless scholar"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":178115,"name":"Relic Crush","cmc":5,"rarity":"Common","artist":"Steven Belledin","manaCost":"{4}{G}","text":"Destroy target artifact or enchantment and up to one other target artifact or enchantment.","flavor":"There are many ruins, but there used to be many more.","number":"179","imageName":"relic crush"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":195630,"name":"Rite of Replication","cmc":4,"rarity":"Rare","artist":"Matt Cavotta","manaCost":"{2}{U}{U}","text":"Kicker {5} (You may pay an additional {5} as you cast this spell.)\n\nPut a token that's a copy of target creature onto the battlefield. If Rite of Replication was kicked, put five of those tokens onto the battlefield instead.","number":"61","rulings":[{"date":"2009-10-01","text":"If the targeted creature is an illegal target by the time Rite of Replication resolves, the entire spell is countered. You won't get any tokens."},{"date":"2009-10-01","text":"As the token or tokens are created, they check the printed values of the creature they're copying -- or, if that creature is itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield -- as well as any copy effects that have been applied to it. It won't copy counters on the creature, nor will it copy other effects that have changed the creature's power, toughness, types, color, or so on."},{"date":"2009-10-01","text":"The tokens see each other enter the battlefield. If they have a triggered ability that triggers when a creature enters the battlefield, they'll all trigger for one another."}],"imageName":"rite of replication"},{"layout":"normal","type":"Creature - Snake","types":["Creature"],"colors":["Green"],"multiverseid":197405,"name":"River Boa","subtypes":["Snake"],"cmc":2,"rarity":"Uncommon","artist":"Paul Bonner","power":"2","toughness":"1","manaCost":"{1}{G}","text":"Islandwalk\n\n{G}: Regenerate River Boa.","flavor":"\"Sheath your swords! Cudgels only. I see a new pair of waterproof trek boots slithering away.\"\n\n—Nablus, North Hada trapper","number":"180","imageName":"river boa"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Blue"],"multiverseid":185712,"name":"Roil Elemental","subtypes":["Elemental"],"cmc":6,"rarity":"Rare","artist":"Raymond Swanland","power":"3","toughness":"2","manaCost":"{3}{U}{U}{U}","text":"Flying\n\nLandfall — Whenever a land enters the battlefield under your control, you may gain control of target creature for as long as you control Roil Elemental.","flavor":"A vortex that devours everything—even the souls of the living.","number":"62","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."},{"date":"2009-10-01","text":"If Roil Elemental leaves the battlefield, you no longer control it, so all of its control-change effects end."},{"date":"2009-10-01","text":"If Roil Elemental ceases to be under your control before its ability resolves, you won't gain control of the targeted creature at all."},{"date":"2009-10-01","text":"You may target a creature you already control with Roil Elemental's ability. This will usually have no visible effect, but it will overwrite any previous control-change effects. For example, if you gain control of Roil Elemental until the end of the turn (with Mark of Mutiny, perhaps), then its landfall ability triggers and you target Roil Elemental itself, you'll gain control of it indefinitely (since its control-change effect will last for as long as you control it)."}],"imageName":"roil elemental"},{"layout":"normal","type":"Creature - Minotaur Warrior","types":["Creature"],"colors":["Red"],"multiverseid":189624,"name":"Ruinous Minotaur","subtypes":["Minotaur","Warrior"],"cmc":3,"rarity":"Common","artist":"Raymond Swanland","power":"5","toughness":"2","manaCost":"{1}{R}{R}","text":"Whenever Ruinous Minotaur deals damage to an opponent, sacrifice a land.","flavor":"Not every intelligent being is interested in treasure and lost knowledge . . . or even the basics of speech.","number":"145","rulings":[{"date":"2009-10-01","text":"Ruinous Minotaur's ability triggers when it deals any kind of damage to an opponent, not just combat damage."},{"date":"2009-10-01","text":"You sacrifice a land, not the opponent who was dealt damage."}],"imageName":"ruinous minotaur"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Red"],"multiverseid":197536,"name":"Runeflare Trap","subtypes":["Trap"],"cmc":6,"rarity":"Uncommon","artist":"Franz Vohwinkel","manaCost":"{4}{R}{R}","text":"If an opponent drew three or more cards this turn, you may pay {R} rather than pay Runeflare Trap's mana cost.\n\nRuneflare Trap deals damage to target player equal to the number of cards in that player's hand.","number":"146","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"The player you target with Runeflare Trap doesn't have to be the opponent that drew three or more cards this turn."}],"imageName":"runeflare trap"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Black"],"multiverseid":195632,"name":"Sadistic Sacrament","cmc":3,"rarity":"Rare","artist":"Dan Scott","manaCost":"{B}{B}{B}","text":"Kicker {7} (You may pay an additional {7} as you cast this spell.)\n\nSearch target player's library for up to three cards, exile them, then that player shuffles his or her library. If Sadistic Sacrament was kicked, instead search that player's library for up to fifteen cards, exile them, then that player shuffles his or her library.","number":"110","imageName":"sadistic sacrament"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Green"],"multiverseid":186316,"name":"Savage Silhouette","subtypes":["Aura"],"cmc":3,"rarity":"Common","artist":"Dave Kendall","manaCost":"{2}{G}","text":"Enchant creature\n\nEnchanted creature gets +2/+2 and has \"{1}{G}: Regenerate this creature.\"","flavor":"Some elves believe that their survival instincts are born of many cycles of reincarnation.","number":"181","rulings":[{"date":"2009-10-01","text":"The controller of the enchanted creature may activate the regeneration ability, not the controller of Savage Silhouette."}],"imageName":"savage silhouette"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190393,"name":"Scalding Tarn","rarity":"Rare","artist":"Philip Straub","text":"{T}, Pay 1 life, Sacrifice Scalding Tarn: Search your library for an Island or Mountain card and put it onto the battlefield. Then shuffle your library.","number":"223","imageName":"scalding tarn"},{"layout":"normal","type":"Creature - Insect","types":["Creature"],"colors":["Green"],"multiverseid":180455,"name":"Scute Mob","subtypes":["Insect"],"cmc":1,"rarity":"Rare","artist":"Zoltan Boros & Gabor Szikszai","power":"1","toughness":"1","manaCost":"{G}","text":"At the beginning of your upkeep, if you control five or more lands, put four +1/+1 counters on Scute Mob.","flavor":"\"Survival rule 781: There are always more scute bugs.\"\n\n—Zurdi, goblin shortcutter","number":"182","rulings":[{"date":"2009-10-01","text":"Scute Mob's ability has an \"intervening 'if' clause.\" That means (1) the ability won't trigger at all unless you control five or more lands as your upkeep starts, and (2) the ability will do nothing if you control fewer than five lands by the time it resolves."}],"imageName":"scute mob"},{"layout":"normal","type":"Creature - Cat","types":["Creature"],"colors":["Green"],"multiverseid":178113,"name":"Scythe Tiger","subtypes":["Cat"],"cmc":1,"rarity":"Common","artist":"Michael Komarck","power":"3","toughness":"2","manaCost":"{G}","text":"Shroud (This creature can't be the target of spells or abilities.)\n\nWhen Scythe Tiger enters the battlefield, sacrifice it unless you sacrifice a land.","flavor":"Instead of adapting to its environment, it adapts its environment to itself.","number":"183","imageName":"scythe tiger"},{"layout":"normal","type":"Creature - Merfolk Wizard Ally","types":["Creature"],"colors":["Blue"],"multiverseid":195629,"name":"Sea Gate Loremaster","subtypes":["Merfolk","Wizard","Ally"],"cmc":5,"rarity":"Rare","artist":"Dave Kendall","power":"1","toughness":"3","manaCost":"{4}{U}","text":"{T}: Draw a card for each Ally you control.","flavor":"\"He's a living library. He remembers everything our band of explorers has seen, and we can use that to our advantage.\"\n\n—Zahr Gada, Halimar expedition leader","number":"63","imageName":"sea gate loremaster"},{"layout":"normal","type":"Creature - Merfolk Wizard Ally","types":["Creature"],"colors":["Blue"],"multiverseid":195631,"name":"Seascape Aerialist","subtypes":["Merfolk","Wizard","Ally"],"cmc":5,"rarity":"Uncommon","artist":"Andrew Robinson","power":"2","toughness":"3","manaCost":"{4}{U}","text":"Whenever Seascape Aerialist or another Ally enters the battlefield under your control, you may have Ally creatures you control gain flying until end of turn.","flavor":"\"The sky is like another sea. It teems with currents, life, and endless possibility.\"","number":"64","rulings":[{"date":"2009-10-01","text":"The ability affects only Allies you control at the time the ability resolves."}],"imageName":"seascape aerialist"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":180134,"name":"Seismic Shudder","cmc":2,"rarity":"Common","artist":"Vincent Proce","manaCost":"{1}{R}","text":"Seismic Shudder deals 1 damage to each creature without flying.","flavor":"\"The land here seems go out of its way to kill you.\"\n\n—Chandra Nalaar","number":"147","imageName":"seismic shudder"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":189626,"name":"Sejiri Refuge","rarity":"Uncommon","artist":"Ryan Pancoast","text":"Sejiri Refuge enters the battlefield tapped.\n\nWhen Sejiri Refuge enters the battlefield, you gain 1 life.\n\n{T}: Add {W} or {U} to your mana pool.","number":"224","imageName":"sejiri refuge"},{"layout":"normal","type":"Creature - Giant Warrior","types":["Creature"],"colors":["Red"],"multiverseid":180505,"name":"Shatterskull Giant","subtypes":["Giant","Warrior"],"cmc":4,"rarity":"Common","artist":"Kekai Kotaki","power":"4","toughness":"3","manaCost":"{2}{R}{R}","flavor":"\"Now I know why they call it Shatterskull Pass. Rocks fell all night like hammers smashing an anvil. It's no wonder the giants are angry all the time.\"\n\n—Mitra, Bala Ged missionary","number":"148","imageName":"shatterskull giant"},{"layout":"normal","type":"Creature - Angel","types":["Creature"],"colors":["White"],"multiverseid":193399,"name":"Shepherd of the Lost","subtypes":["Angel"],"cmc":5,"rarity":"Uncommon","artist":"Kekai Kotaki","power":"3","toughness":"3","manaCost":"{4}{W}","text":"Flying, first strike, vigilance","flavor":"\"Should you fall in the wilds, lift your voice to the Sky Realm. The one who answers will be your salvation.\"\n\n—Emeria's Creed","number":"34","imageName":"shepherd of the lost"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["White"],"multiverseid":178119,"name":"Shieldmate's Blessing","cmc":1,"rarity":"Common","artist":"Mike Bierek","manaCost":"{W}","text":"Prevent the next 3 damage that would be dealt to target creature or player this turn.","flavor":"\"Even land dwellers may call for Emeria's grace in times of need.\"\n\n—Emeria's Creed","number":"35","imageName":"shieldmate's blessing"},{"layout":"normal","type":"Creature - Serpent","types":["Creature"],"colors":["Blue"],"multiverseid":177517,"name":"Shoal Serpent","subtypes":["Serpent"],"cmc":6,"rarity":"Common","artist":"Trevor Claxton","power":"5","toughness":"5","manaCost":"{5}{U}","text":"Defender\n\nLandfall — Whenever a land enters the battlefield under your control, Shoal Serpent loses defender until end of turn.","flavor":"\"It's like a reef that runs aground on ships.\"\n\n—Jaby, Silundi Sea nomad","number":"65","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"shoal serpent"},{"layout":"normal","type":"Creature - Drake","types":["Creature"],"colors":["Blue"],"multiverseid":192211,"name":"Sky Ruin Drake","subtypes":["Drake"],"cmc":5,"rarity":"Common","artist":"Izzy","power":"2","toughness":"5","manaCost":"{4}{U}","text":"Flying","flavor":"\"Hold up your spears. And try not to look like food.\"\n\n—Tarsa, Sea Gate sell-sword","number":"66","imageName":"sky ruin drake"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":178136,"name":"Slaughter Cry","cmc":3,"rarity":"Common","artist":"Matt Cavotta","manaCost":"{2}{R}","text":"Target creature gets +3/+0 and gains first strike until end of turn. (It deals combat damage before creatures without first strike.)","flavor":"\"Since when did ‘AIIIEEEE!' become a negotiation tactic?\"\n\n—Nikou, Joraga bard","number":"149","rulings":[{"date":"2009-10-01","text":"If a creature doesn't have first strike, granting it first strike after combat damage has been dealt in the first combat damage step won't prevent it from dealing combat damage. It will still assign and deal its combat damage in the second combat damage step."}],"imageName":"slaughter cry"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":177541,"name":"Soaring Seacliff","rarity":"Common","artist":"Izzy","text":"Soaring Seacliff enters the battlefield tapped.\n\nWhen Soaring Seacliff enters the battlefield, target creature gains flying until end of turn.\n\n{T}: Add {U} to your mana pool.","number":"225","imageName":"soaring seacliff"},{"layout":"normal","type":"Planeswalker - Sorin","types":["Planeswalker"],"colors":["Black"],"multiverseid":195403,"name":"Sorin Markov","subtypes":["Sorin"],"cmc":6,"rarity":"Mythic Rare","artist":"Michael Komarck","loyalty":4,"manaCost":"{3}{B}{B}{B}","text":"+2: Sorin Markov deals 2 damage to target creature or player and you gain 2 life.\n\n-3: Target opponent's life total becomes 10.\n\n-7: You control target player during that player's next turn.","number":"111","rulings":[{"date":"2009-10-01","text":"If the targeted creature or player is an illegal target by the time Sorin's first ability resolves, the entire ability is countered. You won't gain life."},{"date":"2009-10-01","text":"For a player's life total to become 10, what actually happens is that the player gains or loses the appropriate amount of life. For example, if the targeted opponent's life total is 4 when this ability resolves, it will cause that player to gain 6 life; alternately, if the targeted player's life total is 17 when this ability resolves, it will cause that player to lose 7 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."},{"date":"2009-10-01","text":"Sorin's third ability allows you to control another player. This effect applies to the next turn that the affected player actually takes."},{"date":"2009-10-01","text":"The player who is being controlled is still the active player."},{"date":"2009-10-01","text":"While controlling another player, you also continue to make your own choices and decisions."},{"date":"2009-10-01","text":"While controlling another player, you make all choices and decisions that player is allowed to make or is told to make during that turn. For example:\r\n-- You choose which lands the other player plays.\r\n-- You choose which spells the other player casts, and make all decisions as those spells are cast and as they resolve. For example, you choose the value of X for that player's Earthquake, the target for that player's Lightning Bolt, what mana that player spends to cast Day of Judgment, and what card that player gets with Diabolic Tutor.\r\n-- You choose which activated abilities the other player activates, and make all decisions as those abilities are activated and as they resolve. For example, you can have your opponent sacrifice his or her creatures to his or her Vampire Aristocrat or have your opponent's Caller of Gales give one of your creatures flying.\r\n-- You make all decisions for the other player's triggered abilities, including what they target and any decisions made when they resolve.\r\n-- You choose which creatures controlled by the other player attack, who or what they attack, and how they assign their combat damage.\r\n-- You make any choices and decisions that player would make for any other reason. For example, you could cast Fact or Fiction, choose that player to divide the revealed cards into piles, and thus divide those cards into piles yourself."},{"date":"2009-10-01","text":"You can't make the affected player concede. That player may choose to concede at any time, even while you're controlling his or her turn."},{"date":"2009-10-01","text":"You can't make any illegal decisions or illegal choices -- you can't do anything that player couldn't do. You can't make choices or decisions for that player that aren't called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the affected player would normally make (such as Master Warcraft does), that effect takes precedence. (In other words, if the affected player wouldn't make a decision, you wouldn't make that decision on his or her behalf.) You also can't make any choices or decisions for the player that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."},{"date":"2009-10-01","text":"You can use only the affected player's resources (cards, mana, and so on) to pay costs for that player; you can't use your own. Similarly, you can use the affected player's resources only to pay that player's costs; you can't spend them on your costs."},{"date":"2009-10-01","text":"You only control the player. You don't control any of the other player's permanents, spells, or abilities."},{"date":"2009-10-01","text":"If the player affected by Sorin's third ability skips his or her next turn, the ability will wait. You'll control the next turn the affected player actually takes."},{"date":"2009-10-01","text":"Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."},{"date":"2009-10-01","text":"You could gain control of yourself using Sorin's third ability, but unless you do so to overwrite someone else's player-controlling effect, this doesn't do anything."},{"date":"2010-06-15","text":"In a Two-Headed Giant game, Sorin's second ability causes the targeted opponent's team's life-total to become 10. Only the targeted player is actually considered to have actually gained or lost life."},{"date":"2012-07-01","text":"While controlling another player, you can see all cards that player can see. This includes cards in that player's hand, face-down cards that player controls, his or her sideboard, and any cards in his or her library that he or she looks at."}],"imageName":"sorin markov"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Black"],"multiverseid":177586,"name":"Soul Stair Expedition","cmc":1,"rarity":"Common","artist":"Anthony Francisco","manaCost":"{B}","text":"Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Soul Stair Expedition.\n\nRemove three quest counters from Soul Stair Expedition and sacrifice it: Return up to two target creature cards from your graveyard to your hand.","number":"112","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"soul stair expedition"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":178144,"name":"Spell Pierce","cmc":1,"rarity":"Common","artist":"Vance Kovacs","manaCost":"{U}","text":"Counter target noncreature spell unless its controller pays {2}.","flavor":"\"There's a hole in your plan.\"\n\n—Noyan Dar, Tazeem lullmage","number":"67","imageName":"spell pierce"},{"layout":"normal","type":"Creature - Sphinx","types":["Creature"],"colors":["Blue"],"multiverseid":185709,"name":"Sphinx of Jwar Isle","subtypes":["Sphinx"],"cmc":6,"rarity":"Rare","artist":"Justin Sweet","power":"5","toughness":"5","manaCost":"{4}{U}{U}","text":"Flying, shroud\n\nYou may look at the top card of your library. (You may do this at any time.)","flavor":"\"Even if the sphinxes do know the location of every relic, getting one to talk is harder than just searching yourself.\"\n\n—Sachir, Akoum Expeditionary House","number":"68","rulings":[{"date":"2009-10-01","text":"Essentially, Sphinx of Jwar Isle lets you play with the top card of your library revealed only to you. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand. You may look at the top card of your library whenever you want, even if you don't have priority. This action doesn't use the stack."},{"date":"2009-10-01","text":"If the top card of your library changes during the process of casting a spell or activating an ability, you can't look at the new top card until the process of casting the spell or activating the ability ends (all targets are chosen, all costs are paid, and so on)."}],"imageName":"sphinx of jwar isle"},{"layout":"normal","type":"Creature - Sphinx","types":["Creature"],"colors":["Blue"],"multiverseid":185751,"name":"Sphinx of Lost Truths","subtypes":["Sphinx"],"cmc":5,"rarity":"Rare","artist":"Shelly Wan","power":"3","toughness":"5","manaCost":"{3}{U}{U}","text":"Kicker {1}{U} (You may pay an additional {1}{U} as you cast this spell.)\n\nFlying\n\nWhen Sphinx of Lost Truths enters the battlefield, draw three cards. Then if it wasn't kicked, discard three cards.","number":"69","rulings":[{"date":"2009-10-01","text":"Sphinx of Lost Truths behaves differently than other cards with kicker. Its enters-the-battlefield ability always triggers, and it checks whether it *wasn't* kicked. The two possible results are as follows:\r\n-- When an unkicked Sphinx of Lost Truths enters the battlefield, you draw three cards, then discard three cards.\r\n-- When a kicked Sphinx of Lost Truths enters the battlefield, you draw three cards."}],"imageName":"sphinx of lost truths"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":178134,"name":"Spidersilk Net","subtypes":["Equipment"],"cmc":0,"rarity":"Common","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{0}","text":"Equipped creature gets +0/+2 and has reach. (It can block creatures with flying.)\n\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)","number":"206","imageName":"spidersilk net"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Red"],"multiverseid":180495,"name":"Spire Barrage","cmc":5,"rarity":"Common","artist":"Ryan Pancoast","manaCost":"{4}{R}","text":"Spire Barrage deals damage to target creature or player equal to the number of Mountains you control.","flavor":"Goblin lessons include the 2,071 tips for survival. Frek only remembered 2,070.","number":"150","imageName":"spire barrage"},{"layout":"normal","type":"Enchantment - Aura","types":["Enchantment"],"colors":["Blue"],"multiverseid":190405,"name":"Spreading Seas","subtypes":["Aura"],"cmc":2,"rarity":"Common","artist":"Jung Park","manaCost":"{1}{U}","text":"Enchant land\n\nWhen Spreading Seas enters the battlefield, draw a card.\n\nEnchanted land is an Island.","flavor":"Most inhabitants of Zendikar have given up on the idea of an accurate map.","number":"70","rulings":[{"date":"2009-10-01","text":"The enchanted land loses its existing land types and any abilities printed on it. It now has the land type Island and has the ability to tap to add {U} to its controller's mana pool. Spreading Seas doesn't change the enchanted land's name or whether it's legendary, basic, or snow."}],"imageName":"spreading seas"},{"layout":"normal","type":"Creature - Cat","types":["Creature"],"colors":["White"],"multiverseid":171012,"name":"Steppe Lynx","subtypes":["Cat"],"cmc":1,"rarity":"Common","artist":"Nic Klein","power":"0","toughness":"1","manaCost":"{W}","text":"Landfall — Whenever a land enters the battlefield under your control, Steppe Lynx gets +2/+2 until end of turn.","flavor":"Nothing quickens the predator's blood like the unfamiliar scents of new hunting grounds and the mewling cries of new prey.","number":"36","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"steppe lynx"},{"layout":"normal","type":"Artifact Creature - Cat Ally","types":["Artifact","Creature"],"colors":[],"multiverseid":190397,"name":"Stonework Puma","subtypes":["Cat","Ally"],"cmc":3,"rarity":"Common","artist":"Christopher Moeller","power":"2","toughness":"2","manaCost":"{3}","flavor":"\"We suffer uneasy ground, unstable alliances, and unpredictable magic. Something you can truly trust is worth more than a chest of gold.\"\n\n—Nikou, Joraga bard","number":"207","imageName":"stonework puma"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":191360,"name":"Summoner's Bane","cmc":4,"rarity":"Uncommon","artist":"Cyril Van Der Haegen","manaCost":"{2}{U}{U}","text":"Counter target creature spell. Put a 2/2 blue Illusion creature token onto the battlefield.","flavor":"\"I don't need to have the perfect plan. My foe just has to have an imperfect one.\"\n\n—Jace Beleren","number":"71","rulings":[{"date":"2009-10-01","text":"If the targeted spell is an illegal target by the time Summoner's Bane resolves, the entire spell is countered. You won't get a creature token."},{"date":"2009-10-01","text":"You get the token creature, not the controller of the creature spell."}],"imageName":"summoner's bane"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Green"],"multiverseid":197527,"name":"Summoning Trap","subtypes":["Trap"],"cmc":6,"rarity":"Rare","artist":"Kieran Yanner","manaCost":"{4}{G}{G}","text":"If a creature spell you cast this turn was countered by a spell or ability an opponent controlled, you may pay {0} rather than pay Summoning Trap's mana cost.\n\nLook at the top seven cards of your library. You may put a creature card from among them onto the battlefield. Put the rest on the bottom of your library in any order.","number":"184","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"If there are seven or fewer cards in your library, you'll look at all of them."}],"imageName":"summoning trap"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["White"],"multiverseid":177551,"name":"Sunspring Expedition","cmc":1,"rarity":"Common","artist":"Chris J. Anderson","manaCost":"{W}","text":"Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Sunspring Expedition.\n\nRemove three quest counters from Sunspring Expedition and sacrifice it: You gain 8 life.","number":"37","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"sunspring expedition"},{"layout":"normal","type":"Creature - Surrakar","types":["Creature"],"colors":["Black"],"multiverseid":180465,"name":"Surrakar Marauder","subtypes":["Surrakar"],"cmc":2,"rarity":"Common","artist":"Kev Walker","power":"2","toughness":"1","manaCost":"{1}{B}","text":"Landfall — Whenever a land enters the battlefield under your control, Surrakar Marauder gains intimidate until end of turn. (It can't be blocked except by artifact creatures and/or creatures that share a color with it.)","number":"113","rulings":[{"date":"2009-10-01","text":"Intimidate looks at the current colors of a creature that has it. Normally, if Surrakar Marauder has intimidate, it can't be blocked except by artifact creatures and/or black creatures. If it's turned white, then it can't be blocked except by artifact creatures and/or white creatures."},{"date":"2009-10-01","text":"If an attacking creature has intimidate, what colors it is matters only as the defending player declares blockers. Once it's blocked, changing its colors won't change that."},{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"surrakar marauder"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":195172,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"John Avon","text":"B","number":"238","variations":[195159,195157,201976,201977,201975,201978,195194],"imageName":"swamp1"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":201977,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"John Avon","text":"B","number":"238a","variations":[195159,195157,201976,201975,201978,195172,195194],"imageName":"swamp1a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":195194,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Jung Park","text":"B","number":"239","variations":[195159,195157,201976,201977,201975,201978,195172],"imageName":"swamp2"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":201978,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Jung Park","text":"B","number":"239a","variations":[195159,195157,201976,201977,201975,195172,195194],"imageName":"swamp2a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":201976,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"B","number":"240","variations":[195159,195157,201977,201975,201978,195172,195194],"imageName":"swamp3"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":195159,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Véronique Meignaud","text":"B","number":"240a","variations":[195157,201976,201977,201975,201978,195172,195194],"imageName":"swamp3a"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":201975,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Vincent Proce","text":"B","number":"241","variations":[195159,195157,201976,201977,201978,195172,195194],"imageName":"swamp4"},{"layout":"normal","supertypes":["Basic"],"type":"Basic Land - Swamp","types":["Land"],"colors":[],"multiverseid":195157,"name":"Swamp","subtypes":["Swamp"],"rarity":"Basic Land","artist":"Vincent Proce","text":"B","number":"241a","variations":[195159,201976,201977,201975,201978,195172,195194],"imageName":"swamp4a"},{"layout":"normal","type":"Creature - Elf Archer Ally","types":["Creature"],"colors":["Green"],"multiverseid":180457,"name":"Tajuru Archer","subtypes":["Elf","Archer","Ally"],"cmc":3,"rarity":"Uncommon","artist":"Chris Rahn","power":"1","toughness":"2","manaCost":"{2}{G}","text":"Whenever Tajuru Archer or another Ally enters the battlefield under your control, you may have Tajuru Archer deal damage to target creature with flying equal to the number of Allies you control.","number":"185","rulings":[{"date":"2009-10-01","text":"The ability counts the number of allies you control as it resolves."},{"date":"2009-10-01","text":"You target a creature when the ability triggers. You decide whether to have Tajuru Archer deal damage to that creature as the ability resolves."}],"imageName":"tajuru archer"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":191355,"name":"Tanglesap","cmc":2,"rarity":"Common","artist":"Trevor Claxton","manaCost":"{1}{G}","text":"Prevent all combat damage that would be dealt this turn by creatures without trample.","flavor":"\"The blood of the forest is beholden to no one.\"\n\n—Nissa Revane","number":"186","rulings":[{"date":"2009-10-01","text":"Tanglesap prevents combat damage that would be dealt by all creatures without trample, regardless of whether they're attacking or blocking."},{"date":"2009-10-01","text":"Creatures are checked to see whether they have trample at the time they'd deal combat damage, not at the time Tanglesap resolves."}],"imageName":"tanglesap"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":177549,"name":"Teetering Peaks","rarity":"Common","artist":"Fred Fields","text":"Teetering Peaks enters the battlefield tapped.\n\nWhen Teetering Peaks enters the battlefield, target creature gets +2/+0 until end of turn.\n\n{T}: Add {R} to your mana pool.","number":"226","imageName":"teetering peaks"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["Blue"],"multiverseid":180482,"name":"Tempest Owl","subtypes":["Bird"],"cmc":2,"rarity":"Common","artist":"Dan Scott","power":"1","toughness":"2","manaCost":"{1}{U}","text":"Kicker {4}{U} (You may pay an additional {4}{U} as you cast this spell.)\n\nFlying\n\nWhen Tempest Owl enters the battlefield, if it was kicked, tap up to three target permanents.","number":"72","rulings":[{"date":"2009-10-01","text":"If Tempest Owl was kicked, you may target zero, one, two, or three permanents. They don't have to be untapped."}],"imageName":"tempest owl"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":186321,"name":"Terra Stomper","subtypes":["Beast"],"cmc":6,"rarity":"Rare","artist":"Goran Josic","power":"8","toughness":"8","manaCost":"{3}{G}{G}{G}","text":"Terra Stomper can't be countered.\n\nTrample","flavor":"Sometimes violent earthquakes, hurtling boulders, and unseasonable dust storms are wrongly attributed to the Roil.","number":"187","rulings":[{"date":"2009-10-01","text":"Terra Stomper can be targeted by spells that try to counter it (such as Cancel). Those spells will resolve, but the part of their effect that would counter Terra Stomper won't do anything. Any other effects those spells have will work as normal."}],"imageName":"terra stomper"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":170971,"name":"Territorial Baloth","subtypes":["Beast"],"cmc":5,"rarity":"Common","artist":"Jesper Ejsing","power":"4","toughness":"4","manaCost":"{4}{G}","text":"Landfall — Whenever a land enters the battlefield under your control, Territorial Baloth gets +2/+2 until end of turn.","flavor":"Its territory is defined by wherever it is at the moment.","number":"188","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"territorial baloth"},{"layout":"normal","type":"Creature - Beast","types":["Creature"],"colors":["Green"],"multiverseid":180458,"name":"Timbermaw Larva","subtypes":["Beast"],"cmc":4,"rarity":"Common","artist":"Matt Cavotta","power":"2","toughness":"2","manaCost":"{3}{G}","text":"Whenever Timbermaw Larva attacks, it gets +1/+1 until end of turn for each Forest you control.","flavor":"\"You can't trust your eyes. A tree might look healthy, but its insides tell a different tale.\"\n\n—Zahr Gada, Halimar expedition leader","number":"189","imageName":"timbermaw larva"},{"layout":"normal","type":"Creature - Goblin Shaman","types":["Creature"],"colors":["Red"],"multiverseid":180423,"name":"Torch Slinger","subtypes":["Goblin","Shaman"],"cmc":3,"rarity":"Common","artist":"Andrew Robinson","power":"2","toughness":"2","manaCost":"{2}{R}","text":"Kicker {1}{R} (You may pay an additional {1}{R} as you cast this spell.)\n\nWhen Torch Slinger enters the battlefield, if it was kicked, it deals 2 damage to target creature.","flavor":"Once thrown, twice burned.","number":"151","imageName":"torch slinger"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":190410,"name":"Trailblazer's Boots","subtypes":["Equipment"],"cmc":2,"rarity":"Uncommon","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{2}","text":"Equipped creature has nonbasic landwalk. (It's unblockable as long as defending player controls a nonbasic land.)\n\nEquip {2}","flavor":"It's much easier to list the places they haven't been.","number":"208","imageName":"trailblazer's boots"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["Blue"],"multiverseid":192212,"name":"Trapfinder's Trick","cmc":2,"rarity":"Common","artist":"Philip Straub","manaCost":"{1}{U}","text":"Target player reveals his or her hand and discards all Trap cards.","flavor":"\"At some point, every trapfinder will lose a hunk of flesh. It's just a question of how much—and whether it'll grow back.\"\n\n—Arhana, Kazandu trapfinder","number":"73","imageName":"trapfinder's trick"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Blue"],"multiverseid":192223,"name":"Trapmaker's Snare","cmc":2,"rarity":"Uncommon","artist":"Daarken","manaCost":"{1}{U}","text":"Search your library for a Trap card, reveal it, and put it into your hand. Then shuffle your library.","flavor":"\"Trapmaking is an art. The trap is a corporeal riddle, a battle of wits between its creator and whatever it lures inside.\"","number":"74","imageName":"trapmaker's snare"},{"layout":"normal","type":"Artifact - Equipment","types":["Artifact"],"colors":[],"multiverseid":193396,"name":"Trusty Machete","subtypes":["Equipment"],"cmc":1,"rarity":"Uncommon","artist":"Raymond Swanland","manaCost":"{1}","text":"Equipped creature gets +2/+1.\n\nEquip {2}","flavor":"\"Until this expedition is done, that blade is your guardian, your liberator, and your best friend all rolled into one.\"\n\n—Yon Basrel, Oran-Rief survivalist","number":"209","imageName":"trusty machete"},{"layout":"normal","type":"Creature - Goblin Warrior Ally","types":["Creature"],"colors":["Red"],"multiverseid":192229,"name":"Tuktuk Grunts","subtypes":["Goblin","Warrior","Ally"],"cmc":5,"rarity":"Common","artist":"Mike Bierek","power":"2","toughness":"2","manaCost":"{4}{R}","text":"Haste\n\nWhenever Tuktuk Grunts or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Tuktuk Grunts.","flavor":"Goblins are more aggressive with a crowd to cheer them on.","number":"152","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"tuktuk grunts"},{"layout":"normal","type":"Creature - Basilisk","types":["Creature"],"colors":["Green"],"multiverseid":178140,"name":"Turntimber Basilisk","subtypes":["Basilisk"],"cmc":3,"rarity":"Uncommon","artist":"Goran Josic","power":"2","toughness":"1","manaCost":"{1}{G}{G}","text":"Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\n\nLandfall — Whenever a land enters the battlefield under your control, you may have target creature block Turntimber Basilisk this turn if able.","number":"190","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."},{"date":"2009-10-01","text":"You decide whether to have the targeted creature block Turntimber Basilisk this turn if able at the time the landfall ability resolves, not at the time Turntimber Basilisk attacks."},{"date":"2009-10-01","text":"Deciding to have the targeted creature block doesn't force you to attack with Turntimber Basilisk that turn. If Turntimber Basilisk doesn't attack, the targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."},{"date":"2009-10-01","text":"If you choose to have the targeted creature block but that creature isn't able to block Turntimber Basilisk (for example, because the targeted creature can block only creatures with flying), the requirement to block does nothing. The targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."},{"date":"2009-10-01","text":"Tapped creatures, creatures that can't block as the result of an effect, creatures with unpaid costs to block (such as those from War Cadence), and creatures that aren't controlled by the defending player are exempt from effects that would require them to block. Such creatures can be targeted by Turntimber Basilisk's landfall ability, but the requirement to block does nothing."},{"date":"2009-10-01","text":"If Turntimber Basilisk's landfall ability triggers multiple times during the same turn, you can have multiple creatures block it that turn if able."}],"imageName":"turntimber basilisk"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":169977,"name":"Turntimber Grove","rarity":"Common","artist":"Rob Alexander","text":"Turntimber Grove enters the battlefield tapped.\n\nWhen Turntimber Grove enters the battlefield, target creature gets +1/+1 until end of turn.\n\n{T}: Add {G} to your mana pool.","number":"227","imageName":"turntimber grove"},{"layout":"normal","type":"Creature - Elf Scout Ally","types":["Creature"],"colors":["Green"],"multiverseid":169971,"name":"Turntimber Ranger","subtypes":["Elf","Scout","Ally"],"cmc":5,"rarity":"Rare","artist":"Wayne Reynolds","power":"2","toughness":"2","manaCost":"{3}{G}{G}","text":"Whenever Turntimber Ranger or another Ally enters the battlefield under your control, you may put a 2/2 green Wolf creature token onto the battlefield. If you do, put a +1/+1 counter on Turntimber Ranger.","flavor":"The lone wolf dies alone.","number":"191","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"turntimber ranger"},{"layout":"normal","type":"Creature - Bird Ally","types":["Creature"],"colors":["Blue"],"multiverseid":180447,"name":"Umara Raptor","subtypes":["Bird","Ally"],"cmc":3,"rarity":"Common","artist":"Sam Wood","power":"1","toughness":"1","manaCost":"{2}{U}","text":"Flying\n\nWhenever Umara Raptor or another Ally enters the battlefield under your control, you may put a +1/+1 counter on Umara Raptor.","flavor":"Messenger, weapon, friend.","number":"75","rulings":[{"date":"2009-10-01","text":"This ability triggers on this creature entering the battlefield, so it will enter the battlefield with its unmodified power and toughness, and then receive a +1/+1 counter a short time later. It does not enter the battlefield with the +1/+1 counter already on it."}],"imageName":"umara raptor"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Red"],"multiverseid":192209,"name":"Unstable Footing","cmc":1,"rarity":"Uncommon","artist":"Nic Klein","manaCost":"{R}","text":"Kicker {3}{R} (You may pay an additional {3}{R} as you cast this spell.)\n\nDamage can't be prevented this turn. If Unstable Footing was kicked, it deals 5 damage to target player.","flavor":"A long way down is shorter than you think.","number":"153","rulings":[{"date":"2009-10-01","text":"Unstable Footing's effect causes damage from all sources to be unpreventable, not just damage from Unstable Footing itself."},{"date":"2009-10-01","text":"If damage can't be prevented, damage prevention shields don't have any effect. If a prevention effect has an additional effect, the additional effect will still work (if possible). Spells that create prevention effects can still be cast, and abilities that create prevention effects can still be activated."},{"date":"2009-10-01","text":"If damage can't be prevented, static abilities that prevent damage (including protection abilities) don't do so. If they have additional effects that don't depend on the amount of damage prevented, those additional effects will still work. Such effects are applied only once per source of damage."},{"date":"2009-10-01","text":"Effects that replace or redirect damage without using the word \"prevent\" are not affected by Unstable Footing."},{"date":"2009-10-01","text":"If a creature is dealt lethal damage, it can still regenerate. If it does, the damage marked on it will be removed from it."},{"date":"2009-10-01","text":"If Unstable Footing is kicked and the targeted player is an illegal target by the time it resolves, the entire spell is countered. Damage can still be prevented."}],"imageName":"unstable footing"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":190400,"name":"Valakut, the Molten Pinnacle","rarity":"Rare","artist":"Kieran Yanner","text":"Valakut, the Molten Pinnacle enters the battlefield tapped.\n\nWhenever a Mountain enters the battlefield under your control, if you control at least five other Mountains, you may have Valakut, the Molten Pinnacle deal 3 damage to target creature or player.\n\n{T}: Add {R} to your mana pool.","number":"228","rulings":[{"date":"2009-10-01","text":"Valakut, the Molten Pinnacle's triggered ability has an \"intervening 'if' clause.\" That means (1) the ability won't trigger at all unless, at the time a Mountain enters the battlefield under your control, you control five or more Mountains other than that new one, and (2) the ability will do nothing if you control fewer than five Mountains other than that new one by the time it resolves."},{"date":"2009-10-01","text":"If a Mountain you control leaves the battlefield between the time Valakut's second ability triggers and the time it resolves, be aware if that was the Mountain that caused Valakut's ability to trigger or not. If it was, Valakut's count isn't affected; if it wasn't, Valakut's count goes down by one."},{"date":"2009-10-01","text":"If multiple Mountains enter the battlefield under your control at the same time, Valakut's second ability could trigger that many times. Each ability takes into consideration the other Mountains that entered the battlefield at the same time as the one that caused it to trigger."},{"date":"2009-10-01","text":"You target a creature or player when the ability triggers. You decide whether to have Valakut deal damage to that creature or player as the ability resolves."}],"imageName":"valakut, the molten pinnacle"},{"layout":"normal","type":"Creature - Vampire Shaman","types":["Creature"],"colors":["Black"],"multiverseid":192232,"name":"Vampire Hexmage","subtypes":["Vampire","Shaman"],"cmc":2,"rarity":"Uncommon","artist":"Eric Deschamps","power":"2","toughness":"1","manaCost":"{B}{B}","text":"First strike\n\nSacrifice Vampire Hexmage: Remove all counters from target permanent.","flavor":"When the blood hunt lost its thrill, she looked for less tangible means of domination.","number":"114","rulings":[{"date":"2009-10-01","text":"Any permanent can be targeted by the second ability, not just one with counters on it."},{"date":"2009-10-01","text":"If all loyalty counters are removed from a planeswalker, that planeswalker is put into its owner's graveyard as a state-based action."}],"imageName":"vampire hexmage"},{"layout":"normal","type":"Creature - Vampire Warrior","types":["Creature"],"colors":["Black"],"multiverseid":192225,"name":"Vampire Lacerator","subtypes":["Vampire","Warrior"],"cmc":1,"rarity":"Common","artist":"Steve Argyle","power":"2","toughness":"2","manaCost":"{B}","text":"At the beginning of your upkeep, you lose 1 life unless an opponent has 10 or less life.","flavor":"The lacerators cut themselves before each hunt. They must feed before the sun rises or bleed to death.","number":"115","rulings":[{"date":"2009-10-01","text":"Whether an opponent has 10 or less life is checked only as the ability resolves."}],"imageName":"vampire lacerator"},{"layout":"normal","type":"Creature - Vampire Shaman","types":["Creature"],"colors":["Black"],"multiverseid":185707,"name":"Vampire Nighthawk","subtypes":["Vampire","Shaman"],"cmc":3,"rarity":"Uncommon","artist":"Jason Chan","power":"2","toughness":"3","manaCost":"{1}{B}{B}","text":"Flying\n\nDeathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\n\nLifelink (Damage dealt by this creature also causes you to gain that much life.)","number":"116","imageName":"vampire nighthawk"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Black"],"multiverseid":178150,"name":"Vampire's Bite","cmc":1,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{B}","text":"Kicker {2}{B} (You may pay an additional {2}{B} as you cast this spell.)\n\nTarget creature gets +3/+0 until end of turn. If Vampire's Bite was kicked, that creature gains lifelink until end of turn. (Damage dealt by the creature also causes its controller to gain that much life.)","number":"117","imageName":"vampire's bite"},{"layout":"normal","type":"Creature - Wurm","types":["Creature"],"colors":["Green"],"multiverseid":180454,"name":"Vastwood Gorger","subtypes":["Wurm"],"cmc":6,"rarity":"Common","artist":"Kieran Yanner","power":"5","toughness":"6","manaCost":"{5}{G}","flavor":"\"I've known true ferocity and power. Those brazen ‘planar-walkers' have no idea what wild really means.\"\n\n—Chadir the Navigator","number":"192","imageName":"vastwood gorger"},{"layout":"normal","type":"Land","types":["Land"],"colors":[],"multiverseid":193400,"name":"Verdant Catacombs","rarity":"Rare","artist":"Vance Kovacs","text":"{T}, Pay 1 life, Sacrifice Verdant Catacombs: Search your library for a Swamp or Forest card and put it onto the battlefield. Then shuffle your library.","number":"229","imageName":"verdant catacombs"},{"layout":"normal","type":"Instant","types":["Instant"],"colors":["Green"],"multiverseid":177571,"name":"Vines of Vastwood","cmc":1,"rarity":"Common","artist":"Christopher Moeller","manaCost":"{G}","text":"Kicker {G} (You may pay an additional {G} as you cast this spell.)\n\nTarget creature can't be the target of spells or abilities your opponents control this turn. If Vines of Vastwood was kicked, that creature gets +4/+4 until end of turn.","number":"193","rulings":[{"date":"2013-04-15","text":"This is not the same as hexproof. If, for example, you target one of your opponent's creatures, your opponents won't be able to target their own creature with spells or abilities."}],"imageName":"vines of vastwood"},{"layout":"normal","type":"Creature - Goblin Berserker","types":["Creature"],"colors":["Red"],"multiverseid":191368,"name":"Warren Instigator","subtypes":["Goblin","Berserker"],"cmc":2,"rarity":"Mythic Rare","artist":"Andrew Robinson","power":"1","toughness":"1","manaCost":"{R}{R}","text":"Double strike\n\nWhenever Warren Instigator deals damage to an opponent, you may put a Goblin creature card from your hand onto the battlefield.","flavor":"\"Danger! Danger! Come out of the safety of your holes!\"","number":"154","rulings":[{"date":"2009-10-01","text":"Warren Instigator's ability triggers when it deals any kind of damage to an opponent, not just combat damage."},{"date":"2009-10-01","text":"If Warren Instigator attacks an opponent and isn't blocked, its double strike ability will cause it to deal combat damage to that opponent twice, once during each combat damage step. Its triggered ability will thus trigger twice: Warren Instigator deals first-strike combat damage, its ability triggers and resolves, it deals regular combat damage, and its ability triggers and resolves again."}],"imageName":"warren instigator"},{"layout":"normal","type":"Creature - Bird","types":["Creature"],"colors":["Blue"],"multiverseid":191353,"name":"Welkin Tern","subtypes":["Bird"],"cmc":2,"rarity":"Common","artist":"Austin Hsu","power":"2","toughness":"1","manaCost":"{1}{U}","text":"Flying\n\nWelkin Tern can block only creatures with flying.","flavor":"\"The sky hedrons are covered with tern nests. It's as though the birds have given up on the land altogether.\"\n\n—Ilori, merfolk falconer","number":"76","imageName":"welkin tern"},{"layout":"normal","type":"Instant - Trap","types":["Instant"],"colors":["Blue"],"multiverseid":197526,"name":"Whiplash Trap","subtypes":["Trap"],"cmc":5,"rarity":"Common","artist":"Zoltan Boros & Gabor Szikszai","manaCost":"{3}{U}{U}","text":"If an opponent had two or more creatures enter the battlefield under his or her control this turn, you may pay {U} rather than pay Whiplash Trap's mana cost.\n\nReturn two target creatures to their owners' hands.","number":"77","rulings":[{"date":"2009-10-01","text":"You may ignore a Trap's alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."},{"date":"2009-10-01","text":"Casting a Trap by paying its alternative cost doesn't change its mana cost or converted mana cost. The only difference is the cost you actually pay."},{"date":"2009-10-01","text":"Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."},{"date":"2009-10-01","text":"You must target two creatures as you cast Whiplash Trap. If you can't (because just one creature is on the battlefield, perhaps), you can't cast the spell."},{"date":"2009-10-01","text":"You can target any two creatures, not just ones that entered the battlefield this turn."}],"imageName":"whiplash trap"},{"layout":"normal","type":"Sorcery","types":["Sorcery"],"colors":["White"],"multiverseid":190418,"name":"Windborne Charge","cmc":4,"rarity":"Uncommon","artist":"Ryan Pancoast","manaCost":"{2}{W}{W}","text":"Two target creatures you control each get +2/+2 and gain flying until end of turn.","flavor":"The merfolk call the sky goddess Emeria. The kor call her Kamsa. The two races agree on little except that she offers many blessings to the faithful.","number":"38","rulings":[{"date":"2009-10-01","text":"You must target two creatures you control as you cast Windborne Charge. If you can't (because you control just one creature, perhaps), you can't cast the spell."}],"imageName":"windborne charge"},{"layout":"normal","type":"Creature - Fish","types":["Creature"],"colors":["Blue"],"multiverseid":170982,"name":"Windrider Eel","subtypes":["Fish"],"cmc":4,"rarity":"Common","artist":"Austin Hsu","power":"2","toughness":"2","manaCost":"{3}{U}","text":"Flying\n\nLandfall — Whenever a land enters the battlefield under your control, Windrider Eel gets +2/+2 until end of turn.","flavor":"\"The best spot to hook one is right behind the gills.\"\n\n—Rana Cloudwake, kor skyfisher","number":"78","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"windrider eel"},{"layout":"normal","type":"Creature - Avatar","types":["Creature"],"colors":["White"],"multiverseid":191376,"name":"World Queller","subtypes":["Avatar"],"cmc":5,"rarity":"Rare","artist":"James Paick","power":"4","toughness":"4","manaCost":"{3}{W}{W}","text":"At the beginning of your upkeep, you may choose a card type. If you do, each player sacrifices a permanent of that type.","flavor":"\"Why fight the world when you know who will win?\"\n\n—Nissa Revane","number":"39","rulings":[{"date":"2009-10-01","text":"You may choose any card type, including instant or sorcery. Choosing instant or sorcery will result in no permanents being sacrificed, though, since no permanents have those card types."},{"date":"2009-10-01","text":"You don't choose a card type until the ability resolves. Once you choose a type, it's too late for players to respond."},{"date":"2009-10-01","text":"First you choose which permanent you'll sacrifice (if you control any of the chosen type), then each other player in turn order does the same, then all chosen permanents are sacrificed at the same time."}],"imageName":"world queller"},{"layout":"normal","type":"Enchantment","types":["Enchantment"],"colors":["Red"],"multiverseid":183403,"name":"Zektar Shrine Expedition","cmc":2,"rarity":"Common","artist":"Justin Sweet","manaCost":"{1}{R}","text":"Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Zektar Shrine Expedition.\n\nRemove three quest counters from Zektar Shrine Expedition and sacrifice it: Put a 7/1 red Elemental creature token with trample and haste onto the battlefield. Exile it at the beginning of the next end step.","number":"155","rulings":[{"date":"2009-10-01","text":"The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad's ability, for example)."},{"date":"2009-10-01","text":"When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."}],"imageName":"zektar shrine expedition"},{"layout":"normal","type":"Creature - Elemental","types":["Creature"],"colors":["Green"],"multiverseid":189620,"name":"Zendikar Farguide","subtypes":["Elemental"],"cmc":5,"rarity":"Common","artist":"Vincent Proce","power":"3","toughness":"3","manaCost":"{4}{G}","text":"Forestwalk","flavor":"Expeditions follow the paths it leaves in its wake.","number":"194","imageName":"zendikar farguide"}]}